[
    {
        "id": 715494,
        "title": "Guinness and Brats",
        "steps": "We like to make this on the grill. While you can make these in the oven or on the stove, making them on the grill has always been the best option and the one we like the best.Take a large cast iron skillet and add the bratwurst links, quartered onions, and then pour a bottle of Guinness Stout over the ingredients. Place on the grill with a temperature of about 400 and then close the lid.About every 5-10 minutes lift the lid and toss the onions and brats in the Guinness. After about 45 minutes to an hour, you are done.Take a grilled brat and some caramelized onions onto a hotdog bun. Serve immediately.",
        "url": "http://www.pinkwhen.com/guinness-and-brats-recipe/",
        "servings": 4,
        "minutes": 55,
        "summary": "Guinness and Brats is a <b>dairy free</b> beverage. This recipe serves 4 and costs $1.28 per serving. One serving contains <b>361 calories</b>, <b>14g of protein</b>, and <b>21g of fat</b>. A mixture of guinness stout beer, hotdog buns, onions, and a handful of other ingredients are all it takes to make this recipe so yummy. 86 people were impressed by this recipe. It can be enjoyed any time, but it is especially good for <b>st. patrick day</b>. From preparation to the plate, this recipe takes approximately <b>55 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 72%</b>. This score is pretty good. Similar recipes include <a href=\"https://spoonacular.com/recipes/guinness-fudge-bundt-cake-with-guinness-ganache-no-beer-goggles-needed-572705\">Guinness Fudge Bundt Cake with Guinness Ganache – No Beer Goggles Needed</a>, <a href=\"https://spoonacular.com/recipes/guinness-week-stout-and-chocolate-mousse-with-guinness-oatmeal-cookies-206974\">Guinness Week: Stout and Chocolate Mousse with Guinness Oatmeal Cookies</a>, and <a href=\"https://spoonacular.com/recipes/mile-high-guinness-brownies-with-guinness-buttercream-frosting-730287\">Mile High Guinness Brownies with Guinness Buttercream Frosting</a>.",
        "nutrition": {
            "percentFat": 52.66,
            "percentCarbs": 31.82,
            "percentProtein": 15.52
        },
        "macro": "custom"
    },
    {
        "id": 641893,
        "title": "Easy Cheesy Pizza Casserole",
        "steps": "Brown ground beef in skillet; drain fat.  Mix in pasta or pizza sauce and pepper flakes; set aside.  Mix ricotta cheese with the herbs and Parmesan in a separate bowl; set aside.\nMix the dry ingredients for the biscuits.  Add milk and stir until combined.\nPreheat oven to 375 degrees.  Spray a 13 x 9 pan with non-stick spray.  Drop biscuit dough by teaspoons in the bottom of pan, spacing evenly.  It's OK if there is space between the dough--it will expand as it's cooked.  Top with ground beef mixture and dot with the ricotta cheese mixture.  Bake at 375 for about 20 min or until biscuits are puffed and beginning to get golden brown.\nTop with mozzarella and provolone cheeses and distribute pepperoni slices evenly over top, increase oven temperature to 425 degrees.  Return to oven and bake until cheeses are melted and beginning to bubble.  This should take about 10 minutes.\nRemove from oven and let stand 5 minutes before slicing and serving.  May be topped with the additional Parmesan cheese.",
        "url": "https://www.foodista.com/recipe/ZTHZWCWF/easy-cheesy-pizza-casserole",
        "servings": 6,
        "minutes": 45,
        "summary": "Forget going out to eat or ordering takeout every time you crave Mediterranean food. Try making Easy Cheesy Pizza Casserole at home. For <b>$3.01 per serving</b>, this recipe <b>covers 32%</b> of your daily requirements of vitamins and minerals. One serving contains <b>724 calories</b>, <b>41g of protein</b>, and <b>43g of fat</b>. This recipe serves 6. It works well as a pretty expensive main course. This recipe from Foodista requires equivalent amount of a ground beef/bulk sausage mix, additional parmesan cheese, herbed parmesan drop biscuits, and milk. 181 person were impressed by this recipe. It can be enjoyed any time, but it is especially good for <b>Autumn</b>. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. Overall, this recipe earns a <b>tremendous spoonacular score of 82%</b>. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/cheesy-pizza-casserole-166010\">Cheesy Pizza Casserole</a>, <a href=\"https://spoonacular.com/recipes/20-minute-cheesy-pizza-casserole-619758\">20 Minute Cheesy Pizza Casserole</a>, and <a href=\"https://spoonacular.com/recipes/cheesy-pizza-pasta-casserole-542709\">Cheesy Pizza Pasta Casserole</a>.",
        "nutrition": {
            "percentFat": 52.41,
            "percentCarbs": 25.35,
            "percentProtein": 22.24
        },
        "macro": "custom"
    },
    {
        "id": 1064362,
        "title": "How to Make The Ultimate Slow Cooker Potato Soup",
        "steps": "InstructionsCoat the cubed potatoes with flour and place in the slow cooker. Add diced onion, bacon, and sprinkle pepper over the potatoes. Pour chicken or vegetable stock over the potatoes and cook on high for 3 and 1/2 hours. Use a potato masher to slightly mash the cooked potatoes and add half and half.  Cook an additional 30 minutes. Scoop soup into bowls and add toppings of your choice.",
        "url": "https://www.pinkwhen.com/slow-cooker-baked-potato-soup-recipe/",
        "servings": 6,
        "minutes": 255,
        "summary": "How to Make The Ultimate Slow Cooker Potato Soup might be a good recipe to expand your soup recipe box. For <b>$1.22 per serving</b>, this recipe <b>covers 14%</b> of your daily requirements of vitamins and minerals. This recipe makes 6 servings with <b>410 calories</b>, <b>12g of protein</b>, and <b>20g of fat</b> each. 1 person has tried and liked this recipe. <b>Autumn</b> will be even more special with this recipe. It is brought to you by Pink When. Head to the store and pick up cheese, bacon, bacon, and a few other things to make it today. From preparation to the plate, this recipe takes around <b>4 hours and 15 minutes</b>. Overall, this recipe earns a <b>pretty good spoonacular score of 49%</b>. <a href=\"https://spoonacular.com/recipes/slow-cooker-potato-soup-592403\">slow cooker potato soup</a>, <a href=\"https://spoonacular.com/recipes/slow-cooker-potato-soup-424966\">Slow Cooker Potato Soup</a>, and <a href=\"https://spoonacular.com/recipes/slow-cooker-potato-soup-699561\">Slow Cooker Potato Soup</a> are very similar to this recipe.",
        "nutrition": {
            "percentFat": 49.29,
            "percentCarbs": 35.45,
            "percentProtein": 15.26
        },
        "macro": "custom"
    },
    {
        "id": 716351,
        "title": "Banana Milo Milkshake",
        "steps": "<p>In a blender, pour in your milk, milo, banana and ice-cream and blend till smooth.Pour into a glass, spray the whipped cream on top and sprinkle the chopped strawberries on top.Serve cool.    For those that asked, here is a link on how to make whipped cream.</p>",
        "url": "http://www.afrolems.com/2015/02/10/banana-milo-milkshake/",
        "servings": 1,
        "minutes": 45,
        "summary": "You can never have too many beverage recipes, so give Banana Milo Milkshake a try. For <b>$1.41 per serving</b>, this recipe <b>covers 12%</b> of your daily requirements of vitamins and minerals. This recipe makes 1 servings with <b>268 calories</b>, <b>4g of protein</b>, and <b>9g of fat</b> each. 139 people have made this recipe and would make it again. A mixture of handful of strawberries, banana, whipped cream, and a handful of other ingredients are all it takes to make this recipe so tasty. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 70%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/galletas-de-milo-milo-cookies-226942\">Galletas de Milo (Milo Cookies)</a>, <a href=\"https://spoonacular.com/recipes/strawberry-banana-milkshake-milkshake-without-ice-cream-600499\">Strawberry Banana Milkshake | Milkshake without ice cream</a>, and <a href=\"https://spoonacular.com/recipes/banana-milkshake-how-to-make-banana-milkshake-486735\">banana milkshake , how to make banana milkshake</a> for similar recipes.",
        "nutrition": {
            "percentFat": 26.9,
            "percentCarbs": 67.28,
            "percentProtein": 5.82
        },
        "macro": "custom"
    },
    {
        "id": 648638,
        "title": "Julia Child's Coq au Vin",
        "steps": "<ol><li>Blanch the bacon to remove some of its saltiness. Drop the bacon into a saucepan of cold water, covered by a couple of inches. Bring to a boil, simmer for 5 minutes, drain. Rinse in cold water, pat dry with paper towels. Cut the bacon into 1 inch by 1/4 inch pieces.</li><li>Brown bacon on medium high heat in a dutch oven big enough to hold the chicken, about 10 minutes. Remove the cooked bacon, set aside. Keep the bacon fat in the pan. Working in batches if necessary, add onions and chicken, skin side down. Brown the chicken well, on all sides, about 10 minutes. Halfway through the browning, add the garlic and sprinkle the chicken with salt and pepper.</li><li>Spoon off any excess fat. Add the chicken stock, wine, and herbs. Add back the bacon. Lower heat to a simmer. Cover and cook for 20 minutes, or until chicken is tender and cooked through. Remove chicken and onions to a separate platter. Remove the bay leaves, herb sprigs, garlic, and discard.</li><li>Add mushrooms to the remaining liquid and turn the heat to high. Boil quickly and reduce the liquid by three fourths until it becomes thick and saucy. Lower the heat, stir in the butter. Return the chicken and onions to the pan to reheat and coat with sauce. Adjust seasoning. Garnish with parsley and serve with potatoes or egg noodles.</li></ol>",
        "url": "http://www.foodista.com/recipe/FCQYLDSL/julia-child-s-coq-au-vin",
        "servings": 6,
        "minutes": 45,
        "summary": "Julia Child's Coq au Vin might be just the main course you are searching for. For <b>$3.73 per serving</b>, this recipe <b>covers 23%</b> of your daily requirements of vitamins and minerals. This recipe makes 6 servings with <b>620 calories</b>, <b>31g of protein</b>, and <b>41g of fat</b> each. 32 people were impressed by this recipe. A mixture of chicken stock, wine, button mushrooms, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is a good option if you're following a <b>gluten free and primal</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 66%</b>. This score is pretty good. Similar recipes include <a href=\"https://spoonacular.com/recipes/julia-childs-coq-au-vin-474447\">Julia Child’s Coq au Vin</a>, <a href=\"https://spoonacular.com/recipes/coq-au-vin-and-the-julia-child-100-502107\">Coq au Vin and the Julia Child 100</a>, and <a href=\"https://spoonacular.com/recipes/julia-childs-vichyssoise-648643\">Julia Child's Vichyssoise</a>.",
        "nutrition": {
            "percentFat": 65.54,
            "percentCarbs": 12.53,
            "percentProtein": 21.93
        },
        "macro": "custom"
    },
    {
        "id": 642293,
        "title": "Eggplant Parmesan",
        "steps": "Preheat oven to 350 degrees.\nSlice eggplant into 1/4 inch thick rounds and salt for 30 minutes to remove water.\nSaute onions and garlic in a tablespoon of oil. \nAdd tomatoes and oregano, simmer until sauce thickens slightly.\nDip each eggplant slice first into eggs, then into crumbs. Saute in hot olive oil until golden brown on both sides.\nPlace a layer of browned slices in 2 quart casserole; sprinkle with some of Parmesan, oregano and mozzarella; then cover well with some of tomato sauce. \nRepeat until all eggplant is used, topping last layer of sauce with several slices of mozzarella. \nBake until the sauce bubbles and the cheese is melted and browned, about 30 minutes.",
        "url": "https://www.foodista.com/recipe/S6VBT8C3/eggplant-parmesan",
        "servings": 4,
        "minutes": 45,
        "summary": "If you want to add more <b>Mediterranean</b> recipes to your collection, Eggplant Parmesan might be a recipe you should try. This recipe serves 4 and costs $3.1 per serving. One serving contains <b>824 calories</b>, <b>29g of protein</b>, and <b>62g of fat</b>. This recipe from Foodista requires mozzarella cheese, parmesan cheese, bread crumbs, and tomato sauce. It works well as a main course. 8 people were impressed by this recipe. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 64%</b>, which is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/crispy-baked-eggplant-fries-with-marinara-dipping-sauce-aka-eggplant-parmesan-fries-249194\">Crispy Baked Eggplant Fries with Marinara Dipping Sauce (akan Eggplant Parmesan Fries!)</a>, <a href=\"https://spoonacular.com/recipes/eggplant-parmesan-104085\">Eggplant Parmesan</a>, and <a href=\"https://spoonacular.com/recipes/eggplant-parmesan-103980\">Eggplant Parmesan</a>.",
        "nutrition": {
            "percentFat": 65.92,
            "percentCarbs": 20.36,
            "percentProtein": 13.72
        },
        "macro": "custom"
    },
    {
        "id": 661121,
        "title": "Spicy Lemongrass Soup",
        "steps": "Chop the lemongrass into 2 inch pieces and then slice down the center, add to the soup pot along with the broth and coconut milk, garlic and ginger.  Bring to a boil and them simmer on low for 30 minutes.  Once the broth is done simmering you will want to strain it through some cheese cloth.  The lemongrass stalks are not edible, I found that out the hard way.\nBring the broth back to a simmer and add the tofu, mushrooms, snow peas and the rice noodles.\nYou can add the lime juice at any time.\nI added some lime juice at the beginning and then some at the end before serving.\nSimmer until the noodles are soft.\nGarnish with grated ginger or scallions.",
        "url": "https://www.foodista.com/recipe/QSNYFL4Q/spicy-lemongrass-soup",
        "servings": 4,
        "minutes": 45,
        "summary": "Spicy Lemongrass Soup requires roughly <b>about 45 minutes</b> from start to finish. This dairy free, lacto ovo vegetarian, and vegan recipe serves 4 and costs <b>$2.94 per serving</b>. One serving contains <b>245 calories</b>, <b>7g of protein</b>, and <b>8g of fat</b>. 13 people have tried and liked this recipe. A couple people really liked this soup. Head to the store and pick up , snow peas, tofu cubes, and a few other things to make it today. <b>Autumn</b> will be even more special with this recipe. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 67%</b>. This score is good. Similar recipes include <a href=\"https://spoonacular.com/recipes/spicy-lemongrass-crab-46854\">Spicy Lemongrass Crab</a>, <a href=\"https://spoonacular.com/recipes/spicy-lemongrass-chicken-wings-526334\">Spicy Lemongrass Chicken Wings</a>, and <a href=\"https://spoonacular.com/recipes/spicy-mussels-with-ginger-and-lemongrass-42117\">Spicy Mussels with Ginger and Lemongrass</a>.",
        "nutrition": {
            "percentFat": 30.51,
            "percentCarbs": 58.93,
            "percentProtein": 10.56
        },
        "macro": "custom"
    },
    {
        "id": 655668,
        "title": "Peppermint Brookie Pies - gluten free, dairy free",
        "steps": "<ol><li>Preheat oven to 375 F.</li><li>For the pies:</li><li>Fill a medium saucepan (relatively the same size as the bowl) about 1/3 full with water and set over medium heat.</li><li>In a medium glass bowl, combine the bittersweet chocolate, semi-sweet chocolate and shortening.</li><li>When the water simmers, place the bowl of chocolate and shortening over the simmering water and lower the heat. Make sure your bowl does not touch the simmering water. The more you stir the shinier your cookies will be.</li><li>When the chocolate and shortening has melted, remove the bowl from the heat; stir to assure it's completely mixed. Set aside to cool a few minutes.</li><li>Meanwhile, in another bowl, whisk together the sugar, eggs, vanilla paste, and espresso. Set aside.</li><li>In another bowl, sift together the flour, cocoa powder, baking powder and salt. Set aside.</li><li>Whisk the melted chocolate into the sugar/egg mixture.</li><li>Add the flour mixture, whisk. Only whisk until blended, over-mixing can affect the texture of the pies.</li><li>Line 2 baking sheets with parchment paper, no need to grease the paper.</li><li>Drop a heaping tablespoon of batter (keeping the shapes as round as possible) onto the baking sheets. You are aiming for rounds that are about 2 inches in diameter. Take care to leave some room (about 2 inches) between each one to allow for spreading that will occur as they bake.</li><li>Bake for 6 to 8 minutes.</li><li>Leave in the oven an additional minute if they seem under baked. The cookie will have a brownie like crackling surface, and will feel soft, when ready.</li><li>Allow them to cool for about 10 minutes before gently lifting them off the baking sheet and onto a flat surface for piping the filling.</li><li>For the Filling:</li><li>Combine 1 1/4 cups sugar and the water in a small saucepan.</li><li>Heat over medium heat with a candy thermometer attached to the inside of the saucepan, and stir to dissolve. </li><li>When the mixture reaches 220 degrees F it is ready for the stand mixer.</li><li>Meanwhile, in a bowl of a stand mixer fitted with the whisk attachment, whisk the eggs on medium speed until it begins to look very foamy(about 3 minutes).</li><li>Avoiding the whisk, gradually add the remaining 2 tablespoons PLUS 1 teaspoon sugar. </li><li>Increase the speed to high and whip until soft white peaks are formed.</li><li>At this point check to see if your sugar has cooled. If it has cooled, turn heat back on to high until it comes back up to 220 degrees F just before adding to stand mixer.</li><li>When egg whites are at a soft peak stage resembling marshmallow fluff,slowly add the hot sugaralong the edge of the mixer avoiding the whisk.</li><li>Continue to whisk on high until the bowl has cooled, about 5 minutes.</li><li>Add peppermint extract, whisk another 30 seconds.</li><li>Refrigerate for 5 minutes before transferring to a piping bag with a plain tip attached or a large ziploc bag with one corner cut a 1/4 inch.</li><li>For Garnish:</li><li>Place candy canes between layers of wax paper, then sandwich between a dish towel.</li><li>Using a meat tenderizer, or the back of a dry measuring cup, pound the candy cane until broken up into very small pieces.</li><li>Make sure the candy cane is between wax paper first, otherwise, the candy cane will stick to the dish towel.</li><li>Assemble:</li><li>Turn the brookie cookies upside down, pipe about 2 tablespoons of filling onto half of the cookies.</li><li>Cover each filled cookie with a dry cookie, press down just enough so that filling adheres to the cookie.</li><li>Sprinkle crushed candy cane around the brookie pie edges.</li><li>Serve chilled or at room temperature.</li></ol>",
        "url": "http://www.foodista.com/recipe/4WL26GS4/peppermint-brookie-pies-gluten-free-dairy-free",
        "servings": 16,
        "minutes": 45,
        "summary": "Peppermint Brookie Pies - gluten free, dairy free might be just the dessert you are searching for. One serving contains <b>290 calories</b>, <b>3g of protein</b>, and <b>12g of fat</b>. This gluten free, dairy free, and fodmap friendly recipe serves 16 and costs <b>58 cents per serving</b>. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. If you have rice flour, eggs, ground espresso, and a few other ingredients on hand, you can make it. Only a few people made this recipe, and 6 would say it hit the spot. It can be enjoyed any time, but it is especially good for <b>Christmas</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 25%</b>. This score is rather bad. Similar recipes include <a href=\"https://spoonacular.com/recipes/thousand-island-dressing-gluten-free-corn-free-dairy-free-soy-free-nut-free-gum-free-and-refined-sugar-free-512186\">Thousand Island Dressing (Gluten-Free, Corn-Free, Dairy-Free, Soy-Free, Nut-Free, Gum-Free and Refined Sugar-Free)</a>, <a href=\"https://spoonacular.com/recipes/crock-pot-peppermint-fudge-gluten-free-dairy-free-556827\">Crock Pot Peppermint Fudge: [Gluten Free & Dairy Free]</a>, and <a href=\"https://spoonacular.com/recipes/gluten-free-vegan-walnut-and-oat-brownies-vegan-gluten-free-grain-free-flourless-dairy-free-no-refined-sugar-617963\">Gluten-Free Vegan Walnut and Oat Brownies (Vegan, Gluten-Free, Grain-Free, Flourless, Dairy-Free, No Refined Sugar)</a>.",
        "nutrition": {
            "percentFat": 36.47,
            "percentCarbs": 59.11,
            "percentProtein": 4.42
        },
        "macro": "custom"
    },
    {
        "id": 652417,
        "title": "Moroccan chickpea and lentil stew",
        "steps": "<ol><li>Heat oil in large saucepan over medium-high heat, add onion and cook for about 3 minutes.</li><li>Add celery, carrot and broccoli to pan and saut for about 5 minutes.</li><li>Add in all seasonings and cook additional 1 minute.</li><li>Add water, tomato paste, chickpeas and lentils, bring to a boil. Cover, reduce heat to low and simmer for 20 minutes.</li><li>Meanwhile, cook couscous in separate pan according to package directions.</li><li>Add cilantro and lemon juice to stew and serve over warm couscous.</li></ol>",
        "url": "http://www.foodista.com/recipe/C6DXLHJH/moroccan-chickpea-and-lentil-stew",
        "servings": 3,
        "minutes": 30,
        "summary": "Moroccan chickpean and lentil stew is a <b>dairy free, lacto ovo vegetarian, and vegan</b> main course. One portion of this dish contains around <b>20g of protein</b>, <b>7g of fat</b>, and a total of <b>467 calories</b>. This recipe serves 3. For <b>$1.34 per serving</b>, this recipe <b>covers 30%</b> of your daily requirements of vitamins and minerals. 11 person found this recipe to be tasty and satisfying. It will be a hit at your <b>Autumn</b> event. This recipe from Foodista requires lemon juice, ground turmeric, carrots, and ground cumin. From preparation to the plate, this recipe takes around <b>30 minutes</b>. With a spoonacular <b>score of 95%</b>, this dish is amazing. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/butternut-squash-chickpea-lentil-moroccan-stew-523871\">Butternut Squash, Chickpea & Lentil Moroccan Stew</a>, <a href=\"https://spoonacular.com/recipes/crockpot-moroccan-lentil-and-chickpea-soup-840995\">Crockpot Moroccan Lentil and Chickpea Soup</a>, and <a href=\"https://spoonacular.com/recipes/moroccan-chickpea-and-lentil-soup-harira-977492\">Moroccan Chickpean and Lentil Soup (Harira)</a>.",
        "nutrition": {
            "percentFat": 13.75,
            "percentCarbs": 69.38,
            "percentProtein": 16.87
        },
        "macro": "custom"
    },
    {
        "id": 639054,
        "title": "Chocolate Hazelnut Mousse",
        "steps": "Dissolve instant espresso in hot water in a medium sized bowl. Add the Nutella and Kahlua, beating until smooth.\nIn a mixer, whip the whipping cream until it forms stiff peaks. Gently fold the nutella mixture into the whipped cream until the color is uniform.\nDivide mousse into serving glasses- martini glasses work great! Add toasted hazelnuts, chocolate shavings, and pirouette cookies for decoration",
        "url": "https://www.foodista.com/recipe/KKWFXZ8H/chocolate-hazelnut-mousse",
        "servings": 4,
        "minutes": 45,
        "summary": "You can never have too many Southern recipes, so give Chocolate Hazelnut Mousse a try. One serving contains <b>593 calories</b>, <b>5g of protein</b>, and <b>47g of fat</b>. This recipe serves 4. For <b>$1.12 per serving</b>, this recipe <b>covers 9%</b> of your daily requirements of vitamins and minerals. 24 people have tried and liked this recipe. If you have dash of kahlua, chocolate-hazelnut pirouette cookies, water, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. It is brought to you by Foodista. Overall, this recipe earns a <b>rather bad spoonacular score of 32%</b>. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/hazelnut-chocolate-mousse-418406\">Hazelnut Chocolate Mousse</a>, <a href=\"https://spoonacular.com/recipes/chocolate-hazelnut-mousse-123643\">Chocolate-Hazelnut Mousse</a>, and <a href=\"https://spoonacular.com/recipes/chocolate-hazelnut-mousse-189594\">Chocolate-Hazelnut Mousse</a>.",
        "nutrition": {
            "percentFat": 70.26,
            "percentCarbs": 26.33,
            "percentProtein": 3.41
        },
        "macro": "custom"
    },
    {
        "id": 642863,
        "title": "Filipino Egg Rolls",
        "steps": "In a pan, saut garlic in olive oil until light brown.\nAdd onions. Saute until almost translucent.\nAdd the ground pork and sprinkle with  tsp salt and  tsp blackpepper. Stir-fry until no more pink color is showing.\nAdd carrots, oyster sauce and fish sauce.  Mix well.\nAdd shrimps and cook until pink then add egg. Mix well and remove from heat. Allow to completely cool down. Drain if necessary. Set aside the sauce.\nThe lumpia wrappers are very tightly packed, so be careful when pulling them apart.  Spoon 1 Tbsp mixture on the lower edge of the wrapper leaving 1 inch edge. Begin to fold egg roll like an envelope: first, fold over the lower 1 inch edge over the filing, then the left edge, then the right edge, then roll up to the top edge. To seal the wrapper just moisten the top edge with water. I used the sauce I got from draining the cooked mixture.\nHeat vegetable oil in a large, deep frying pan over medium high heat. Place egg roll one at a time into hot oil, with the seam down (this will keep it from unraveling) and then quickly turn the egg roll to ensure the skin crisp up and does not stick to other egg rolls in the pan. Adjust heat so that the oil is bubbling gently and not too vigorously around the egg rolls. Each egg roll will take about 5 minutes to cook. Shake the egg roll over the pan to help remove the excess oil. Place egg roll on layers of paper towels to drain.\nServe the lumpia or Filipino egg rolls with your favorite sweet and sour sauce or a spicy vinegar sauce.",
        "url": "https://www.foodista.com/recipe/JHNRHXPC/filipino-egg-rolls",
        "servings": 1,
        "minutes": 45,
        "summary": "If you have approximately <b>approximately 45 minutes</b> to spend in the kitchen, Filipino Egg Rolls might be an awesome <b>gluten free and dairy free</b> recipe to try. For <b>$11.84 per serving</b>, you get a hor d'oeuvre that serves 1. One serving contains <b>2068 calories</b>, <b>113g of protein</b>, and <b>169g of fat</b>. This recipe from Foodista requires ground beef, shrimps, lumpia wrappers, and salt. 14 people were glad they tried this recipe. This recipe is typical of Chinese cuisine. Taking all factors into account, this recipe <b>earns a spoonacular score of 88%</b>, which is amazing. Similar recipes are <a href=\"https://spoonacular.com/recipes/filipino-egg-rolls-94117\">Filipino Egg Rolls</a>, <a href=\"https://spoonacular.com/recipes/filipino-egg-pie-566676\">Filipino Egg Pie</a>, and <a href=\"https://spoonacular.com/recipes/vegetarian-lumpia-filipino-spring-rolls-613414\">Vegetarian Lumpia (Filipino Spring Rolls)</a>.",
        "nutrition": {
            "percentFat": 64,
            "percentCarbs": 5.21,
            "percentProtein": 30.79
        },
        "macro": "custom"
    },
    {
        "id": 646825,
        "title": "Holiday Cookies",
        "steps": "Preheat Oven 350 degrees:\nIn a large bowl combine the butter and sugar and mix until smooth. Add eggs and vanilla and continue to mix on low.\nCombine the baking powder with the flour and add slowly, while the mixer is on low, to the butter mixture. Add the finely chopped walnuts and the package of cherry gelatin to the batter.\nForm the dough into a disc and roll out to a quarter inch thickness. Using cookie cutters form into your favorite holiday shapes.\nPlace cookies on parchment paper and bake 10 to 12 minutes or until slightly golden on edges.",
        "url": "https://www.foodista.com/recipe/K88VYRLF/holiday-cookies",
        "servings": 24,
        "minutes": 45,
        "summary": "The recipe Holiday Cookies can be made <b>in around around 45 minutes</b>. This recipe serves 24. One serving contains <b>184 calories</b>, <b>3g of protein</b>, and <b>9g of fat</b>. For <b>26 cents per serving</b>, this recipe <b>covers 4%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista requires cherry gelatin, vanilla, eggs, and sugar. It works well as a dessert. 13 people have tried and liked this recipe. All things considered, we decided this recipe <b>deserves a spoonacular score of 14%</b>. This score is rather bad. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/holiday-cookies-one-dough-three-holiday-cookies-313532\">Holiday Cookies: One Dough, Three Holiday Cookies</a>, <a href=\"https://spoonacular.com/recipes/chocolate-mint-avocado-cookies-+-5-healthy-holiday-cookies-832090\">Chocolate Mint Avocado Cookies + 5 Healthy Holiday Cookies</a>, and <a href=\"https://spoonacular.com/recipes/holiday-star-cookies-462649\">Holiday Star Cookies</a>.",
        "nutrition": {
            "percentFat": 45.36,
            "percentCarbs": 48.22,
            "percentProtein": 6.42
        },
        "macro": "custom"
    },
    {
        "id": 634873,
        "title": "Best Baked Macaroni and Cheese",
        "steps": "<ol><li>Heat the oven to 375 degrees. Butter a 3-quart casserole dish; set aside. Place bread pieces in a medium bowl. In a small saucepan over medium heat, melt 2 tablespoons butter. Pour butter into the bowl with bread, and toss. Set the breadcrumbs aside. In a medium saucepan set over medium heat, heat milk. Melt remaining 6 tablespoons butter in a high-sided skillet over medium heat. When butter bubbles, add flour. Cook, stirring, 1 minute.</li><li>Slowly pour hot milk into flour-butter mixture while whisking. Continue cooking, whisking constantly, until the mixture bubbles and becomes thick.</li><li>Remove the pan from the heat. Stir in salt, nutmeg, black pepper, cayenne pepper, 3 cups cheddar, and 1 1/2 cups Gruyere. Set cheese sauce aside.</li><li>Fill a large saucepan with water. Bring to a boil. Add macaroni; cook 2 to 3 fewer minutes than manufacturers directions, until outside of pasta is cooked and inside is underdone. (Different brands of macaroni cook at different rates; be sure to read the instructions.) Transfer the macaroni to a colander, rinse under cold running water, and drain well. Stir macaroni into the reserved cheese sauce.</li><li>Pour the mixture into the prepared casserole dish. Sprinkle remaining 1 1/2 cups cheddar and 1/2 cup Gruyere; scatter breadcrumbs over the top. Bake until browned on top, about 30 minutes. Transfer dish to a wire rack to cool for 5 minutes; serve.</li></ol>",
        "url": "http://www.foodista.com/recipe/H3FCFX57/best-baked-macaroni-and-cheese",
        "servings": 12,
        "minutes": 45,
        "summary": "Best Baked Macaroni and Cheese might be just the main course you are searching for. For <b>$1.76 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. This recipe makes 12 servings with <b>577 calories</b>, <b>26g of protein</b>, and <b>32g of fat</b> each. 79 people have tried and liked this recipe. If you have flour, nutmeg, milk, and a few other ingredients on hand, you can make it. To use up the nutmeg you could follow this main course with the <a href=\"https://spoonacular.com/recipes/nutmeg-cake-600301\">Nutmeg Cake</a> as a dessert. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 63%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/macaroni-and-cheese-home-made-macaroni-and-cheese-is-a-comfort-food-that-is-hard-to-beat-you-can-put-away-the-pre-packaged-macaroni-and-cheese-at-the-store-600947\">Macaroni and Cheese – home made macaroni and cheese is a comfort food that is hard to beat. You can put away the pre packaged macaroni and cheese at the store</a>, <a href=\"https://spoonacular.com/recipes/baked-macaroni-and-cheese-633683\">Baked Macaroni and Cheese</a>, and <a href=\"https://spoonacular.com/recipes/baked-macaroni-and-cheese-338605\">Baked Macaroni and Cheese</a> for similar recipes.",
        "nutrition": {
            "percentFat": 50.76,
            "percentCarbs": 30.86,
            "percentProtein": 18.38
        },
        "macro": "custom"
    },
    {
        "id": 716381,
        "title": "Nigerian Snail Stew",
        "steps": "<p>In a bowl, wash the snails with lime and salt till all the slime is gone. Place the snail in a pot with the chili powder, seasoning cubes, chopped garlic, 1/2 of the onion(chopped) and a pinch of salt and bring to boil for about 15-18 minutes.In a separate pot, place the tomatoes, bell pepper, scotch bonnet peppers, crush with a wooden spoon till some of the juices come out and bring to boil till they are all soft on low heat. (This helps to dry up some of the extra water from the tomatoes)In a pot, pour in your oil, cut your onions in rings and fry in the hot oil on medium heat.Pour in your tomato-pepper mix and allow to fry for about 8-10 minutes on low heat.Pour in the left-over stock from the snail and allow to cook for 5 more minutes on medium heat.Add your seasoning cubes and taste for salt.Add your snails and stir in and allow to stew for 2-4 minutes more on medium heat.Serve with Rice, Pasta, Plantain, Yams or Potatoes.</p>",
        "url": "http://www.afrolems.com/2015/12/08/nigerian-snail-stew/",
        "servings": 1,
        "minutes": 45,
        "summary": "Nigerian Snail Stew might be just the main course you are searching for. For <b>$9.08 per serving</b>, this recipe <b>covers 45%</b> of your daily requirements of vitamins and minerals. This recipe makes 1 servings with <b>363 calories</b>, <b>23g of protein</b>, and <b>5g of fat</b> each. Plenty of people made this recipe, and 361 would say it hit the spot. If you have chili powder, snails, limes, and a few other ingredients on hand, you can make it. To use up the ice cubes you could follow this main course with the <a href=\"https://spoonacular.com/recipes/nectarine-blackberry-and-pecan-sundaes-50465\">Nectarine, Blackberry, and Pecan Sundaes</a> as a dessert. It can be enjoyed any time, but it is especially good for <b>Autumn</b>. It is a good option if you're following a <b>gluten free, dairy free, and whole 30</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 99%</b>. This score is spectacular. Try <a href=\"https://spoonacular.com/recipes/nigerian-kidney-bean-stew-with-a-peanut-sauce-112643\">Nigerian Kidney Bean Stew With a Peanut Sauce</a>, <a href=\"https://spoonacular.com/recipes/little-snail-rolls-369096\">Little Snail Rolls</a>, and <a href=\"https://spoonacular.com/recipes/maple-snail-cookies-76877\">Maple Snail Cookies</a> for similar recipes.",
        "nutrition": {
            "percentFat": 8.15,
            "percentCarbs": 68.94,
            "percentProtein": 22.91
        },
        "macro": "custom"
    },
    {
        "id": 645884,
        "title": "Grilled Spareribs With Birmingham Bbq Sauce",
        "steps": "Trim the ribs, including fat and membrane, leaving the rack of ribs whole and at room temperature.\nCombine all other ingredients except the honey and brown sugar. Lay ribs flat in a glass or ceramic dish and pour marinade over them. Allow to marinate at least 4 hours; better still, refrigerate overnight for maximum flavor. Bring to room temperature before grilling.\nRemove ribs from marinade. Scrape marinade from ribs with a rubber spatula and reserve. Grill ribs over a slow fire for about 40 minutes, turning frequently; fire should not flare up and burn them.\nPlace reserved marinade in a saucepan and add sugar and honey. Heat only until the sugar is dissolved. Brush on ribs and continue grilling about 20 minutes more, basting as often as necessary to keep ribs moist.\nSlice ribs just before serving. To serve, put 2 to 3 tablespoons of sauce on a plate and lay 2 or 3 ribs on top.\nNOTES : Jack Burson, a friend from Birmingham, Alabama, has told me that his hometown offers some of the best barbecue he has eaten. Now that he's a neighbor in New York, we cook together frequently. Here is our version of one of the best-ever barbecue sauces.",
        "url": "https://www.foodista.com/recipe/LXB7PL35/grilled-spareribs-with-birmingham-bbq-sauce",
        "servings": 6,
        "minutes": 45,
        "summary": "Grilled Spareribs With Birmingham Bbq Sauce is a <b>gluten free and dairy free</b> main course. This recipe makes 6 servings with <b>1224 calories</b>, <b>59g of protein</b>, and <b>96g of fat</b> each. For <b>$3.16 per serving</b>, this recipe <b>covers 37%</b> of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for <b>The Fourth Of July</b>. 15 people have made this recipe and would make it again. If you have brown sugar, peanut oil, mustard, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 79%</b>. This score is solid. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/grilled-bbq-chicken-pizza-with-cherry-chipotle-bbq-sauce-475295\">Grilled BBQ Chicken Pizza, with Cherry Chipotle BBQ Sauce</a>, <a href=\"https://spoonacular.com/recipes/sweet-mesquite-bbq-spareribs-265836\">Sweet Mesquite BBQ Spareribs</a>, and <a href=\"https://spoonacular.com/recipes/fall-off-the-bone-oven-bbq-pork-spareribs-558651\">Fall-Off-The-Bone Oven BBQ Pork Spareribs</a>.",
        "nutrition": {
            "percentFat": 71.21,
            "percentCarbs": 9.18,
            "percentProtein": 19.61
        },
        "macro": "custom"
    },
    {
        "id": 662276,
        "title": "Sun Dried Tomato and Herb Baked Eggs",
        "steps": "<ol><li>Preheat oven to 350 F.</li><li>Cover the inside of one ramekin or oven safe dish with olive oil.</li><li>Line the bottom of the dish with sundried tomatoes and break two eggs on top. Sprinkle with fresh herbs.</li><li>Bake uncovered for 15-20 minutes until egg whites are firm.</li><li>Serve immediately.</li></ol>",
        "url": "http://www.foodista.com/recipe/V4LG5KBB/sundried-tomato-and-herb-baked-eggs",
        "servings": 1,
        "minutes": 25,
        "summary": "Sun Dried Tomato and Herb Baked Eggs might be just the morn meal you are searching for. This recipe makes 1 servings with <b>179 calories</b>, <b>12g of protein</b>, and <b>13g of fat</b> each. For <b>86 cents per serving</b>, this recipe <b>covers 10%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista has 13 fans. From preparation to the plate, this recipe takes approximately <b>25 minutes</b>. If you have eggs, basil, sundried tomatoes, and a few other ingredients on hand, you can make it. It is a good option if you're following a <b>caveman, gluten free, dairy free, and primal</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 39%</b>. This score is not so tremendous. Try <a href=\"https://spoonacular.com/recipes/artichoke-and-sun-dried-tomato-pasta-926592\">Artichoke and Sun Dried Tomato Pasta</a>, <a href=\"https://spoonacular.com/recipes/easy-vegan-sun-dried-tomato-pesto-911250\">Easy Vegan Sun Dried Tomato Pesto</a>, and <a href=\"https://spoonacular.com/recipes/sun-dried-tomato-goat-cheese-frittata-928647\">Sun-Dried Tomato Goat Cheese Frittata</a> for similar recipes.",
        "nutrition": {
            "percentFat": 65.78,
            "percentCarbs": 7.75,
            "percentProtein": 26.47
        },
        "macro": "custom"
    },
    {
        "id": 633692,
        "title": "Baked Oatmeal with Dried Cranberries",
        "steps": "<ol><li>1.Preheat oven to 350F</li><li>2.Mix dry ingredients until well combined.</li><li>3. Mix liquid ingredients separately.</li><li>4.Add the liquid ingredients to the dry mix.</li><li>5.Mix well.</li><li>5.Spray a pan with a non-stick spray - the smaller the pan, the thicker the bars will be.</li><li>6.Pour the mix into the pan.</li><li>7.Bake for 45 minutes.</li><li>8.Enjoy!</li></ol>",
        "url": "http://www.foodista.com/recipe/VS5TY2X2/baked-oatmeal-with-dried-cranberries",
        "servings": 9,
        "minutes": 45,
        "summary": "Baked Oatmeal with Dried Cranberries might be just the morn meal you are searching for. This recipe serves 9 and costs 51 cents per serving. One serving contains <b>194 calories</b>, <b>5g of protein</b>, and <b>4g of fat</b>. A few people made this recipe, and 11 would say it hit the spot. It is perfect for <b>Christmas</b>. A mixture of cranberries, cinnamon, bananas, and a handful of other ingredients are all it takes to make this recipe so flavorful. It is a good option if you're following a <b>gluten free and dairy free</b> diet. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 55%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/baked-oatmeal-with-dried-cranberries-apricots-48700\">Baked Oatmeal with Dried Cranberries & Apricots</a>, <a href=\"https://spoonacular.com/recipes/overnight-oatmeal-with-almonds-and-dried-cranberries-55635\">Overnight Oatmeal With Almonds And Dried Cranberries</a>, and <a href=\"https://spoonacular.com/recipes/overnight-oatmeal-with-almonds-and-dried-cranberries-55826\">Overnight Oatmeal with Almonds and Dried Cranberries</a> for similar recipes.",
        "nutrition": {
            "percentFat": 16.74,
            "percentCarbs": 72.54,
            "percentProtein": 10.72
        },
        "macro": "custom"
    },
    {
        "id": 794538,
        "title": "Almond Joy Protein Shake",
        "steps": "",
        "url": "http://fullbellysisters.blogspot.com/2016/07/almond-joy-protein-shake.html",
        "servings": 1,
        "minutes": 45,
        "summary": "Almond Joy Protein Shake might be just the beverage you are searching for. Watching your figure? This gluten free, dairy free, and fodmap friendly recipe has <b>485 calories</b>, <b>24g of protein</b>, and <b>41g of fat</b> per serving. For <b>$2.24 per serving</b>, this recipe <b>covers 36%</b> of your daily requirements of vitamins and minerals. A mixture of coconut, coconut milk, chocolate protein powder, and a handful of other ingredients are all it takes to make this recipe so yummy. 22 people have made this recipe and would make it again. From preparation to the plate, this recipe takes about <b>45 minutes</b>. This recipe is typical of Southern cuisine. All things considered, we decided this recipe <b>deserves a spoonacular score of 97%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/almond-joy-protein-shake-549372\">Almond Joy Protein Shake</a>, <a href=\"https://spoonacular.com/recipes/almond-mocha-protein-shake-721178\">Almond Mocha Protein Shake</a>, and <a href=\"https://spoonacular.com/recipes/amazing-almond-dairy-free-protein-shake-248615\">Amazing Almond Dairy-Free Protein Shake</a> for similar recipes.",
        "nutrition": {
            "percentFat": 69.83,
            "percentCarbs": 11.72,
            "percentProtein": 18.45
        },
        "macro": "custom"
    },
    {
        "id": 657384,
        "title": "Pumpkin soup with wine",
        "steps": "Cut the pumpkin into large chunks, and place on a parchment or foil-lined baking sheet. Drizzle with oil and roast at 200C until fork-tender and golden.\nIn a blender mash the roasted pumpkin until smooth. Transfer into a soup pot.\nAdd cream, sour cream, wine and vegetable stock, stir and combine.\nBring the soup to a boil, then immediately remove from the flame.\nSprinkle with chopped fresh sage leaves serve with croutons.",
        "url": "https://www.foodista.com/recipe/ZTMMHNGC/pumpkin-soup-with-wine",
        "servings": 4,
        "minutes": 45,
        "summary": "Pumpkin soup with wine is a <b>gluten free and lacto ovo vegetarian</b> soup. This recipe serves 4 and costs $7.4 per serving. One serving contains <b>848 calories</b>, <b>8g of protein</b>, and <b>60g of fat</b>. 14 people were impressed by this recipe. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. It is perfect for <b>Autumn</b>. Head to the store and pick up muscat pumpkin, vegetable stock from 1 cube, cream, and a few other things to make it today. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 8%</b>. This score is very bad (but still fixable). Try <a href=\"https://spoonacular.com/recipes/red-wine-braised-venison-over-pumpkin-risotto-481108\">Red Wine Braised Venison over Pumpkin Risotto</a>, <a href=\"https://spoonacular.com/recipes/pumpkin-sage-ravioli-with-red-wine-cream-sauce-499155\">Pumpkin Sage Ravioli with Red Wine Cream Sauce</a>, and <a href=\"https://spoonacular.com/recipes/pumpkin-ravioli-in-a-parmesan-fondue-with-a-red-wine-reduction-77118\">Pumpkin Ravioli In A Parmesan Fondue With A Red Wine Reduction</a> for similar recipes.",
        "nutrition": {
            "percentFat": 74.43,
            "percentCarbs": 20.89,
            "percentProtein": 4.68
        },
        "macro": "custom"
    },
    {
        "id": 657178,
        "title": "Protein Packed Carrot Muffins",
        "steps": "<ol><li>Preheat oven to 350 f.</li><li>Grease a muffin tin or line it with cups.</li><li>Mix dry ingredients (the first 7) in a medium sized bowl.</li><li>In a large bowl combine coconut oil, eggs, vanilla, carrot, tofu, dried fruit and lemon zest.</li><li>Fold the dry mix into the large bowl just enough to properly combine them.  It is important not to over mix this batter.</li><li>Pour mixture into muffin tins.</li><li>Bake 20-25 minutes or until a tester comes out clean and dry.</li><li>Makes 6 over sized or 8 small muffins.</li><li>Muffins freeze well for 2 months.</li></ol>",
        "url": "http://www.foodista.com/recipe/PDQPZ4WL/protein-packed-carrot-muffins",
        "servings": 6,
        "minutes": 45,
        "summary": "Protein Packed Carrot Muffins might be just the morn meal you are searching for. Watching your figure? This gluten free and fodmap friendly recipe has <b>421 calories</b>, <b>19g of protein</b>, and <b>31g of fat</b> per serving. For <b>$1.63 per serving</b>, this recipe <b>covers 26%</b> of your daily requirements of vitamins and minerals. 20 people have made this recipe and would make it again. If you have walnut pieces, eggs, whey powder, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 89%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/protein-packed-microwave-muffins-622261\">Protein Packed Microwave Muffins</a>, <a href=\"https://spoonacular.com/recipes/carrot-cake-protein-muffins-720422\">Carrot Cake Protein Muffins</a>, and <a href=\"https://spoonacular.com/recipes/protein-packed-pizza-248207\">Protein Packed Pizza</a> for similar recipes.",
        "nutrition": {
            "percentFat": 64.71,
            "percentCarbs": 20.44,
            "percentProtein": 14.85
        },
        "macro": "custom"
    },
    {
        "id": 715560,
        "title": "World’s Greatest Lasagna Roll Ups",
        "steps": "In a large sauce pan on medium heat start browning your meat.On medium heat in a separate pan with the Tbsp of olive oil start to cook the onion, garlic, Italian seasoning, and basil for about 6-8 minutes, or until onion is translucent. Add this to the meat mixture, along with the tomatoes, tomato sauce, water, black pepper, and 2 tbsp of the fresh parsley. Allow to simmer uncovered for 1 hour.Bring a large pot of water to boil and begin cook the lasagna noodles for 8-10 minutes. Drain and rinse with cold water.In a small mixing bowl combine remaining parsley, ricotta cheese, egg,  tsp salt and mix well.Heat oven to 375. Pour some meat sauce into the bottom of a 9 x 13 glass baking dish.To make the roll ups place a noodle onto a flat surface and spread with the cheese mixture. Then sprinkle a little parmesan reggiano cheese on the cheese mixture.Then roll them up!Once you have all of the lasagna roll ups lined into the dish, cover each with a little more of the meat mixture. Top with a slice of mozzarella cheese and then cover the dish with foil. Bake in the oven for 20 minutes. Remove foil and bake for an additional 10 minutes uncovered. Remove from the oven and allow to cool for 10 minutes before serving.",
        "url": "http://www.pinkwhen.com/worlds-greatest-lasagna-roll-ups-recipe/",
        "servings": 18,
        "minutes": 110,
        "summary": "World’s Greatest Lasagna Roll Ups might be just the <b>Mediterranean</b> recipe you are searching for. This recipe makes 18 servings with <b>422 calories</b>, <b>22g of protein</b>, and <b>16g of fat</b> each. For <b>$1.37 per serving</b>, this recipe <b>covers 16%</b> of your daily requirements of vitamins and minerals. A mixture of ground beef, ricotta cheese, parsley, and a handful of other ingredients are all it takes to make this recipe so scrumptious. 35951 person have made this recipe and would make it again. From preparation to the plate, this recipe takes roughly <b>1 hour and 50 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 73%</b>. This score is good. Try <a href=\"https://spoonacular.com/recipes/freezer-lasagna-roll-ups-917017\">Freezer Lasagna Roll Ups</a>, <a href=\"https://spoonacular.com/recipes/chicken-bacon-ranch-lasagna-roll-ups-926669\">Chicken Bacon Ranch Lasagna Roll Ups</a>, and <a href=\"https://spoonacular.com/recipes/easy-pepperoni-pizza-lasagna-roll-ups-919103\">Easy Pepperoni Pizza Lasagna Roll Ups</a> for similar recipes.",
        "nutrition": {
            "percentFat": 34.06,
            "percentCarbs": 44.79,
            "percentProtein": 21.15
        },
        "macro": "custom"
    },
    {
        "id": 633338,
        "title": "Bacon Wrapped Filet Mignon",
        "steps": "Place the tenderloins on a large dish and wrap a slice of room temperature bacon around each filet, gently stretching the bacon if needed. Secure the ends of the bacon with a toothpick.\nCut the garlic cloves in half and rub both sides of each filet with the cut ends of the garlic. Season well with salt and pepper on both sides.\nPre-heat grill to very hot. With tongs, place each steak on the grill and for medium-rare cook for 3-4 minutes, rotating the steaks halfway through 90 degrees for nice grill marks.\nTurn the steaks over and cook another 3-4 minutes.\nRemove from the grill and let rest loosely covered for 5 minutes before removing toothpicks and serving. Serve as is or with sauted garlic mushrooms",
        "url": "https://www.foodista.com/recipe/XL2YFTWY/bacon-wrapped-filet-mignon",
        "servings": 4,
        "minutes": 45,
        "summary": "If you have approximately <b>approximately 45 minutes</b> to spend in the kitchen, Bacon Wrapped Filet Mignon might be an excellent <b>gluten free, dairy free, paleolithic, and primal</b> recipe to try. One serving contains <b>98 calories</b>, <b>3g of protein</b>, and <b>9g of fat</b>. This recipe serves 4. For <b>39 cents per serving</b>, this recipe <b>covers 2%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista has 61 fans. Head to the store and pick up salt& pepper, bacon, garlic, and a few other things to make it today. A couple people really liked this side dish. Taking all factors into account, this recipe <b>earns a spoonacular score of 7%</b>, which is very bad (but still fixable). If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/bacon-wrapped-filet-mignon-580733\">Bacon Wrapped Filet Mignon</a>, <a href=\"https://spoonacular.com/recipes/bacon-wrapped-filet-mignon-81768\">Bacon Wrapped Filet Mignon</a>, and <a href=\"https://spoonacular.com/recipes/honey-mustard-bacon-wrapped-filet-mignon-509274\">Honey Mustard Bacon Wrapped Filet Mignon</a>.",
        "nutrition": {
            "percentFat": 82.61,
            "percentCarbs": 3.21,
            "percentProtein": 14.18
        },
        "macro": "custom"
    },
    {
        "id": 660322,
        "title": "Smashed Fried Lemon Potatoes",
        "steps": "<ol><li>In a large pot of salted water place the well-scrubbed potatoes. Bring to a boil and cook until the potatoes are tender, about 20 minutes. Drain the potatoes and rinse with cold water. Using the palm, or the back of a large spatula, press the potatoes until slightly mashed.</li><li>In a large skillet, heat the olive oil over medium high heat. Add the garlic and cook until slightly brown. Remove and toss. Add the potatoes and cook without stirring for about 5 to 10 minutes, the bottoms need to be a nice golden brown color. Using a spatula or cooking thongs, turn and cook another 5 to 8 minutes. Transfer to a plate.</li><li>In a bowl mix together the lemon zest, lemon juice, olive oil, rosemary, parsley, thyme, vinegar and sea salt. Add the potatoes and coat them well gently.</li></ol>",
        "url": "http://www.foodista.com/recipe/38DN2VQF/smashed-fried-lemon-potatoes",
        "servings": 4,
        "minutes": 45,
        "summary": "You can never have too many side dish recipes, so give Smashed Fried Lemon Potatoes a try. This recipe makes 4 servings with <b>199 calories</b>, <b>4g of protein</b>, and <b>7g of fat</b> each. For <b>$1.16 per serving</b>, this recipe <b>covers 10%</b> of your daily requirements of vitamins and minerals. 6 people have tried and liked this recipe. If you have lemon zest, sea salt, olive oil, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>45 minutes</b>. It is a good option if you're following a <b>gluten free, whole 30, and vegan</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 78%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/fried-smashed-potatoes-with-onions-and-meyer-lemon-dressing-538966\">Fried Smashed Potatoes with Onions and Meyer Lemon Dressing</a>, <a href=\"https://spoonacular.com/recipes/fried-smashed-potatoes-640341\">Fried Smashed Potatoes</a>, and <a href=\"https://spoonacular.com/recipes/fried-smashed-potatoes-with-lemons-300266\">Fried Smashed Potatoes with Lemons</a> for similar recipes.",
        "nutrition": {
            "percentFat": 32.04,
            "percentCarbs": 60.8,
            "percentProtein": 7.16
        },
        "macro": "custom"
    },
    {
        "id": 715432,
        "title": "Buffalo Ranch Chicken Dip",
        "steps": "Take your chicken breasts and give them a light coat of the Poultry Magic seasoning, and then coat them with Pam cooking spray. (The Pam keeps the chicken from drying out while cooking.) Grill your chicken breasts and then allow to cool slightly.Preheat your oven to 350 degrees. Shred your chicken and then combine in a 13 x 9 inch glass baking dish with your Louisiana Hot Sauce. Place your cream cheese and dressing into a sauce pan over medium heat until the texture is smooth. Pour this mixture over your chicken and hot sauce mixture in the dish. Top with cheddar cheese and green onions.Bake un-covered for 30 minutes until bubbly. Let stand until slightly cooled, and then serve with tortilla chips of our choice!",
        "url": "http://www.pinkwhen.com/buffalo-ranch-chicken-dip/",
        "servings": 7,
        "minutes": 45,
        "summary": "Buffalo Ranch Chicken Dip might be just the hor d'oeuvre you are searching for. This recipe makes 7 servings with <b>753 calories</b>, <b>27g of protein</b>, and <b>68g of fat</b> each. For <b>$2.44 per serving</b>, this recipe <b>covers 24%</b> of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for <b>The Super Bowl</b>. If you have sharp cheddar cheese, ranch dressing, green onions, and a few other ingredients on hand, you can make it. 356 people have tried and liked this recipe. It is a good option if you're following a <b>gluten free</b> diet. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 75%</b>. This score is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/buffalo-chicken-dip-923959\">Buffalo Chicken Dip</a>, <a href=\"https://spoonacular.com/recipes/5-ingredient-buffalo-chicken-baked-hummus-dip-920160\">5-Ingredient Buffalo Chicken Baked Hummus Dip</a>, and <a href=\"https://spoonacular.com/recipes/buffalo-chicken-dip-with-ranch-583099\">Buffalo Chicken Dip with Ranch</a>.",
        "nutrition": {
            "percentFat": 75.65,
            "percentCarbs": 4.84,
            "percentProtein": 19.51
        },
        "macro": "custom"
    },
    {
        "id": 650092,
        "title": "Lime S’more Tartlets",
        "steps": "<ol><li>Prepare the graham crust: Preheat the oven to 350.</li><li>Put the graham crackers into a food processor and pulse until the crackers break down to the consistency of sand. Transfer to a large bowl. Stir in the salt and melted butter and mix until the butter has thoroughly incorporated; it should be the consistency of wet sand.</li><li>Press and pack the wet graham mixture into six buttered 4 -inch tart pans, making sure it goes up all the way on the sides and that the crust is thick and sturdy.</li><li>Arrange the tarts on 1 or 2 cookie sheets and bake for 12 minutes, or until the crusts are golden, but not browned. Remove the tart shells from the oven and set aside to cool.</li><li>If you are not using spring form pans, carefully remove the crusts from the pans at this stage and follow the recipe as follows.</li><li>The tart crusts can be stored in airtight plastic containers, in a single layer, for up to 24 hours.</li><li>Prepare the lime curd: Put the lime juice, sugar, eggs, and yolks in a stainless steel bowl and whisk well.</li><li>Fill a saucepan halfway with water, and bring the water to a boil over high heat, then lower the heat so the water is simmering. Set the bowl over the pot and whisk the lime mixture occasionally until it thickens, approximately 10 minutes. Then whisk in the butter, 1 piece at a time. When all of the butter is melted and incorporated, stir in the lime zest and remove the saucepan from the heat.</li><li>Remove the bowl from the saucepan and let it cool for 5 minutes.</li><li>Transfer the mixture to a blender or food processor, and blend until very smooth. You can also use an immersion/hand blender instead, if you have one.</li><li>The mixture can be made, cooled, covered, and refrigerated for up to 1 week.</li><li>Divide the mixture among the tart shells, leaving about half of space on the top for the chocolate ganache layer. Chill in the refrigerator while making the chocolate ganache, or until set.</li><li>Prepare the chocolate ganache: Over a double boiler (simmer water over low heat in a saucepan and put a heat-resistant bowl on top), melt the chocolate together with the sugar and butter. Stir constantly until the sugar is well incorporated and the mixture is smooth and shiny.</li><li>Remove the melted chocolate from the heat and let it cool for 5 minutes.</li><li>Carefully, pour the liquid chocolate ganache over each tartlet, making sure that the chocolate does not over-flow the graham crust sides. Return the tarts to the refrigerator and chill for 1 to 2 hours, or until the ganache has set. (The ganache on top should take on a smooth matte finish.)</li><li>Prepare the meringue and finish the tarts: In the bowl of a standing mixer fitted with a whip attachment, whip the reserved egg whites until frothy. Slowly add the sugar, then the cream of tartar, continuing to whip until well incorporated. Increase the stand mixer to medium speed and whip until the whites are shiny and form a stiff peak. Do not over-whip or they will become grainy.</li><li>Transfer the meringue into a pastry bag fitted with a star tip, and pipe it around the edge of each tart. Or, transfer it into a large freezer bag, seal tightly, and snip off one corner. Pipe the meringue on as desired.</li><li>Using a brulee torch, quickly brown the meringue, being careful not to melt the chocolate ganache on top. (Due to the chocolate ganache layer, the meringues should not be browned under a broiler.)</li></ol>",
        "url": "http://www.foodista.com/recipe/ZPKPSYSG/lime-smore-tartlets",
        "servings": 1,
        "minutes": 45,
        "summary": "Lime S’more Tartlets might be just the hor d'oeuvre you are searching for. For <b>$25.07 per serving</b>, this recipe <b>covers 81%</b> of your daily requirements of vitamins and minerals. One serving contains <b>8650 calories</b>, <b>173g of protein</b>, and <b>308g of fat</b>. 38 people have made this recipe and would make it again. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. If you have granulated sugar, spring form tart pans, lime juice, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 92%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/key-lime-tartlets-134297\">Key Lime Tartlets</a>, <a href=\"https://spoonacular.com/recipes/key-lime-tartlets-602545\">Key Lime Tartlets</a>, and <a href=\"https://spoonacular.com/recipes/lime-tartlets-424598\">Lime Tartlets</a> for similar recipes.",
        "nutrition": {
            "percentFat": 32.06,
            "percentCarbs": 59.91,
            "percentProtein": 8.03
        },
        "macro": "custom"
    },
    {
        "id": 636589,
        "title": "Butternut Squash Frittata",
        "steps": "<ol><li>Preheat oven to 350</li><li>Spray a 10 oz oven safe dish with cooking spray</li><li>Add your butternut squash</li><li>In a measuring cup add your eggs and milk. Mix until combined. Pour over butternut squash.</li><li>Sprinkle with pepper and top with cheese.</li><li>Bake in oven for 30-35 minutes, until middle is slightly firm</li><li>Let it cool for a few minutes</li></ol>",
        "url": "http://www.foodista.com/recipe/XQXFKGHT/butternut-squash-frittata",
        "servings": 1,
        "minutes": 45,
        "summary": "Butternut Squash Frittatan is a <b>gluten free</b> main course. One serving contains <b>446 calories</b>, <b>24g of protein</b>, and <b>4g of fat</b>. For <b>$3.03 per serving</b>, this recipe <b>covers 50%</b> of your daily requirements of vitamins and minerals. 18 people were impressed by this recipe. If you have butternut squash, pepper, liquid egg substitute, and a few other ingredients on hand, you can make it. To use up the liquid egg substitute you could follow this main course with the <a href=\"https://spoonacular.com/recipes/blueberry-cake-51430\">Blueberry Cake</a> as a dessert. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 98%</b>. This score is excellent. Try <a href=\"https://spoonacular.com/recipes/butternut-squash-frittata-750335\">Butternut Squash Frittata</a>, <a href=\"https://spoonacular.com/recipes/sausage-and-butternut-squash-frittata-563285\">Sausage and Butternut Squash Frittata</a>, and <a href=\"https://spoonacular.com/recipes/butternut-squash-and-quinoa-frittata-521598\">Butternut Squash and Quinoa Frittata</a> for similar recipes.",
        "nutrition": {
            "percentFat": 6.92,
            "percentCarbs": 74.23,
            "percentProtein": 18.85
        },
        "macro": "custom"
    },
    {
        "id": 664054,
        "title": "Turkey Sausage, Chard & Sweet Potato Breakfast Scramble",
        "steps": "<ol><li>In a medium-sized skillet, heat about two teaspoons of olive oil on medium heat. Add the chopped sweet potato and saut 3 or 4 minutes before adding a little liquid and covering. In about 2 minutes, check to see if the liquid has burned off. If it has, add a little more and cover again. Repeat this several times until the sweet potato is soften, but still al dente. Add the mushrooms and the chopped chard stems. Saut another 3 to 5 minutes and add additional liquid if necessary.</li><li>Move the veggies to one side of the skillet with a wooden spoon and add the ground breakfast sausage. Brown the meat and using the wooden spoon break it apart. Continue sauting until the sausage is cooked all the way through.</li><li>Immediately add the green onion and chard leaves. Allow to steam for about 30 seconds before pouring the scrambled egg mixture evenly over the meat and veggies. This is where the technique comes in. Avoid the temptation to stir. Simply allow the skillet to sit 2 to three minutes. Then, using a wooden spoon or spatula, begin flipping sections of egg and veggies (similar to how you would fold whipped egg whites into a cake batter, just gently fold the scramble onto itself). Once all sections have been flipped over, everything to sit and cook another 2 or 3 minutes. Repeat the flipping.  Continue doing this until the egg is no longer cooking to the skillet.</li><li>Serve with your favorite toppings!</li></ol>",
        "url": "http://www.foodista.com/recipe/S3LTQRHW/turkey-sausage-chard-sweet-potato-breakfast-scramble",
        "servings": 2,
        "minutes": 45,
        "summary": "Turkey Sausage, Chard & Sweet Potato Breakfast Scramble might be just the morn meal you are searching for. One serving contains <b>471 calories</b>, <b>32g of protein</b>, and <b>32g of fat</b>. For <b>$2.28 per serving</b>, this recipe <b>covers 33%</b> of your daily requirements of vitamins and minerals. 3 people were impressed by this recipe. A mixture of olive oil, baby portabella mushrooms, green onion, and a handful of other ingredients are all it takes to make this recipe so tasty. From preparation to the plate, this recipe takes about <b>45 minutes</b>. It is a good option if you're following a <b>caveman, gluten free, dairy free, and primal</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 82%</b>. This score is spectacular. Try <a href=\"https://spoonacular.com/recipes/rutabaga-and-sweet-potato-breakfast-hash-with-turkey-sausage-587476\">Rutabagan and Sweet Potato Breakfast Hash with Turkey Sausage</a>, <a href=\"https://spoonacular.com/recipes/mexican-egg-and-sweet-potato-breakfast-scramble-476084\">Mexican Egg and Sweet Potato Breakfast Scramble</a>, and <a href=\"https://spoonacular.com/recipes/smoked-salmon-collards-and-sweet-potato-breakfast-scramble-551533\">Smoked Salmon, Collards and Sweet Potato Breakfast Scramble</a> for similar recipes.",
        "nutrition": {
            "percentFat": 64.61,
            "percentCarbs": 11.91,
            "percentProtein": 23.48
        },
        "macro": "custom"
    },
    {
        "id": 639865,
        "title": "Coffee Cookies",
        "steps": "Preheat oven to 350 degrees F and line a cookie sheet with parchment paper.\nPut the cake flour, sugar, coffee, walnuts, and salt in a food processor and process for about 10 seconds (or until the walnuts are well grounded).\nNow put the mixture into a mixing bowl and add canola oil. Form a pasty dough, then separate the dough with your hands to form small crumbs. Add the water and form into a clean dough. If you like raisins, you can combine it with the dough now.\nDivide the dough into 16 pieces and roll each piece into a ball. Put each ball on a cookie sheet and bake at 350 degrees F for 25 minutes.\nLet the cookies cool for about 20 minutes. Dust with powdered sugar before serving.",
        "url": "https://www.foodista.com/recipe/7FD6YGWV/coffee-cookies",
        "servings": 16,
        "minutes": 45,
        "summary": "If you have around <b>approximately 45 minutes</b> to spend in the kitchen, Coffee Cookies might be a super <b>dairy free</b> recipe to try. One serving contains <b>81 calories</b>, <b>1g of protein</b>, and <b>5g of fat</b>. For <b>13 cents per serving</b>, this recipe <b>covers 2%</b> of your daily requirements of vitamins and minerals. This recipe serves 16. A few people made this recipe, and 13 would say it hit the spot. It works well as a dessert. A mixture of canolan oil, water, raisins, and a handful of other ingredients are all it takes to make this recipe so yummy. It is brought to you by Foodista. With a spoonacular <b>score of 4%</b>, this dish is very bad (but still fixable). Try <a href=\"https://spoonacular.com/recipes/coffee-cookies-627023\">Coffee Cookies</a>, <a href=\"https://spoonacular.com/recipes/coffee-bean-cookies-54727\">Coffee Bean Cookies</a>, and <a href=\"https://spoonacular.com/recipes/coffee-cake-cookies-631238\">Coffee Cake Cookies</a> for similar recipes.",
        "nutrition": {
            "percentFat": 51.4,
            "percentCarbs": 42.41,
            "percentProtein": 6.19
        },
        "macro": "custom"
    },
    {
        "id": 636365,
        "title": "Brussels Sprouts with Bacon and Shallots",
        "steps": "<ol><li>In a large skillet place the bacon and cook until golden brown.</li><li>Add the shallots and cook until tender. Add the Brussels sprouts and saut to high heat to give it a nice golden outside.</li><li>Add a squeeze of lemon, salt and pepper to season and serve.</li></ol>",
        "url": "http://www.foodista.com/recipe/G3FR8CXJ/brussels-sprouts-with-bacon-and-shallots",
        "servings": 4,
        "minutes": 45,
        "summary": "Brussels Sprouts with Bacon and Shallots might be just the side dish you are searching for. One serving contains <b>124 calories</b>, <b>7g of protein</b>, and <b>5g of fat</b>. For <b>$1.33 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. A couple people made this recipe, and 20 would say it hit the spot. A mixture of bacon, salt and pepper, lemon juice, and a handful of other ingredients are all it takes to make this recipe so tasty. It is a good option if you're following a <b>caveman, gluten free, dairy free, and primal</b> diet. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 80%</b>. This score is good. Try <a href=\"https://spoonacular.com/recipes/brussels-sprouts-with-bacon-garlic-and-shallots-10699\">Brussels Sprouts with Bacon, Garlic, and Shallots</a>, <a href=\"https://spoonacular.com/recipes/roasted-brussels-sprouts-with-bacon-and-shallots-534752\">Roasted Brussels Sprouts with Bacon and Shallots</a>, and <a href=\"https://spoonacular.com/recipes/brussels-sprouts-with-crispy-bacon-and-shallots-206996\">Brussels Sprouts with Crispy Bacon and Shallots</a> for similar recipes.",
        "nutrition": {
            "percentFat": 31.46,
            "percentCarbs": 47.65,
            "percentProtein": 20.89
        },
        "macro": "custom"
    },
    {
        "id": 652513,
        "title": "Mozzarella Sticks",
        "steps": "<ol><li>Taste of Home. It won a prize in their cheese contest. Mary Merchant of</li><li>In a small bowl, beat eggs and water. In a plastic bag, combine bread crumbs, Italian seasoning, garlic powder and pepper. Coat cheese sticks in flour, then dip in egg mixture and bread crumb mixture. Repeat egg and bread crumb coatings. Cover and chill for at least 4 hours or overnight.</li><li>Place on an ungreased baking sheet; drizzle with butter. Bake, uncovered, at 400 for 6 to 8 minutes or until heated through. Allow to stand for 3 to 5 minutes before serving. Use marinara or spaghetti sauce for dipping.</li><li>Yield: 4 to 6 servings.</li><li>Note: Regular mozzarella cheese, cut into 4 inch by 1/2 inch sticks can be substituted for the string cheese.</li></ol>",
        "url": "http://www.foodista.com/recipe/LVT5MJLZ/mozzarella-sticks",
        "servings": 1,
        "minutes": 45,
        "summary": "Mozzarella Sticks might be just the hor d'oeuvre you are searching for. For <b>$10.35 per serving</b>, this recipe <b>covers 45%</b> of your daily requirements of vitamins and minerals. One serving contains <b>1773 calories</b>, <b>104g of protein</b>, and <b>98g of fat</b>. Head to the store and pick up flour, water, eggs, and a few other things to make it today. A couple people made this recipe, and 11 would say it hit the spot. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 83%</b>. This score is great. Try <a href=\"https://spoonacular.com/recipes/mozzarella-sticks-296374\">Mozzarella Sticks</a>, <a href=\"https://spoonacular.com/recipes/mozzarella-sticks-675804\">Mozzarella Sticks</a>, and <a href=\"https://spoonacular.com/recipes/mozzarella-sticks-79012\">Mozzarella Sticks</a> for similar recipes.",
        "nutrition": {
            "percentFat": 49.1,
            "percentCarbs": 27.85,
            "percentProtein": 23.05
        },
        "macro": "custom"
    },
    {
        "id": 638038,
        "title": "Chicken Cordon Bleu With Mushroom Sauce",
        "steps": "<ol><li>Slice the chicken breast down the middle to form a pocket in the chicken. Add in your cheese slices and ham.</li><li>Close chicken up with either toothpicks or kitchen twine.</li><li>Mix together the panko and the tarragon. Roll the breasts in the mixture.</li><li>Heat a large pan on medium high heat and add in the oil. When the oil is heated, add in your breasts and cook for a minute or two on each side.</li><li>Place breasts in an oven preheated to 350 degrees and cook for 25-30 minutes or until juices run clear.</li><li>While chicken is cooking, grab up a large saute pan, add the butter and melt it on medium heat.</li><li>Add in the mushrooms and cook for a minute or two.</li><li>Add in the garlic, onion, tarragon, and salt and cook for an additional 2 to 3 minutes.</li><li>Add in the flour and stir to coat.</li><li>Add in the wine and chicken broth and allow the sauce to heat back up and thicken.</li><li>Once thickened, remove from heat and stir in the half & half and fresh parsley. Add additional salt if needed.</li><li>Pour over cordon bleu and serve.</li></ol>",
        "url": "http://www.foodista.com/recipe/GDYH8VKD/chicken-cordon-bleu-with-mushroom-sauce",
        "servings": 4,
        "minutes": 45,
        "summary": "Chicken Cordon Bleu With Mushroom Sauce might be just the main course you are searching for. This recipe makes 4 servings with <b>533 calories</b>, <b>42g of protein</b>, and <b>32g of fat</b> each. For <b>$2.98 per serving</b>, this recipe <b>covers 26%</b> of your daily requirements of vitamins and minerals. Not a lot of people made this recipe, and 5 would say it hit the spot. If you have cooking oil, flour, garlic, and a few other ingredients on hand, you can make it. To use up the white wine you could follow this main course with the <a href=\"https://spoonacular.com/recipes/white-wine-frozen-yogurt-206235\">White Wine Frozen Yogurt</a> as a dessert. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 69%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-with-mushroom-sauce-and-rice-471050\">Chicken Cordon Bleu with Mushroom Sauce and Rice</a>, <a href=\"https://spoonacular.com/recipes/pork-tenderloin-cordon-bleu-with-mushroom-mustard-cream-sauce-202451\">Pork Tenderloin Cordon Bleu with Mushroom-Mustard Cream Sauce</a>, and <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-with-creamy-mustard-sauce-492033\">Chicken Cordon Bleu with Creamy Mustard Sauce</a> for similar recipes.",
        "nutrition": {
            "percentFat": 49.11,
            "percentCarbs": 9.48,
            "percentProtein": 41.41
        },
        "macro": "custom"
    },
    {
        "id": 715455,
        "title": "Homemade Pecan Pie",
        "steps": "Heat your oven to 350.In a medium mixing bowl mix sugar and butter. Add in corn syrup and eggs and mix well.Add in pecan halves and make sure they are fully covered and mixed in to the recipe.Pour mixture into 9\" pie crust and bake for 35-40 minutes.Remove from oven and place on a wire rack to cool for an hour before serving.",
        "url": "http://www.pinkwhen.com/homemade-pecan-pie-recipe/",
        "servings": 6,
        "minutes": 40,
        "summary": "The recipe Homemade Pecan Pie is ready <b>in approximately 40 minutes</b> and is definitely an awesome <b>vegetarian</b> option for lovers of Southern food. One serving contains <b>446 calories</b>, <b>5g of protein</b>, and <b>19g of fat</b>. For <b>91 cents per serving</b>, you get a dessert that serves 6. 7730 people have made this recipe and would make it again. It is perfect for <b>Thanksgiving</b>. A mixture of pie shell, pecans halves, eggs, and a handful of other ingredients are all it takes to make this recipe so delicious. All things considered, we decided this recipe <b>deserves a spoonacular score of 29%</b>. This score is not so awesome. Similar recipes include <a href=\"https://spoonacular.com/recipes/mini-chocolate-pecan-pie-cheesecake-927717\">Mini Chocolate Pecan Pie Cheesecake</a>, <a href=\"https://spoonacular.com/recipes/homemade-french-silk-pie-from-scratch-909019\">Homemade French Silk Pie (From Scratch)</a>, and <a href=\"https://spoonacular.com/recipes/easy-homemade-apple-pie-filling-924524\">Easy Homemade Apple Pie Filling</a>.",
        "nutrition": {
            "percentFat": 37.83,
            "percentCarbs": 57.93,
            "percentProtein": 4.24
        },
        "macro": "custom"
    },
    {
        "id": 660382,
        "title": "Smoked Salmon Pasta",
        "steps": "<ol><li>In saucepan, melt butter over medium heat. </li><li>Saute onion and red pepper about 1 minute. </li><li>Add garlic and saute for another minute or two. Add smoked salmon and saute 2 minutes. </li><li>Bring the temperature up a notch and add cream, milk, salt, pepper, thyme, and half of the Parmesan cheese. </li><li>Reduce to low. </li><li>Stir gently about 5 minutes until it thickens a bit. Don't let it boil. </li><li>Remove from heat and keep warm. </li><li>Cook pasta following package instructions until al dente. </li><li>Pour sauce over pasta. Sprinkle with more Parmesan cheese to serve.</li></ol>",
        "url": "http://www.foodista.com/recipe/YFCWP7PB/smoked-salmon-pasta",
        "servings": 4,
        "minutes": 45,
        "summary": "Smoked Salmon Pasta might be just the main course you are searching for. This recipe makes 4 servings with <b>474 calories</b>, <b>21g of protein</b>, and <b>22g of fat</b> each. For <b>$2.96 per serving</b>, this recipe <b>covers 21%</b> of your daily requirements of vitamins and minerals. If you have milk, salmon, salt and pepper, and a few other ingredients on hand, you can make it. To use up the milk you could follow this main course with the <a href=\"https://spoonacular.com/recipes/milky-way-brownie-bites-540544\">Milky Way Brownie Bites</a> as a dessert. From preparation to the plate, this recipe takes around <b>45 minutes</b>. A couple people made this recipe, and 33 would say it hit the spot. It is a good option if you're following a <b>pescatarian</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 68%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/smoked-salmon-pasta-247226\">Smoked Salmon Pasta</a>, <a href=\"https://spoonacular.com/recipes/smoked-salmon-pasta-87836\">Smoked Salmon Pasta</a>, and <a href=\"https://spoonacular.com/recipes/pasta-with-smoked-salmon-270708\">Pasta with Smoked Salmon</a> for similar recipes.",
        "nutrition": {
            "percentFat": 41.53,
            "percentCarbs": 40.39,
            "percentProtein": 18.08
        },
        "macro": "custom"
    },
    {
        "id": 663696,
        "title": "Tortellini In Brodo",
        "steps": "<ol><li>Heat the stock to a boil and cook the tortellini. Ladle into bowls, squeeze in lemon and stir. Grate cheese and zest on top, and add some freshly ground salt and pepper. Serve immediately.</li></ol>",
        "url": "http://www.foodista.com/recipe/RPG7M62J/tortellini-in-brodo",
        "servings": 6,
        "minutes": 45,
        "summary": "Tortellini In Brodo might be just the side dish you are searching for. This recipe serves 6 and costs 44 cents per serving. One serving contains <b>71 calories</b>, <b>4g of protein</b>, and <b>2g of fat</b>. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. A few people made this recipe, and 13 would say it hit the spot. A mixture of parmigiano-reggiano, lemon juice, lemon zest, and a handful of other ingredients are all it takes to make this recipe so delicious. All things considered, we decided this recipe <b>deserves a spoonacular score of 20%</b>. This score is not so tremendous. Try <a href=\"https://spoonacular.com/recipes/tortellini-soup-tortellini-en-brodo-867166\">Tortellini Soup (Tortellini en Brodo)</a>, <a href=\"https://spoonacular.com/recipes/tortellini-in-brodo-76912\">Tortellini In Brodo</a>, and <a href=\"https://spoonacular.com/recipes/tortellini-in-parmesan-brodo-773951\">Tortellini in Parmesan Brodo</a> for similar recipes.",
        "nutrition": {
            "percentFat": 27.3,
            "percentCarbs": 49.46,
            "percentProtein": 23.24
        },
        "macro": "custom"
    },
    {
        "id": 646651,
        "title": "Herb chicken with sweet potato mash and sautéed broccoli",
        "steps": "<ol><li> Preheat the oven to 350F (180C) or 320F (160C) for convection oven and cook the chicken according to the pack instructions.</li><li> About 15 minutes before the end of the chicken cooking time, place the diced potato into boiling water for 5 minutes, then add the sweet potato and cook until the potatoes are tender. Roughly mash, adding butter, salt, and pepper to taste, then mash thoroughly.</li><li> Heat the oil in a pan and quickly saut the broccoli until tender. Cover to keep warm.</li><li> Remove the chicken from the oven, leave to cool for a minute then cut the bag open and gently tip the contents into a dish.</li><li> Slice the chicken breasts into chunky pieces on a board, keeping the chicken breast shape together.</li><li> Serve the mash potato topped with the chicken and remaining sauce with a side of broccoli.</li></ol>",
        "url": "http://www.foodista.com/recipe/NHZKT2K8/serve-a-sensationally-seasoned-chicken-dish",
        "servings": 4,
        "minutes": 45,
        "summary": "Herb chicken with sweet potato mash and sautéed broccoli might be just the main course you are searching for. This recipe makes 4 servings with <b>554 calories</b>, <b>43g of protein</b>, and <b>26g of fat</b> each. For <b>$2.49 per serving</b>, this recipe <b>covers 43%</b> of your daily requirements of vitamins and minerals. Head to the store and pick up pepper and salt, sweet potatoes, russet potato, and a few other things to make it today. To use up the unsalted butter you could follow this main course with the <a href=\"https://spoonacular.com/recipes/almond-milk-chocolate-pudding-260830\">Almond Milk Chocolate Pudding</a> as a dessert. 4 people have made this recipe and would make it again. It is a good option if you're following a <b>gluten free</b> diet. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 91%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/sesame-halloumi-parcels-with-sweet-potato-tahini-mash-chopped-herb-salad-219911\">Sesame halloumi parcels with sweet potato tahini mash & chopped herb salad</a>, <a href=\"https://spoonacular.com/recipes/thanksgiving-foragers-pie-wild-mushrooms-herb-gravy-and-sweet-potato-mash-in-a-flaky-spelt-crust-vegan-700725\">Thanksgiving Foragers Pie: Wild Mushrooms, Herb Gravy, and Sweet Potato Mash in a Flaky Spelt Crust [Vegan]</a>, and <a href=\"https://spoonacular.com/recipes/moroccan-chicken-with-sweet-potato-mash-219222\">Moroccan chicken with sweet potato mash</a> for similar recipes.",
        "nutrition": {
            "percentFat": 31.84,
            "percentCarbs": 42.74,
            "percentProtein": 25.42
        },
        "macro": "custom"
    },
    {
        "id": 633171,
        "title": "Avocado-Mango Salad With Grilled Shrimp",
        "steps": "Preheat gas grill to high.\nMake the dressing: Combine all dressing ingredients (except oil) in a blender and blend until smooth. While blender is running, remove lid and pour in oil in a steady stream. Continue blending for several seconds, then remove and set aside.\nPrepare the shrimp: Rinse shrimp and pat dry with a papertowel. Add about 1/3 cup of dressing and toss to coat. Let sit for 15 to 20 minutes. String onto wooden or metal skewars for grilling. Grill over high heat for about 2 to 3 minutes per side. Remove from grill, let cool, them remove from skewars.\nIn a large bowl, combine mango, avocado and grilled shrimp. Add dressing to taste; toss lightly and serve.",
        "url": "https://www.foodista.com/recipe/NSTFKPHS/avocado-mango-salad-with-grilled-shrimp",
        "servings": 4,
        "minutes": 45,
        "summary": "Avocado-Mango Salad With Grilled Shrimp is a <b>gluten free, dairy free, and pescatarian</b> main course. One portion of this dish contains around <b>49g of protein</b>, <b>46g of fat</b>, and a total of <b>732 calories</b>. For <b>$6.36 per serving</b>, this recipe <b>covers 36%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. If you have , hass avocados, lime zest, and a few other ingredients on hand, you can make it. <b>The Fourth Of July</b> will be even more special with this recipe. This recipe is liked by 5 foodies and cooks. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 74%</b>, which is solid. Similar recipes are <a href=\"https://spoonacular.com/recipes/mango-avocado-and-grilled-shrimp-salad-with-a-peanut-dressing-249037\">Mango, Avocado and Grilled Shrimp Salad with a Peanut Dressing</a>, <a href=\"https://spoonacular.com/recipes/grilled-shrimp-tacos-with-mango-avocado-salsa-610210\">Grilled Shrimp Tacos with Mango Avocado Salsa</a>, and <a href=\"https://spoonacular.com/recipes/grilled-jerk-shrimp-tacos-with-mango-and-avocado-salsa-708004\">Grilled Jerk Shrimp Tacos with Mango and Avocado Salsa</a>.",
        "nutrition": {
            "percentFat": 54.73,
            "percentCarbs": 18.54,
            "percentProtein": 26.73
        },
        "macro": "custom"
    },
    {
        "id": 656752,
        "title": "Pork Chops with Garlic Cream",
        "steps": "<ol><li>In a small sauce pan melt the butter over medium-low heat and cook the shallots until softened, about 5 minutes.</li><li>Add the wine, thyme and a generous  teaspoon salt. Raise the heat to medium and simmer until the liquid is reduced to 2 tablespoons. Stir in the heavy cream and the buttermilk and all the garlic cloves.</li><li>Return to a bare simmer and cook, stirring occasionally, until the garlic is completely tender, 40 to 45 minutes.</li><li>Transfer the garlic mixture to a blender and puree until very smooth, about 1 minute. Return the garlic sauce to the saucepan. It should be thick enough to cover the back of a wooden spoon but easy to pour. Set aside covered to keep warm.</li><li>Preheat oven to 375.</li><li>Salt and pepper generously the pork chops. In a large skillet over medium high heat add the oil. When hot add the chops and sear them on each side. 2minutes each sides.</li><li>Remove from the stove and place in the hot oven. Cook for 3 minutes at 375 then lower the heat to 300 for another 5 minutes. The chops need to be springy to the touch and golden brown on the outside.</li></ol>",
        "url": "http://www.foodista.com/recipe/MMSZLRHM/pork-chops-with-garlic-cream",
        "servings": 4,
        "minutes": 45,
        "summary": "You can never have too many main course recipes, so give Pork Chops with Garlic Cream a try. This recipe makes 4 servings with <b>712 calories</b>, <b>51g of protein</b>, and <b>51g of fat</b> each. For <b>$3.5 per serving</b>, this recipe <b>covers 31%</b> of your daily requirements of vitamins and minerals. A couple people made this recipe, and 13 would say it hit the spot. A mixture of pork chops, shallot, heavy cream, and a handful of other ingredients are all it takes to make this recipe so yummy. To use up the salt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-turnovers-recipe-48175\">Apple Turnovers Recipe</a> as a dessert. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 80%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/pork-chops-with-wine-and-garlic-38622\">Pork Chops with Wine and Garlic</a>, <a href=\"https://spoonacular.com/recipes/honey-garlic-pork-chops-384157\">Honey-Garlic Pork Chops</a>, and <a href=\"https://spoonacular.com/recipes/honey-garlic-pork-chops-450409\">Honey-Garlic Pork Chops</a> for similar recipes.",
        "nutrition": {
            "percentFat": 60.95,
            "percentCarbs": 7.26,
            "percentProtein": 31.79
        },
        "macro": "custom"
    },
    {
        "id": 647501,
        "title": "Hot Pepper Pumpkin Soup",
        "steps": "In a deep pan, heat stock, salt, pumpkin, onion, garlic, coriander leafs and peppercorns. Bring to a boil, reduce heat to low, and simmer for 30 minutes uncovered. Then puree the soup in small batches (1 cup at a time) using a food processor or blender. In a same pan add butter and dried oregano. When the butter in melted. Then add puree and bring to a boil again. Reduce heat to low, and simmer for another 30 minutes uncovered. Stir in heavy cream. Serve Hot.",
        "url": "https://www.foodista.com/recipe/YX3L4PH4/hot-pepper-pumpkin-soup",
        "servings": 4,
        "minutes": 45,
        "summary": "Need a <b>gluten free, lacto ovo vegetarian, and primal soup</b>? Hot Pepper Pumpkin Soup could be an awesome recipe to try. This recipe serves 4. One portion of this dish contains about <b>4g of protein</b>, <b>15g of fat</b>, and a total of <b>248 calories</b>. For <b>$2.86 per serving</b>, this recipe <b>covers 16%</b> of your daily requirements of vitamins and minerals. This recipe is liked by 10 foodies and cooks. It is perfect for <b>Autumn</b>. Head to the store and pick up peppercorns, garlic, heavy whipping cream, and a few other things to make it today. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. It is brought to you by Foodista. With a spoonacular <b>score of 46%</b>, this dish is good. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/hot-and-sour-pumpkin-soup-24150\">Hot-and-Sour Pumpkin Soup</a>, <a href=\"https://spoonacular.com/recipes/creamy-pumpkin-red-pepper-soup-216754\">Creamy Pumpkin-Red Pepper Soup</a>, and <a href=\"https://spoonacular.com/recipes/pumpkin-and-yellow-pepper-soup-with-smoked-paprika-22235\">Pumpkin and Yellow Pepper Soup with Smoked Paprika</a>.",
        "nutrition": {
            "percentFat": 49.67,
            "percentCarbs": 44.46,
            "percentProtein": 5.87
        },
        "macro": "custom"
    },
    {
        "id": 715541,
        "title": "Pink Lemonade Crinkle Cookies",
        "steps": "Prepare a cookie sheet by greasing with non-stick cooking spray. Preheat oven to 350. Cream butter and sugar together in your mixer, scraping the sides of your bowl. Add your egg and mix well. Mix in baking powder, baking soda, Kool-Aid and cornstarch. Once its well mixed (the Kool-Aid will be mixed once it turns your dough pink), add a drop of pink food coloring, if more color is desired. Next, start adding your flour a half cup at a time until its all added.Roll the dough into walnut-sized balls and roll in the powder sugar, giving them a light coating. Place 2 apart on a room-temp baking sheet (let your sheet cool in between batches if you are reusing the same one).Bake in the oven 9-10 minutes, they wont brown too much, so watch them closely. Over-baking will make them hard and crunchy!I hope you enjoy these! I will be baking another batch soon, we have a neighborhood barbecue coming up and I know these will be perfect!Want more Whistle and Ivy? Subscribe here! And dont forget to follow on Instagram and Pinterest.You may also like these Avocado Mint Chocolate Sugar Cookies or this Honey Kool-Aid TaffyUntil next time,JOIN 500,000 SUBSCRIBERS!Join over 500,000 others who follow PinkWhen on Social Media, the PinkWhen blog, and email. Sign up to receive exclusive bonuses like this FREE Simple Fit Dinners Ebook.Don't wait! You won't want to miss a thing.Success! Now check your email to confirm your subscription and download your FREE ebook.There was an error submitting your subscription. Please try again.First NameEmail AddressSubscribePowered by ConvertKit",
        "url": "http://www.pinkwhen.com/pink-lemonade-crinkle-cookies/",
        "servings": 5,
        "minutes": 45,
        "summary": "Pink Lemonade Crinkle Cookies might be just the dessert you are searching for. Watching your figure? This vegetarian recipe has <b>659 calories</b>, <b>5g of protein</b>, and <b>29g of fat</b> per serving. For <b>54 cents per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. Many people made this recipe, and 3229 would say it hit the spot. If you have egg, baking soda, powdered sugar, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 33%</b>. This score is not so super. Try <a href=\"https://spoonacular.com/recipes/frosted-pink-lemonade-cookies-544764\">Frosted Pink Lemonade Cookies</a>, <a href=\"https://spoonacular.com/recipes/homemade-pink-lemonade-cookies-534398\">Homemade Pink Lemonade Cookies</a>, and <a href=\"https://spoonacular.com/recipes/sour-patch-pink-lemonade-cookies-631616\">Sour Patch Pink Lemonade Cookies</a> for similar recipes.",
        "nutrition": {
            "percentFat": 38.91,
            "percentCarbs": 57.91,
            "percentProtein": 3.18
        },
        "macro": "custom"
    },
    {
        "id": 639637,
        "title": "Classic scones",
        "steps": "<ol><li>Using fingertips, rub butter into flour until mixture resembles fine breadcrumbs.</li><li>Make a well in the centre of the dry ingredients and add milk, stirring with a metal spatula or butter knife until mixture comes away from the sides of the bowl. If mixture is dry, add a little extra milk.</li><li>Turn mixture onto a lightly floured bench and bring the dough together until a rough ball of dough is formed. Do not over-knead. Pat dough to 2 cm thickness. With a clean knife, quarter the dough or use a round cutter to cut rounds.</li><li>Arrange scones onto a baking paper lined tray and bake at 220C for 12-15 minutes until golden and they sound hollow when lightly tapped on the base.</li><li>Serve scones straight from the oven with jam and cream.</li></ol>",
        "url": "http://www.foodista.com/recipe/8R27PR6L/classic-scones",
        "servings": 4,
        "minutes": 45,
        "summary": "The recipe Classic scones could satisfy your Scottish craving in approximately <b>45 minutes</b>. For <b>51 cents per serving</b>, this recipe <b>covers 7%</b> of your daily requirements of vitamins and minerals. Watching your figure? This vegetarian recipe has <b>399 calories</b>, <b>9g of protein</b>, and <b>13g of fat</b> per serving. Plenty of people made this recipe, and 358 would say it hit the spot. A mixture of milk, butter, strawberry jam and cream, and a handful of other ingredients are all it takes to make this recipe so tasty. It works well as a very affordable morn meal. All things considered, we decided this recipe <b>deserves a spoonacular score of 43%</b>. This score is good. Try <a href=\"https://spoonacular.com/recipes/classic-scones-151308\">Classic Scones</a>, <a href=\"https://spoonacular.com/recipes/classic-scones-56069\">Classic Scones</a>, and <a href=\"https://spoonacular.com/recipes/classic-cream-scones-808415\">Classic Cream Scones</a> for similar recipes.",
        "nutrition": {
            "percentFat": 28.83,
            "percentCarbs": 61.96,
            "percentProtein": 9.21
        },
        "macro": "custom"
    },
    {
        "id": 635350,
        "title": "Blue Cheese Burgers",
        "steps": "Step 1: In a bowl, add chuck, sirloin, bread crumbs, steak sauce, eggs, salt, and pepper, and mix gently with fork.\nStep 2: Form 4 patties out of this mixture.\nStep 3: Cook the hamburgers patties on each side, then cover with aluminium foil.\nStep 4: Cut the sides of the bun, then grill in a stove-top grill until toasted.\nStep 5: Place patties and a slice of blue cheese in each bun.\nStep 6: Serve hot.",
        "url": "https://www.foodista.com/recipe/ZVXPQHB5/blue-cheese-burgers",
        "servings": 4,
        "minutes": 45,
        "summary": "Blue Cheese Burgers might be just the main course you are searching for. One portion of this dish contains roughly <b>45g of protein</b>, <b>37g of fat</b>, and a total of <b>661 calories</b>. For <b>$4.51 per serving</b>, this recipe <b>covers 28%</b> of your daily requirements of vitamins and minerals. This recipe serves 4. 7 people have tried and liked this recipe. This recipe is typical of American cuisine. It is brought to you by Foodista. If you have kosher salt, egg, ground pepper, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. Overall, this recipe earns a <b>solid spoonacular score of 64%</b>. Similar recipes include <a href=\"https://spoonacular.com/recipes/blue-cheese-burgers-246009\">Blue Cheese Burgers</a>, <a href=\"https://spoonacular.com/recipes/blue-cheese-burgers-306034\">Blue Cheese Burgers</a>, and <a href=\"https://spoonacular.com/recipes/blue-cheese-burgers-218703\">Blue-Cheese Burgers</a>.",
        "nutrition": {
            "percentFat": 51.36,
            "percentCarbs": 20.93,
            "percentProtein": 27.71
        },
        "macro": "custom"
    },
    {
        "id": 634900,
        "title": "Best Ever Bolognese Sauce",
        "steps": "<ol><li>Heat oil in heavy large pot over medium-high heat. Add bacon and saut until just beginning to brown (about 5-6 minutes).</li><li>Add onion, celery, carrot, garlic, and thyme; saut 5 minutes.</li><li>Add veal and pork; saut until brown and cooked through, breaking up meat with spatula, about 10 minutes.</li><li>Add wine and bay leaves and simmer until liquid is slightly reduced, about 10 minutes.</li><li>Add broth and tomato puree, then reduce heat to medium-low and simmer until sauce thickens, stirring often, about 1 hour.</li><li>Season with salt and pepper.</li><li>Boil pasta in large pot of boiling salted water until just tender but al dente (firm to bite), stirring often. Drain. Transfer to pot with sauce; toss.</li><li>Serve with Parmesan.</li></ol>",
        "url": "http://www.foodista.com/recipe/BJ8NRVBT/best-ever-bolognese-sauce",
        "servings": 6,
        "minutes": 45,
        "summary": "Best Ever Bolognese Sauce might be just the sauce you are searching for. One serving contains <b>968 calories</b>, <b>53g of protein</b>, and <b>49g of fat</b>. For <b>$3.67 per serving</b>, this recipe <b>covers 37%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista has 24 fans. Head to the store and pick up wine, onion, ground pork, and a few other things to make it today. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 87%</b>. This score is outstanding. Try <a href=\"https://spoonacular.com/recipes/rag-alla-bolognese-bolognese-sauce-481414\">Ragù alla bolognese (Bolognese Sauce)</a>, <a href=\"https://spoonacular.com/recipes/bolognese-sauce-ragu-bolognese-12250\">Bolognese Sauce (ragu Bolognese)</a>, and <a href=\"https://spoonacular.com/recipes/egis-bolognese-sauce-12551\">Egi's Bolognese Sauce</a> for similar recipes.",
        "nutrition": {
            "percentFat": 47.62,
            "percentCarbs": 29.74,
            "percentProtein": 22.64
        },
        "macro": "custom"
    },
    {
        "id": 640273,
        "title": "Crab Cake Stuffed Shrimp",
        "steps": "Line a baking sheet with parchment paper.\nHeat 5 tablespoons butter until melted.\nAdd onion and saute until translucent.\nAdd bell pepper, remaining 5 tablespoons butter, wine and garlic.\nCook until tender (about 4 minutes).\nIn a large bowl, add crab meat, onion mixture, cracker crumbs, panko, red pepper, Old Bay, salt and pepper.\nStir to combine.\nCover and refrigerate for at least 1 hour to 24 hours.\nPreheat oven to 350 degrees.\nUsing a sharp knife and staring at the tail end, butterfly each shrimp.\nPlace each butterflied shrimp on prepared pan, pressing to flatten.\nForm about 3 tablespoons crab mixture into an ball.\nPlace on top of shrimp, pressing the shrimp tail over the crab.\nRepeat with remaining shrimp and crab mixture.\nBake 10 to 15 minutes.\nOPTIONAL:  Squeeze fresh lemon juice over cooked appetizer.\nServe immediately.",
        "url": "https://www.foodista.com/recipe/MMGP257M/crab-cake-stuffed-shrimp",
        "servings": 24,
        "minutes": 45,
        "summary": "Crab Cake Stuffed Shrimp requires about <b>approximately 45 minutes</b> from start to finish. This recipe makes 24 servings with <b>91 calories</b>, <b>4g of protein</b>, and <b>6g of fat</b> each. For <b>55 cents per serving</b>, this recipe <b>covers 5%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista has 6 fans. It is a good option if you're following a <b>pescatarian</b> diet. It works well as a hor d'oeuvre. A mixture of round buttery crackers, ground pepper, garlic, and a handful of other ingredients are all it takes to make this recipe so flavorful. Taking all factors into account, this recipe <b>earns a spoonacular score of 15%</b>, which is not so excellent. <a href=\"https://spoonacular.com/recipes/crab-stuffed-shrimp-244924\">Crab Stuffed Shrimp</a>, <a href=\"https://spoonacular.com/recipes/crab-stuffed-shrimp-11095\">Crab Stuffed Shrimp</a>, and <a href=\"https://spoonacular.com/recipes/crab-shrimp-stuffed-sole-443126\">Crab & Shrimp Stuffed Sole</a> are very similar to this recipe.",
        "nutrition": {
            "percentFat": 61.86,
            "percentCarbs": 25.34,
            "percentProtein": 12.8
        },
        "macro": "custom"
    },
    {
        "id": 663985,
        "title": "Turkey and Rice Stuffed Acorn Squash",
        "steps": "Prepare rice according to package instructions. (I either cook the rice in chicken stock, or this time I used water and added 1 tablespoon vegeta seasoning to the water to add flavor to the rice as it cooks.)\nMeanwhile preheat oven to 375 degrees. Cut squash in half and drizzle with olive oil, salt and pepper. Roast skin side down for 30 minutes.\nHeat 1 tablespoon olive oil in large skilled. Add diced onions. Cook until translucent. Add garlic and cook for 1 minute longer. Add turkey, 1 tablespoon vegeta, red pepper, salt and pepper. Cook until turkey is browned and almost cooked through. Rough chop the mushrooms and add to the pan. Cook until mushrooms are softened. Add rice and spinach and stir until spinach is just wilted.\nStuff the squash with the meat and rice mixture and top with bread crumbs. (Either toss bread crumbs with 2 teaspoons olive oil, or I just spray them with spray olive oil to make sure that they brown in the oven.\nBake stuffed squash in oven until bread crumbs are browned.",
        "url": "https://www.foodista.com/recipe/8QRN8DXZ/turkey-and-rice-stuffed-acorn-squash",
        "servings": 6,
        "minutes": 45,
        "summary": "Turkey and Rice Stuffed Acorn Squash is a main course that serves 6. Watching your figure? This dairy free recipe has <b>413 calories</b>, <b>29g of protein</b>, and <b>10g of fat</b> per serving. For <b>$2.82 per serving</b>, this recipe <b>covers 37%</b> of your daily requirements of vitamins and minerals. A couple people made this recipe, and 35 would say it hit the spot. Head to the store and pick up vegeta seasoning, baby bella mushrooms, salt and pepper, and a few other things to make it today. It is brought to you by Foodista. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 93%</b>. This score is awesome. Try <a href=\"https://spoonacular.com/recipes/butternut-squash-noodle-turkey-bolognese-stuffed-acorn-squash-with-melted-gruyere-two-ways-563828\">Butternut Squash Noodle Turkey Bolognese Stuffed Acorn Squash with Melted Gruyere: Two Ways</a>, <a href=\"https://spoonacular.com/recipes/turkey-sausage-stuffed-acorn-squash-837847\">Turkey Sausage-Stuffed Acorn Squash</a>, and <a href=\"https://spoonacular.com/recipes/turkey-chili-stuffed-acorn-squash-934987\">Turkey Chili Stuffed Acorn Squash</a> for similar recipes.",
        "nutrition": {
            "percentFat": 21.45,
            "percentCarbs": 52.15,
            "percentProtein": 26.4
        },
        "macro": "bodybuilding"
    },
    {
        "id": 658007,
        "title": "Raw Vegan Chocolate and Raspberry Cake",
        "steps": "Go to my blog for the full instructions: http://gourmandelle.com/raw-vegan-chocolate-and-raspberry-birthday-cake/",
        "url": "https://www.foodista.com/recipe/CDSD8KXF/raw-vegan-chocolate-and-raspberry-cake",
        "servings": 12,
        "minutes": 45,
        "summary": "If you have around <b>about 45 minutes</b> to spend in the kitchen, Raw Vegan Chocolate and Raspberry Cake might be an outstanding <b>dairy free</b> recipe to try. This dessert has <b>351 calories</b>, <b>7g of protein</b>, and <b>23g of fat</b> per serving. For <b>$1.42 per serving</b>, this recipe <b>covers 12%</b> of your daily requirements of vitamins and minerals. This recipe serves 12. It is brought to you by Foodista. A mixture of honey, walnuts, raspberries, and a handful of other ingredients are all it takes to make this recipe so yummy. 76 people found this recipe to be yummy and satisfying. Overall, this recipe earns a <b>solid spoonacular score of 72%</b>. Similar recipes are <a href=\"https://spoonacular.com/recipes/no-bake-chocolate-fudge-fridge-cake-raw-vegan-paleo-512260\">No-Bake Chocolate Fudge Fridge Cake (Raw, Vegan, Paleo)</a>, <a href=\"https://spoonacular.com/recipes/raw-vegan-raspberry-cheesecake-581604\">Raw Vegan Raspberry Cheesecake</a>, and <a href=\"https://spoonacular.com/recipes/raw-vegan-vanilla-raspberry-cheesecake-618307\">Raw vegan Vanilla raspberry cheesecake</a>.",
        "nutrition": {
            "percentFat": 52.4,
            "percentCarbs": 40.91,
            "percentProtein": 6.69
        },
        "macro": "custom"
    },
    {
        "id": 654965,
        "title": "Pasta With Wild Mushrooms, Peas and Bacon",
        "steps": "Heat 2 tablespoons of olive oil in a non-stick saute pan over medium heat. Add in the chopped shallot, garlic and bacon, cooking until the shallot softens and then bacon begins to crisp up nicely.\nToss in the mushrooms (make sure you've sliced any large ones), sauteing everything together for another 5-6 minutes, or until the mushrooms reach your desired consistency (tender, but not falling apart).\nMeanwhile, cook the pasta until it is al dente. I prefer to use a nice whole wheat fettuccine for this recipe as it pairs well with the nuttiness of the mushrooms. Once the pasta is cooked, drain it and set aside.\nAdd the peas and parsley to the skillet, season with salt and pepper and cook for just a minute or two before tossing in the pasta and mixing well, coating the pasta with the oils and fat.\nRemove the skillet from the heat and put the pasta into a large serving bowl. Shave a generous amount of Parmeggiano Reggiano over the dish, tossing to combine.\nServe with additional cheese and salt and fresh pepper, to your liking.",
        "url": "https://www.foodista.com/recipe/5QMH5LX5/pasta-with-wild-mushrooms-peas-and-bacon",
        "servings": 2,
        "minutes": 45,
        "summary": "Pasta With Wild Mushrooms, Peas and Bacon requires approximately <b>approximately 45 minutes</b> from start to finish. For <b>$8.21 per serving</b>, this recipe <b>covers 52%</b> of your daily requirements of vitamins and minerals. This recipe makes 2 servings with <b>2436 calories</b>, <b>53g of protein</b>, and <b>88g of fat</b> each. Only a few people really liked this main course. 8 people have made this recipe and would make it again. It is brought to you by Foodista. If you have garlic, olive oil, shallot, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 82%</b>. This score is outstanding. Try <a href=\"https://spoonacular.com/recipes/penne-with-chicken-wild-mushrooms-and-peas-349197\">Penne with Chicken, Wild Mushrooms and Peas</a>, <a href=\"https://spoonacular.com/recipes/creamy-buckwheat-pasta-with-wild-mushrooms-76442\">Creamy Buckwheat Pasta with Wild Mushrooms</a>, and <a href=\"https://spoonacular.com/recipes/wild-rice-with-bacon-mushrooms-green-onions-665344\">Wild Rice With Bacon, Mushrooms & Green Onions</a> for similar recipes.",
        "nutrition": {
            "percentFat": 33.13,
            "percentCarbs": 55.92,
            "percentProtein": 10.95
        },
        "macro": "custom"
    },
    {
        "id": 649755,
        "title": "Lemon Quick Bread",
        "steps": "<ol><li>Preheat oven to 350</li><li>Beat yogurt, sugar, eggs, vanilla and lemon extract until blended</li><li>Stir together flour, lemon peel, baking powder, baking soda and salt. Add to yogurt mixture,mix just until blended. Spoon batter into a greased and floured 9- x 5-inch loaf pan or 3 mini loafs.</li><li>Bake for 50 minutes to 1 hour for 1 large loaf or 30  35 minutes for 3 mini loafs, or until a toothpick inserted into center comes out clean, shielding with aluminum foil after 50 minutes to prevent excessive browning.</li><li>To make glaze:</li><li>In a small sauce pan add sugar and lemon juice, stir until dissolved and clear. While the cake is still warm, pour the lemon-sugar mixture over the cake and allow it to soak in (a pastry brush works great for this, as does using a toothpick to make tiny holes that draw the syrup in better).</li><li>Cool in pan on a wire rack 10 minutes; remove from pan to wire rack. Then eat!!!!</li><li>Calories per slice:  111,  Fat:  .02,  Cholesterol:  0,  Sodium:  137,  Potassium:  32, Carbs:  23,  Fiber:  1.3,  Sugar:  10.3,  Protein:  3.9</li></ol>",
        "url": "http://www.foodista.com/recipe/3G7KLCH7/lemon-quick-bread",
        "servings": 15,
        "minutes": 45,
        "summary": "You can never have too many morn meal recipes, so give Lemon Quick Bread a try. One serving contains <b>125 calories</b>, <b>2g of protein</b>, and <b>0g of fat</b>. For <b>31 cents per serving</b>, this recipe <b>covers 3%</b> of your daily requirements of vitamins and minerals. 8 people were impressed by this recipe. Head to the store and pick up greek non fat yogurt, baking powder, baking soda, and a few other things to make it today. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 29%</b>. This score is not so amazing. Try <a href=\"https://spoonacular.com/recipes/lemon-thyme-quick-bread-46688\">Lemon Thyme Quick Bread</a>, <a href=\"https://spoonacular.com/recipes/lemon-cranberry-quick-bread-128143\">Lemon-Cranberry Quick Bread</a>, and <a href=\"https://spoonacular.com/recipes/lemon-thyme-quick-bread-585933\">Lemon-Thyme Quick Bread</a> for similar recipes.",
        "nutrition": {
            "percentFat": 2.03,
            "percentCarbs": 90.35,
            "percentProtein": 7.62
        },
        "macro": "custom"
    },
    {
        "id": 654735,
        "title": "Party Rice Balls",
        "steps": "Bring water and 1 tsp. of salt to boil and stir in rice.  Reduce heat, cover and cook rice until all water is absorbed.  Fluff rice and set aside until it is warm to the touch.  You must work with WARM rice, not cold.\nMix the eggs, cheese and parsley in a small bowl.  Add to the warm rice and stir well until all rice is coated with the egg mixture.\nIn a separate bowl, add the cup of breadcrumbs.  Keeping your hands wet, roll rice mixture into balls the size of a golf ball.  Coat with breadcrumbs.  Repeat until all the rice mixture is used.\nHeat about 1-inch of oil in a heavy skillet, preferably cast iron.  Oil should be about 375 degrees OR when a cube of bread is dropped in the oil, it will brown in 1 minute.\nAdd rice balls to hot oil and brown on all sides.  This may have to be done in stages--do NOT crowd the pan!  Fry maybe 6-8 balls at a time so they have plenty of room to move around in the pan.  When brown, remove to a plate covered with a paper towel to drain oil.  These may be kept warm in a 200 degree oven until all the rice balls are cooked.\nMakes about 24 rice balls.  Serve with marinara sauce and extra cheese.",
        "url": "https://www.foodista.com/recipe/4FYGNZ3F/party-rice-balls",
        "servings": 24,
        "minutes": 45,
        "summary": "Party Rice Balls takes roughly <b>roughly 45 minutes</b> from beginning to end. One portion of this dish contains around <b>3g of protein</b>, <b>2g of fat</b>, and a total of <b>68 calories</b>. This recipe serves 24 and costs 18 cents per serving. If you have breadcrumbs, water, salt, and a few other ingredients on hand, you can make it. A couple people really liked this hor d'oeuvre. This recipe is liked by 52 foodies and cooks. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 22%</b>, which is rather bad. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/party-cheese-balls-243124\">Party Cheese Balls</a>, <a href=\"https://spoonacular.com/recipes/party-cheese-balls-424987\">Party Cheese Balls</a>, and <a href=\"https://spoonacular.com/recipes/triple-chocolate-party-balls-601116\">Triple Chocolate Party Balls</a>.",
        "nutrition": {
            "percentFat": 24.63,
            "percentCarbs": 57.68,
            "percentProtein": 17.69
        },
        "macro": "bodybuilding"
    },
    {
        "id": 665620,
        "title": "Zabaglione with Roasted Plums",
        "steps": "1.Heat the oven the to 400F. Place the plums on a rimmed cookie sheet (lined with parchment paper for easier cleanup) and sprinkle with 2 tablespoons of the sugar. Roast until the plums are browning and tender but not falling apart, about 15 minutes.\n2.Bring about 2 inches of water to a bare simmer in a saucepan over medium-high heat. Reduce the heat to maintain a bare simmer. Combine the egg yolks, the remaining 4 tablespoons sugar, the plum brandy mixture, and a pinch of salt in a round-bottomed metal mixing bowl; whisk thoroughly.\n3.Set the bowl over the simmering waterthe base of the bowl should not touch the waterand whisk continuously. The egg yolks will begin to froth, lighten, and grow greatly in volume. If you sense that the yolks are at risk of scrambling, quickly remove the bowl from the heat and whisk to cool slightly, then continue. When soft peaks form, after 5 to10 minutes, the zabaglione is done. Transfer to a clean bowl, cover, and refrigerate.\n4.To serve, place 6 plum halves in the bottom of each of 4 glasses. Give the zabaglione a quick whisk and spoon it on top of the plums. Serve immediately.",
        "url": "https://www.foodista.com/recipe/QS5MMQMF/zabaglione-with-roasted-plums",
        "servings": 4,
        "minutes": 20,
        "summary": "Zabaglione with Roasted Plums might be just the side dish you are searching for. One serving contains <b>220 calories</b>, <b>4g of protein</b>, and <b>5g of fat</b>. This recipe serves 4 and costs $1.17 per serving. Head to the store and pick up plums, sugar, egg yolks, and a few other things to make it today. 7 people were glad they tried this recipe. From preparation to the plate, this recipe takes roughly <b>20 minutes</b>. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free, dairy free, and lacto ovo vegetarian</b> diet. With a spoonacular <b>score of 32%</b>, this dish is not so excellent. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/roasted-plums-698747\">Roasted Plums</a>, <a href=\"https://spoonacular.com/recipes/honey-roasted-plums-79833\">Honey-roasted Plums</a>, and <a href=\"https://spoonacular.com/recipes/sugar-roasted-plums-139647\">Sugar-Roasted Plums</a>.",
        "nutrition": {
            "percentFat": 19.76,
            "percentCarbs": 73.08,
            "percentProtein": 7.16
        },
        "macro": "custom"
    },
    {
        "id": 645730,
        "title": "Grilled Guacamole with Pistachios",
        "steps": "<ol><li>Lightly brush the avocado flesh, corn, onion, and jalapeno peppers with olive oil.</li><li>Place all but the avocado in a grill basket and on the grill over medium-high heat.</li><li>Place the avocados, cut side up, directly on the grill and cook for 2 minutes, then flip and cook, cut side down, for another 2 minutes. When finished, remove and set aside.</li><li>Allow the other vegetables to cook, turning, until they are tender and lightly charred (10-12 minutes). The corn may take a few minutes longer than the other vegetables. If needed, remove the other vegetables and allow the corn to continue to cook.</li><li>When the vegetables have cooled enough to touch, cut the corn off the cob, and dice the other vegetables.</li><li>In a large bowl, combine the tomatoes, corn, onion, peppers, garlic, and cilantro, and toss to mix.</li><li>Add the avocado to the mixture, lightly tossing and mashing it.</li><li>Add the lime juice and seasoning. Mix together and adjust as needed.</li><li>Add the pistachios, toss the mixture again and serve.</li></ol>",
        "url": "http://www.foodista.com/recipe/T2RCLMGG/grilled-guacamole-with-pistachios",
        "servings": 8,
        "minutes": 45,
        "summary": "The recipe Grilled Guacamole with Pistachios is ready <b>in about 45 minutes</b> and is definitely an amazing <b>gluten free and vegan</b> option for lovers of Mexican food. This hor d'oeuvre has <b>355 calories</b>, <b>5g of protein</b>, and <b>33g of fat</b> per serving. For <b>$1.38 per serving</b>, this recipe <b>covers 14%</b> of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for <b>The Fourth Of July</b>. A couple people made this recipe, and 17 would say it hit the spot. Head to the store and pick up olive oil to brush vegetables, salt, onion, and a few other things to make it today. All things considered, we decided this recipe <b>deserves a spoonacular score of 83%</b>. This score is great. Try <a href=\"https://spoonacular.com/recipes/for-guacamole-with-pistachios-551880\">for Guacamole with Pistachios</a>, <a href=\"https://spoonacular.com/recipes/guacamole-grilled-sandwich-guacamole-toast-607843\">Guacamole Grilled Sandwich | Guacamole Toast</a>, and <a href=\"https://spoonacular.com/recipes/grilled-peaches-with-mascarpone-and-pistachios-558635\">Grilled Peaches with Mascarpone and Pistachios</a> for similar recipes.",
        "nutrition": {
            "percentFat": 77.73,
            "percentCarbs": 17.49,
            "percentProtein": 4.78
        },
        "macro": "custom"
    },
    {
        "id": 651189,
        "title": "Mascarpone & Ricotta Cheese Cake",
        "steps": "<ol><li>Directions</li><li>Preheat oven to 325.</li><li>Crust:</li><li>Grind graham crackers and almonds using food processor or a mortar and pestle. Add melted butter and salt and press into bottom of greased springform pan or deep dish pie pan. Bake for 10 minutes. Let cool. Mix sugar and flour together and sprinkle over top of crust. (This prevents crust from getting soggy)</li><li>Filling:</li><li>Beat cream cheese, mascarpone cheese, ricotta cheese and sugar in a large bowl until smooth. Beat in lemon juice and vanilla. Add in eggs one at a time. Pour cheese mixture over crust in pan. Bake until the center of the cheesecake is wobbly when shaken, about 1hr and 5 mins. Let cool then refrigerate, preferably overnight.</li></ol>",
        "url": "http://www.foodista.com/recipe/F4L8XS82/mascarpone-ricotta-cheese-cake",
        "servings": 10,
        "minutes": 45,
        "summary": "For <b>$1.09 per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. This recipe makes 10 servings with <b>523 calories</b>, <b>11g of protein</b>, and <b>35g of fat</b> each. This recipe from Foodista has 7 fans. It is a good option if you're following a <b>vegetarian</b> diet. If you have salt, ricotta cheese, whipped cream cheese, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 24%</b>. This score is rather bad. Similar recipes include <a href=\"https://spoonacular.com/recipes/ricotta-and-mascarpone-cheese-tart-658318\">Ricottan and Mascarpone Cheese Tart</a>, <a href=\"https://spoonacular.com/recipes/ricotta-pound-cake-with-blood-orange-filling-whipped-cream-mascarpone-topping-and-candied-blood-orange-slices-522664\">Ricotta Pound Cake with Blood Orange Filling, Whipped Cream Mascarpone Topping and Candied Blood Orange Slices</a>, and <a href=\"https://spoonacular.com/recipes/carrot-cake-cupcakes-with-mascarpone-cream-cheese-frosting-488831\">Carrot Cake Cupcakes with Mascarpone Cream Cheese Frosting</a>.",
        "nutrition": {
            "percentFat": 59.17,
            "percentCarbs": 32.37,
            "percentProtein": 8.46
        },
        "macro": "custom"
    },
    {
        "id": 659927,
        "title": "Shrimp and Avocado Salad",
        "steps": "1.Firstly, to cook the shrimp, heat the olive oil in a pan and once hot add the shrimp crushed garlic and chili flakes. It is important to get the oil nice and hot (not smoking, just before that point) your shrimp should sizzle when added to the pan. Check the back of the shrimp and when you see the colour change about half way up, turn them over. Do the same on the other side. This should only take a minute to two minutes maximum on both sides  otherwise you will get a rubbery result if you leave it too long. Squeeze over the lime juice  this too should bubble and reduce. Add a little salt and pepper, stir through, remove from the heat and set aside.\n2.Mix the dressing ingredients together, check for flavour, adjust if need be and set aside.\n3.Place all the salad ingredients in a bowl except the avocado and the salt and pepper. Prepare the avocado as you are about to serve otherwise it will turn brown. Once it is covered in the lime dressing, this will slow down the oxidization process and it wont go brown so easily.\n4.When you are ready to serve mix  of the avocado through the salad and add the dressing. Toss everything together. Taste to see if you need any salt and pepper. Place your shrimp on top of the salad with the rest of the avocado and sprinkle/pour any residue from the pan over your salad in which you cooked the shrimp. This is great flavour, so you dont want to lose it.",
        "url": "https://www.foodista.com/recipe/ZTNWCWQP/shrimp-and-avocado-salad",
        "servings": 4,
        "minutes": 45,
        "summary": "Shrimp and Avocado Salad might be a good recipe to expand your main course collection. One serving contains <b>502 calories</b>, <b>36g of protein</b>, and <b>23g of fat</b>. This recipe serves 4. For <b>$5.14 per serving</b>, this recipe <b>covers 38%</b> of your daily requirements of vitamins and minerals. A mixture of basil leaves, avocados into cubes, the salad, and a handful of other ingredients are all it takes to make this recipe so tasty. 7 people have tried and liked this recipe. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. It is brought to you by Foodista. It is a good option if you're following a <b>gluten free, dairy free, and pescatarian</b> diet. With a spoonacular <b>score of 86%</b>, this dish is amazing. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/shrimp-corn-california-avocado-pasta-salad-a-ca-avocado-trip-584558\">Shrimp, Corn & Californian Avocado Pasta Salad & a CAn Avocado Trip</a>, <a href=\"https://spoonacular.com/recipes/shrimp-and-avocado-salad-770494\">Shrimp and Avocado Salad</a>, and <a href=\"https://spoonacular.com/recipes/shrimp-and-avocado-salad-245506\">Shrimp and Avocado Salad</a>.",
        "nutrition": {
            "percentFat": 36.94,
            "percentCarbs": 35.38,
            "percentProtein": 27.68
        },
        "macro": "custom"
    },
    {
        "id": 638035,
        "title": "Chicken Cordon Bleu",
        "steps": "<ol><li>Preheat oven to 350 degrees F.</li><li>Butterfly the chicken breasts by slicing half lengthwise but not cutting all the way through. Lay the halved breasts between 2 pieces of plastic wrap. Using the flat side of a meat mallet, gently pound the chicken to 1/4-inch thickness, taking care to not tear or create holes in the meat.</li><li>Lay 2 slices of cheese on each breast, followed by 2 slices of ham, and 2 more of cheese; leaving a 1/2-inch margin on all sides to help seal the roll. Tuck in the sides of the breast and roll up tight like a jellyroll. Squeeze the log gently to seal.</li><li>Season the flour with salt and pepper; spread out on waxed paper or in a flat dish. Mix the breadcrumbs with thyme, kosher salt, pepper, and oil. The oil will help the crust brown. Beat together the eggs and water, the mixture should be fluid. Lightly dust the chicken with flour, then dip in the egg mixture. Gently coat in the bread crumbs.</li><li>Carefully transfer the roulades to a baking pan and bake for 20 minutes until browned and cooked through.</li><li>Serve whole or cut into pinwheels.</li></ol>",
        "url": "http://www.foodista.com/recipe/KFDCB2XH/chicken-cordon-bleu",
        "servings": 6,
        "minutes": 45,
        "summary": "Chicken Cordon Bleu might be just the main course you are searching for. This recipe serves 6 and costs $2.12 per serving. One serving contains <b>496 calories</b>, <b>49g of protein</b>, and <b>26g of fat</b>. Several people made this recipe, and 161 would say it hit the spot. A mixture of deli ham, chicken breasts, olive oil, and a handful of other ingredients are all it takes to make this recipe so yummy. To use up the flour you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-tart-with-caramel-sauce-47961\">Apple Tart with Caramel Sauce</a> as a dessert. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 84%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-320142\">Chicken Cordon Bleu</a>, <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-74241\">Chicken Cordon Bleu</a>, and <a href=\"https://spoonacular.com/recipes/chicken-cordon-bleu-558701\">Chicken Cordon Bleu</a> for similar recipes.",
        "nutrition": {
            "percentFat": 44.12,
            "percentCarbs": 13.2,
            "percentProtein": 42.68
        },
        "macro": "custom"
    },
    {
        "id": 642138,
        "title": "Easy Vegetable Fried Rice",
        "steps": "<ol><li>First blanch the raw green vegetables by sticking them in a pot of boiling water for a couple of minutes and then draining them. If you're using frozen vegetables, follow the package cooking instructions, but stop shy of three minutes of cooking time so they don't get mushy.</li><li>In large pan or wok, heat your sesame oil over medium heat. Throw in the garlic and ginger and fry that up for about a minute. Add the carrots and stir quickly for a minute or two. Then add the rice.</li><li>Now add soy sauce based on your saltiness preference.</li><li>Let that sizzle while you whip your egg in a small bowl. Move your rice to the edges of the pan so you have an empty space in the middle. Add the egg and scramble it up. When it looks close to being cooked, stir the rice back into the middle of the pan.</li><li>Next, throw in the broccoli and peas or other blanched vegetables of your choice. Add the sugar and stir for a couple minutes, then add the butter. Once the butter is melted through, let the rice sit there. Let it sizzle a bit.</li><li>That's it! Serve your fried rice.</li></ol>",
        "url": "http://www.foodista.com/recipe/H78BYQPP/easy-vegetable-fried-rice",
        "servings": 4,
        "minutes": 20,
        "summary": "Need a <b>gluten free and vegetarian side dish</b>? Easy Vegetable Fried Rice could be a great recipe to try. This recipe serves 4 and costs 64 cents per serving. One serving contains <b>236 calories</b>, <b>7g of protein</b>, and <b>10g of fat</b>. This recipe from Foodista has 13 fans. Head to the store and pick up ginger, dash of sugar, peas, and a few other things to make it today. From preparation to the plate, this recipe takes about <b>20 minutes</b>. This recipe is typical of Chinese cuisine. All things considered, we decided this recipe <b>deserves a spoonacular score of 49%</b>. This score is good. Try <a href=\"https://spoonacular.com/recipes/quick-and-easy-vegetable-fried-rice-679854\">Quick and easy vegetable fried rice</a>, <a href=\"https://spoonacular.com/recipes/easy-vegetable-fried-brown-rice-with-egg-802042\">Easy Vegetable Fried Brown Rice with Egg</a>, and <a href=\"https://spoonacular.com/recipes/veg-fried-rice-how-to-make-vegetable-fried-rice-rice-s-487457\">veg fried rice , how to make vegetable fried rice | rice s</a> for similar recipes.",
        "nutrition": {
            "percentFat": 36.51,
            "percentCarbs": 50.9,
            "percentProtein": 12.59
        },
        "macro": "custom"
    },
    {
        "id": 1100990,
        "title": "Blueberry, Chocolate & Cocao Superfood Pancakes - Gluten-Free/Paleo/Vegan",
        "steps": "<ol><li>Combine the almond, coconut, tapioca/arrowroot flour, baking powder, sugar and salt together and mix all the ingredients well before adding the milk and paste/extract and ensuring that all of the ingredients are whisked together to form a smooth batter.</li><li>Allow to sit for approximately 10-15 minutes.</li><li>Heat a small amount of coconut oil into a frying pan/skillet and pour a small enough amount of the batter into the middle of the pan.</li><li>Allow the batter to cook sufficiently for a few minutes (the edges should start to brown and the top of the batter should start to bubble) on one side before sprinkling on a few blueberries and flipping the pancake over to cook on the other side.</li><li>Immediately sprinkle on some of the cacao nibs and dark chocolate on top and continue to cook thoroughly for a few minutes before removing the pancake and setting aside.</li><li>Repeat with the remaining batter until finished.</li><li>Pour over the agave, give thanks and enjoy!</li></ol>",
        "url": "https://www.foodista.com/recipe/35NX6PZB/blueberry-chocolate-cocao-superfood-pancakes-gluten-free-paleo-vegan",
        "servings": 2,
        "minutes": 30,
        "summary": "If you want to add more <b>gluten free, dairy free, paleolithic, and fodmap friendly</b> recipes to your recipe box, Blueberry, Chocolate & Cocao Superfood Pancakes - Gluten-Free/Paleo/Vegan might be a recipe you should try. For <b>$2.39 per serving</b>, you get a breakfast that serves 2. One serving contains <b>559 calories</b>, <b>12g of protein</b>, and <b>21g of fat</b>. Not a lot of people made this recipe, and 1 would say it hit the spot. From preparation to the plate, this recipe takes around <b>30 minutes</b>. It is brought to you by Foodista. Overall, this recipe earns a <b>good spoonacular score of 75%</b>. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/blueberry-almond-butter-grain-free-granola-gluten-free-paleo-+-vegan-894113\">Blueberry Almond Butter Grain-Free Granola (Gluten-Free, Paleo + Vegan)</a>, <a href=\"https://spoonacular.com/recipes/vegan-gluten-free-vanilla-blueberry-buckwheat-pancakes-51948\">Vegan & Gluten-free Vanilla Blueberry Buckwheat Pancakes</a>, and <a href=\"https://spoonacular.com/recipes/blackberry-+-blueberry-cobbler-gluten-free-paleo-+-vegan-779559\">Blackberry + Blueberry Cobbler (Gluten Free, Paleo + Vegan)</a>.",
        "nutrition": {
            "percentFat": 33.08,
            "percentCarbs": 58.55,
            "percentProtein": 8.37
        },
        "macro": "custom"
    },
    {
        "id": 632611,
        "title": "Apple Walnut Brownies",
        "steps": "<ol><li>Preheat oven to 160C/320F. Line a rectangle cake pan.</li><li>Combine butter and chopped baking chocolate over low heat until melted. Remove from heat and set aside to cool.</li><li>Place eggs. brown sugar, and vanilla extract in a mixing bowl and beat till fluffy and add in the melted butter chocolate mixture, stir till well combined.</li><li>Add self rising flour, cinnamon, walnuts, and green apple, mix well and pour into prepared cake pan.</li><li>Bake in preheated oven for 40 to 45 minutes and leave cake to cool. Best to chill for at least one hour for easy spreading of the ganache cream.</li><li>To make the chocolate ganache: bring the cream to just a boil over medium-high heat.</li><li>Add in the semi-sweet chocolate pieces and blend well till chocolate melts. </li><li>Whisk until creamy.</li><li>Let cool and spread onto cake.</li></ol>",
        "url": "http://www.foodista.com/recipe/N6KNP37Q/apple-walnut-brownies",
        "servings": 10,
        "minutes": 75,
        "summary": "The recipe Apple Walnut Brownies could satisfy your American craving in about <b>1 hour and 15 minutes</b>. For <b>$1.19 per serving</b>, you get a dessert that serves 10. One serving contains <b>401 calories</b>, <b>6g of protein</b>, and <b>33g of fat</b>. This recipe from Foodista has 10 fans. A mixture of self rising flour, semi-sweet chocolate, butter, and a handful of other ingredients are all it takes to make this recipe so scrumptious. All things considered, we decided this recipe <b>deserves a spoonacular score of 39%</b>. This score is not so spectacular. Similar recipes include <a href=\"https://spoonacular.com/recipes/walnut-brownies-454785\">Walnut Brownies</a>, <a href=\"https://spoonacular.com/recipes/walnut-oat-brownies-416333\">Walnut Oat Brownies</a>, and <a href=\"https://spoonacular.com/recipes/walnut-brownies-408642\">Walnut Brownies</a>.",
        "nutrition": {
            "percentFat": 69.48,
            "percentCarbs": 24.55,
            "percentProtein": 5.97
        },
        "macro": "custom"
    },
    {
        "id": 638568,
        "title": "Chili Pie with Green Chile and Cheddar Cornbread Crust",
        "steps": "<ol><li>In a large skillet saute onion in oil until soft and translucent, seasoning with salt and pepper. Add garlic and saute until fragrant. Remove 2/3 of the mixture from pan and set aside. Add green chilies with their juices and saute for 2-3 minutes. Remove and set aside in a separate bowl.</li><li>In the same skillet brown ground beef, crumbling it as it cooks. When cooked through carefully drain grease. Add the onion mixture, chili powder, Worcestershire, oregano, paprika, cinnamon, nutmeg, and water. Mix thoroughly and continue cooking over medium-low heat as you add the tomatoes with juices, the beans and corn. Mix well and cook for 3-4 minutes.</li><li>Preheat oven to 400 degrees and grease a 9x13 inch casserole dish. Pour the meat mixture in and spread evenly over bottom. Sprinkle two cups of the cheese over top.</li><li>In a large bowl combine the flour, cornmeal, baking powder and salt.</li><li>In a separate medium bowl whisk the eggs, milk, butter and sour cream. Add this mixture to the dry mix and stir together.</li><li>Add the onion/green chile mixture and the remaining cup of cheese. Stir in. Pour over top of the meat mixture. Spread evenly. Sprinkle Chile powder over top.</li><li>Bake 25-30 minutes or until a toothpick comes clean from center of cornbread. Let set for 10 minutes before serving.</li></ol>",
        "url": "http://www.foodista.com/recipe/R526VXXY/chili-pie-w-green-chile-cheddar-cornbread-crust",
        "servings": 8,
        "minutes": 60,
        "summary": "Chili Pie with Green Chile and Cheddar Cornbread Crust might be just the <b>Southern</b> recipe you are searching for. For <b>$2.41 per serving</b>, this recipe <b>covers 28%</b> of your daily requirements of vitamins and minerals. One serving contains <b>702 calories</b>, <b>36g of protein</b>, and <b>40g of fat</b>. From preparation to the plate, this recipe takes about <b>1 hour</b>. It is perfect for <b>The Super Bowl</b>. This recipe from Foodista has 15 fans. A mixture of paprika, chile powder, kosher salt and pepper, and a handful of other ingredients are all it takes to make this recipe so scrumptious. All things considered, we decided this recipe <b>deserves a spoonacular score of 73%</b>. This score is pretty good. Try <a href=\"https://spoonacular.com/recipes/green-chile-cornbread-246379\">Green Chile Cornbread</a>, <a href=\"https://spoonacular.com/recipes/green-chile-cornbread-518683\">Green Chile Cornbread</a>, and <a href=\"https://spoonacular.com/recipes/cheddar-chili-cornbread-pie-609897\">Cheddar Chili Cornbread Pie</a> for similar recipes.",
        "nutrition": {
            "percentFat": 53.9,
            "percentCarbs": 32.51,
            "percentProtein": 13.59
        },
        "macro": "custom"
    },
    {
        "id": 648524,
        "title": "Jean's Seafood Gumbo",
        "steps": "Fill a 14-16-quart pot with two quarts of water and bring to a boil.\nMeanwhile, peel and devein the shrimp, keeping the heads and hulls. Set the shrimp aside in cold water. In the large \"gumbo pot\" boil heads and hulls for 30 minutes to an hour. This will give you Creole gumbo. Strain shrimp heads and hulls from stock and set aside. Discard heads and hull immediately. Otherwise, the next day your kitchen will smell like Bayou St. John.\nClean the fresh crabs  If the crabs are fresh, you must take time to clean them. Discard the hard back shell and some of the so-called \"dead man,\" or yellow insides. Clean and separate crabs and set aside. (Note: If necessary, you can use meat from king, Dungeness, snow or stone crabs for your gumbo).\nBefore you fire up the stove again, cut up your celery, parsley, peppers, onions and garlic, especially if you're alone and there is no one to help you stir the pots. It takes time peeling the onions and garlic  Put the celery and parsley in a separate container from the other chopped ingredients and refrigerate until needed to keep them fresh.\nPlace the gumbo pot with the shrimp stock on the stove. Add cleaned crabs and bay leaves. Stir slowly. You don't want your shrimp stock messing up the floor. Add celery, parsley, and tomato paste to the gumbo brewing on the stove. Bring to a boil. Turn down heat, cover, and let simmer.\nHere comes the roux -- a thick and flavorful sauce that has become one of the most important staples of Louisiana cuisine. Pour oil or shortening into a separate heavy skillet (please do not use a thin omelet pan) over a medium-low heat. Slowly stir in flour to make the roux. Keep your eyes on the skillet. If the phone rings, let the answering machine pick it up. Cook roux until it has a dark mahogany color. Do not stop stirring until roux appears nutty or grainy. If black specks appear, the roux is burned. Throw it out and start from scratch. A good roux could take 30 to 45 minutes cooking time.\nNow you are ready to add the holy trinity of onions, garlic, and green peppers to the roux mixture. Stir ingredients in slowly because the flour is still sizzling. The moisture will begin to disappear. This is when Jean would add another quart or two of water to the gumbo pot. Add roux to the gumbo pot. Bring to a boil, stirring constantly. Lower heat and cover. The kitchen should smell good right now. Pour yourself another cold something-or-other. You're halfway there. Come back to look and stir in an hour or so.\nSeason to taste: add salt, pepper, thyme, Worcestershire sauce, Tabasco sauce and any Creole seasoning you like. Don't overdo it right now. Let the roux work its magic absorbing all the wonderful ingredients. Gumbo is usually very spicy, but you can keep it mild. Remember, if you have decided to use andouille sausage it is also hot.\nFry sausages and okra with a little bit of the leftover grease. Sprinkle a little leftover flour if the okra is fresh. Add to gumbo pot. Add chopped peeled tomatoes, stirring until well blended. Add more water if necessary. The roux will keep it thick and tasty. Return to a boil and simmer for 10 minutes. Reduce heat and let simmer, uncovered, for 2 1/2 to 3 hours over low heat.\nSkim any excess fat. Add shrimp. Stir in slowly as you increase the heat one last time. It's time to stir in the fil powder. Cook another 20 to 30 minutes until the gumbo is thick. Taste and adjust seasonings one more time. Did I mention the rice? Seafood gumbo is served over Louisiana rice. Of course, you can substitute for your own favorite rice. Just plain old brown or white rice will do. Before serving, taste one more time and adjust seasoning. Turn off heat and remove seafood gumbo from the stove.\nTo cool down the pot before serving, place it in the sink with a few inches of ice-cold water. If needed, add additional salt and Tabasco sauce. If you can see through the gumbo to the bottom of the pot, work on your roux next time.",
        "url": "https://www.foodista.com/recipe/Z2KPLCN3/jean-s-seafood-gumbo",
        "servings": 9,
        "minutes": 45,
        "summary": "If you want to add more <b>Cajun</b> recipes to your recipe box, Jean's Seafood Gumbo might be a recipe you should try. For <b>$5.32 per serving</b>, this recipe <b>covers 50%</b> of your daily requirements of vitamins and minerals. One serving contains <b>558 calories</b>, <b>72g of protein</b>, and <b>20g of fat</b>. This recipe serves 9. 6 people have tried and liked this recipe. Only a few people really liked this main course. It is a good option if you're following a <b>dairy free</b> diet. If you have canned tomatoes, creole seasoning, peppers, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 87%</b>, which is great. <a href=\"https://spoonacular.com/recipes/seafood-gumbo-411231\">Seafood Gumbo</a>, <a href=\"https://spoonacular.com/recipes/seafood-gumbo-34779\">Seafood Gumbo</a>, and <a href=\"https://spoonacular.com/recipes/seafood-gumbo-971756\">Seafood Gumbo</a> are very similar to this recipe.",
        "nutrition": {
            "percentFat": 29.99,
            "percentCarbs": 15.34,
            "percentProtein": 54.67
        },
        "macro": "custom"
    },
    {
        "id": 803061,
        "title": "Easy Asian Sweet Chili Chicken Meatballs",
        "steps": "InstructionsPreheat the oven to 425Lightly grease a sheet pan with Olive oil.Add chicken, egg, bread crumbs to a bowl and mix well.Stir in the cabbage, peppers, onions and carrot.It is best to just get right in with your hands and mix.Roll into 2 balls, place on sheet pan.Bake for 15-20 mins or until cooked through.",
        "url": "http://www.pinkwhen.com/sweet-chili-chicken-meatballs/",
        "servings": 6,
        "minutes": 45,
        "summary": "Easy Asian Sweet Chili Chicken Meatballs might be just the main course you are searching for. Watching your figure? This dairy free recipe has <b>270 calories</b>, <b>18g of protein</b>, and <b>8g of fat</b> per serving. For <b>$1.52 per serving</b>, this recipe <b>covers 16%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. This recipe is typical of American cuisine. 12 people have made this recipe and would make it again. It will be a hit at your <b>The Super Bowl</b> event. Head to the store and pick up pepper flakes, rice wine vinegar, cornstarch, and a few other things to make it today. To use up the cabbage you could follow this main course with the <a href=\"https://spoonacular.com/recipes/cabbage-that-tastes-like-dessert-92896\">Cabbage That Tastes Like Dessert!</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 56%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/asian-sweet-chili-chicken-861359\">Asian Sweet Chili Chicken</a>, <a href=\"https://spoonacular.com/recipes/sweet-chili-chicken-with-asian-vegetable-rice-101145\">Sweet Chili Chicken With Asian Vegetable Rice</a>, and <a href=\"https://spoonacular.com/recipes/turkey-or-chicken-meatballs-with-sweet-chili-sauce-138000\">Turkey (Or Chicken) Meatballs With Sweet Chili Sauce</a> for similar recipes.",
        "nutrition": {
            "percentFat": 27.09,
            "percentCarbs": 45.33,
            "percentProtein": 27.58
        },
        "macro": "custom"
    },
    {
        "id": 655806,
        "title": "Pesto & Yogurt Pasta",
        "steps": "<ol><li>In a food processor, blend parsley, garlic, nuts and oil until smooth.  Mix in yogurt and cheese.  Season with salt and pepper.</li><li>Cook pasta in a large pot of boiling water, stirring occasionally until al dente.</li><li>Toss pasta and pesto sauce together in a large bowl.</li></ol>",
        "url": "http://www.foodista.com/recipe/Z4QRF6N7/pesto-yogurt-pasta",
        "servings": 4,
        "minutes": 45,
        "summary": "Pesto & Yogurt Pasta might be just the main course you are searching for. This recipe serves 4 and costs $1.52 per serving. One serving contains <b>371 calories</b>, <b>13g of protein</b>, and <b>15g of fat</b>. This recipe from Foodista has 9 fans. Head to the store and pick up salt & pepper, flat leaf parsley, garlic, and a few other things to make it today. To use up the low fat plain yogurt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/yogurt-molasses-cookies-173936\">Yogurt Molasses Cookies</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 92%</b>. This score is super. Try <a href=\"https://spoonacular.com/recipes/pasta-with-yogurt-pesto-138803\">Pasta with Yogurt Pesto</a>, <a href=\"https://spoonacular.com/recipes/yogurt-pesto-pasta-salad-170338\">Yogurt Pesto Pasta Salad</a>, and <a href=\"https://spoonacular.com/recipes/a-stonyfield-virtual-cooking-party-garlicky-shrimp-over-pasta-with-spinach-yogurt-pesto-508611\">A Stonyfield Virtual Cooking Party: Garlicky Shrimp over Pasta with Spinach Yogurt Pesto</a> for similar recipes.",
        "nutrition": {
            "percentFat": 34.94,
            "percentCarbs": 51.38,
            "percentProtein": 13.68
        },
        "macro": "custom"
    },
    {
        "id": 639851,
        "title": "Cod with Tomato-Olive-Chorizo Sauce and Mashed Potatoes",
        "steps": "<ol><li>If frozen, thaw completely the cod fillets, and dry them with paper towels. season with salt and set aside.</li><li>Peel and quarter the potatoes, and cook in lightly salted water until tender.</li><li>Meanwhile, fry the pepper in olive oil for 3-4 minutes.</li><li>Add cubed sausage, saut for another 2-3 minutes.</li><li>Add the whole plum tomatoes,  halve them with a flat end of a wooden spoon.</li><li>Stir in olives and parsley, cook the sauce gently for 2 minutes. Set aside.</li><li>Drain the potatoes and season with parsley, olive oil and lemon juice. Use a hand masher to mix and mash. Leave in a warm place.</li><li>Place the cod fillets into a hot oiled non-stick pan and cook over a high heat for 5 minutes on each side or until golden brown.</li><li>Serve with mashed potatoes and sauce.</li></ol>",
        "url": "http://www.foodista.com/recipe/GNSQNH5W/cod-with-tomatoes-olives-and-chorizo",
        "servings": 2,
        "minutes": 45,
        "summary": "Need a <b>gluten free, dairy free, fodmap friendly, and whole 30 main course</b>? Cod with Tomato-Olive-Chorizo Sauce and Mashed Potatoes could be a super recipe to try. For <b>$6.21 per serving</b>, this recipe <b>covers 47%</b> of your daily requirements of vitamins and minerals. This recipe makes 2 servings with <b>768 calories</b>, <b>56g of protein</b>, and <b>47g of fat</b> each. <b>Thanksgiving</b> will be even more special with this recipe. This recipe from Foodista has 14 fans. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. Head to the store and pick up salt, cod fillets, plum tomatoes, and a few other things to make it today. To use up the salt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-turnovers-recipe-48175\">Apple Turnovers Recipe</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 96%</b>. This score is spectacular. Try <a href=\"https://spoonacular.com/recipes/tuna-steaks-in-spicy-tomato-sauce-with-mashed-potatoes-668002\">Tuna Steaks In Spicy Tomato Sauce With Mashed Potatoes</a>, <a href=\"https://spoonacular.com/recipes/olive-oil-mashed-potatoes-121569\">Olive Oil Mashed Potatoes</a>, and <a href=\"https://spoonacular.com/recipes/mashed-potatoes-with-olive-oil-and-herbs-312137\">Mashed Potatoes with Olive Oil and Herbs</a> for similar recipes.",
        "nutrition": {
            "percentFat": 49.55,
            "percentCarbs": 20.1,
            "percentProtein": 30.35
        },
        "macro": "custom"
    },
    {
        "id": 638744,
        "title": "Chipotle Cheese Stuffed Black Bean Burgers with Avocado Creme",
        "steps": "Add a swirl of olive oil to a skillet and add diced mushrooms and onions.\nSaute until softened then season with salt and pepper.\nAdd drained black beans to a medium bowl and press and mash with a fork.\nMix in mushrooms and onions then add egg and bread crumbs.\nFinally mix in cumin and chipotle chili powder.\nRoll and form into burger patties (sliders or full size).\nForm a indent in the center of each burger\nAdd a spoonful of cream cheese spread to the indent in the burgers and then form the burger over the cream cheese.\nHeat a skillet over medium heat, add a swirl of olive oil.\nAdd 2 burgers at a time and sear on each side until cooked and browned, about 4 minutes each side.\nIf you want to add sliced cheese on top, add now and cover skillet to steam and melt cheese.\nRemove to a plate, then cook remaining patties.\nFor the avocado creme, combine all ingredients in a food processor or blender, and mix until smooth. Taste and add more sour cream or lime juice if needed.\nTo plate, add each hot cooked burger to an open toasted bun. Top with lettuce and tomato (optional) and a hearty scoop of avocado creme and then top with bun.",
        "url": "https://www.foodista.com/recipe/BBKK34SS/chipotle-cheese-stuffed-black-bean-burgers-with-avocado-creme",
        "servings": 4,
        "minutes": 45,
        "summary": "Chipotle Cheese Stuffed Black Bean Burgers with Avocado Creme is an American recipe that serves 4. One serving contains <b>473 calories</b>, <b>20g of protein</b>, and <b>29g of fat</b>. For <b>$1.6 per serving</b>, this recipe <b>covers 20%</b> of your daily requirements of vitamins and minerals. 8 people were glad they tried this recipe. A mixture of hamburger buns, lime juice, panko bread crumbs, and a handful of other ingredients are all it takes to make this recipe so delicious. Not a lot of people really liked this main course. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 60%</b>. This score is good. Try <a href=\"https://spoonacular.com/recipes/black-bean-chipotle-tostadas-with-crme-frache-696215\">Black Bean & Chipotle Tostadas with Crème Fraîche</a>, <a href=\"https://spoonacular.com/recipes/black-bean-soup-with-pico-de-gallo-and-chipotle-creme-635077\">Black Bean Soup With Pico De Gallo and Chipotle Creme</a>, and <a href=\"https://spoonacular.com/recipes/sweet-potato-black-bean-burritos-with-chipotle-crme-fraiche-583815\">Sweet Potato Black Bean Burritos with Chipotle Crème Fraiche</a> for similar recipes.",
        "nutrition": {
            "percentFat": 53.59,
            "percentCarbs": 30.1,
            "percentProtein": 16.31
        },
        "macro": "custom"
    },
    {
        "id": 634891,
        "title": "Best Chicken Parmesan",
        "steps": "<ol><li>Depending on how think your chicken breasts are, place them under plastic wrap and pound until thin. If you don't have a meat pounder, use a heavy pot of skillet. You can also fillet these with a knife.</li><li>Get 3 pie plates or containers. Put flour in one, beaten eggs in one and bread crumbs in one.</li><li>Dredge chicken breast in flour, then in the egg wash, and then the bread crumbs.</li><li>Fry cutlets in vegetable oil over med heat. Fry until golden brown.</li><li>Spread a little marinara on the bottom of a 13x9 baking dish.</li><li>Make a layer of chicken. Add more marinara. Use most of the first quart. Add a layer of the cheeses. Repeat layers. Sprinkle parsley over last layer of cheese. Bake in a pre-heated 350 degree oven covered for 35 minutes. uncover and bake until top is bubbly!</li></ol>",
        "url": "http://www.foodista.com/recipe/FZF4ZNP2/best-chicken-parmesan",
        "servings": 6,
        "minutes": 45,
        "summary": "The recipe Best Chicken Parmesan could satisfy your Mediterranean craving in roughly <b>45 minutes</b>. This recipe serves 6 and costs $3.51 per serving. One serving contains <b>690 calories</b>, <b>56g of protein</b>, and <b>26g of fat</b>. Only a few people made this recipe, and 9 would say it hit the spot. It works well as a main course. If you have style bread crumbs, chicken cutlets, vegetable oil, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 84%</b>. This score is great. Try <a href=\"https://spoonacular.com/recipes/easy-parmesan-chicken-fingers-and-parmesan-chicken-wraps-271729\">Easy Parmesan Chicken Fingers and Parmesan Chicken Wraps</a>, <a href=\"https://spoonacular.com/recipes/chicken-chasseur-hunter-style-chicken-with-creamy-polenta-with-gruyere-and-parmesan-325816\">Chicken Chasseur (Hunter-Style Chicken) with Creamy Polenta with Gruyere and Parmesan</a>, and <a href=\"https://spoonacular.com/recipes/parmesan-chicken-136333\">Parmesan Chicken</a> for similar recipes.",
        "nutrition": {
            "percentFat": 37.56,
            "percentCarbs": 28.18,
            "percentProtein": 34.26
        },
        "macro": "custom"
    },
    {
        "id": 715574,
        "title": "Homemade Strawberry Shake",
        "steps": "Add the strawberries, whole milk and vanilla ice cream to a blender, and blend until smooth.Pour into cold glasses that have been kept in the freezer.Return the shakes to the freezer for about 5 minutes, or until they are thick.Top with whipped cream and sliced strawberries.",
        "url": "http://www.pinkwhen.com/homemade-strawberry-shake/",
        "servings": 6,
        "minutes": 45,
        "summary": "Homemade Strawberry Shake might be just the beverage you are searching for. For <b>47 cents per serving</b>, this recipe <b>covers 6%</b> of your daily requirements of vitamins and minerals. Watching your figure? This gluten free recipe has <b>170 calories</b>, <b>5g of protein</b>, and <b>9g of fat</b> per serving. Head to the store and pick up strawberries, vanillan ice cream, milk, and a few other things to make it today. 30 people were impressed by this recipe. It can be enjoyed any time, but it is especially good for <b>Mother's Day</b>. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 48%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/strawberry-milkshake-strawberry-short-shake-551702\">Strawberry Milkshake - Strawberry Short-Shake</a>, <a href=\"https://spoonacular.com/recipes/homemade-shamrock-shake-507774\">Homemade Shamrock Shake</a>, and <a href=\"https://spoonacular.com/recipes/healthy-homemade-shamrock-shake-594783\">Healthy Homemade Shamrock Shake</a> for similar recipes.",
        "nutrition": {
            "percentFat": 44.15,
            "percentCarbs": 45.21,
            "percentProtein": 10.64
        },
        "macro": "custom"
    },
    {
        "id": 664192,
        "title": "Tzadziki",
        "steps": "Salt lightly the cucumbers, mix and set aside for 5 minutes to release the water. To remove as much water as possible from the grated cucumber, squeeze it in small quantities with hands.\nMix and combine yogurt, sour cream, olive oil, vinegar, garlic and white pepper until smooth.\nAdd cucumbers and dill, mix and combine.Adjust the seasoning.\nChill for at least two hours before serving.",
        "url": "https://www.foodista.com/recipe/8RBBN8GT/tzadziki",
        "servings": 2,
        "minutes": 45,
        "summary": "Tzadziki is a <b>gluten free, lacto ovo vegetarian, and primal</b> recipe with 2 servings. One serving contains <b>451 calories</b>, <b>10g of protein</b>, and <b>39g of fat</b>. For <b>$2.71 per serving</b>, this recipe <b>covers 15%</b> of your daily requirements of vitamins and minerals. 7 people were glad they tried this recipe. It is brought to you by Foodista. From preparation to the plate, this recipe takes about <b>about 45 minutes</b>. Not a lot of people really liked this side dish. If you have cucumbers, olive oil, cream, and a few other ingredients on hand, you can make it. With a spoonacular <b>score of 56%</b>, this dish is solid. Try for similar recipes.",
        "nutrition": {
            "percentFat": 76.08,
            "percentCarbs": 15.59,
            "percentProtein": 8.33
        },
        "macro": "custom"
    },
    {
        "id": 641896,
        "title": "Easy Chicken Cordon Bleu",
        "steps": "Pre-heat oven into 180C.\nGently pound the chicken breast into 1/4 thickness using a meat mallet.\nSeason the chicken meat - sprinkle salt and ground pepper on both sides.\nPlace 1 ham and 2 cheese sticks on top of each breast (but I prefer putting on another 2 cheese sticks! i love cheese!) Roll up each breast an secure with a toothpick.\nDredge in flour. Then brush with beaten eggs. Then finally roll in bread crumbs mixture.\nBrush the baking pan with olive oil, then place the chicken rolls.\nBake for about 20 minutes. Then layer each rolls with butter cubes. Let the butter melts on its top, the roll will absorb its flavor and will give a really nice smell.\nBake for another 15 minutes.\nYou may serve this your favorite sauce.",
        "url": "https://www.foodista.com/recipe/PW5QGG6L/easy-chicken-cordon-bleu",
        "servings": 8,
        "minutes": 45,
        "summary": "Easy Chicken Cordon Bleu takes about <b>around 45 minutes</b> from beginning to end. One serving contains <b>131 calories</b>, <b>6g of protein</b>, and <b>7g of fat</b>. This recipe serves 8 and costs 24 cents per serving. 22 people were impressed by this recipe. This recipe from Foodista requires bread crumbs- add, ham, egg, and salt. With a spoonacular <b>score of 19%</b>, this dish is not so excellent. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/easy-chicken-cordon-bleu-401928\">Easy Chicken Cordon Bleu</a>, <a href=\"https://spoonacular.com/recipes/easy-chicken-cordon-bleu-74367\">Easy Chicken Cordon Bleu</a>, and <a href=\"https://spoonacular.com/recipes/easy-chicken-cordon-bleu-627364\">Easy Chicken Cordon Bleu</a>.",
        "nutrition": {
            "percentFat": 40.29,
            "percentCarbs": 41.49,
            "percentProtein": 18.22
        },
        "macro": "custom"
    },
    {
        "id": 664273,
        "title": "Valentine's Day Potted Plant Ice-Cream Desserts",
        "steps": "Remove cream from cookies and pound the cookies into crumbs. Set aside.\nMix ice-cream with the rest of the ingredients and put them into serving cups. Freeze them well.\nTop the ice-cream cups with Oreo crumbs and insert a sprig of parsley just before serving your Potted Plant Ice-Cream Desserts!\n* Tips: Don't make your desserts look too neat. They're meant to be a bit messy with the \" soil \". After all, they're supposed to be plants, aren't they?",
        "url": "https://www.foodista.com/recipe/2GZ5DQ3F/valentine-s-day-potted-plant-ice-cream-desserts",
        "servings": 5,
        "minutes": 45,
        "summary": "Valentine's Day Potted Plant Ice-Cream Desserts might be a good recipe to expand your side dish recipe box. For <b>46 cents per serving</b>, this recipe <b>covers 4%</b> of your daily requirements of vitamins and minerals. One portion of this dish contains approximately <b>2g of protein</b>, <b>7g of fat</b>, and a total of <b>137 calories</b>. This recipe serves 5. Head to the store and pick up lit vanillan ice-cream, palm seeds, berries, and a few other things to make it today. This recipe from Foodista has 6 fans. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 13%</b>. This score is rather bad. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/14-bite-sized-valentines-day-desserts-566162\">14 Bite-Sized Valentine’s Day Desserts</a>, <a href=\"https://spoonacular.com/recipes/cutie-pie-pops-valentines-day-desserts-572052\">Cutie Pie Pops ~ Valentine’s Day Desserts</a>, and <a href=\"https://spoonacular.com/recipes/strawberries-cream-valentines-day-cupcakes-505473\">Strawberries & Cream Valentine’s Day Cupcakes</a>.",
        "nutrition": {
            "percentFat": 44.94,
            "percentCarbs": 48.29,
            "percentProtein": 6.77
        },
        "macro": "custom"
    },
    {
        "id": 640266,
        "title": "Crab and Shrimp Burgers With Garlic Grits Fries",
        "steps": "Burgers:\nIn a large bowl, carefully mix all of the ingredients except the breadcrumbs, seafood seasoning and butter. Form into 8 patties and set on a baking sheet. Chill for an hour.\nOnce chilled, cover all sides of the patties with bread crumbs and lay on a separate baking sheet. Bake in an oven preheated to 375 degrees for 15-20 minutes, flipping once.\nIf desired, top with a bit of butter and set the burgers onto a vegetable grill basket. Heat for 1-2 minutes on a preheated grill just for flavor and a little color. Serve on warm buns.\nFries:\nCook the grits according to the package directions. Stir in the cheese and salt just before removing from heat.\nCarefully pour the hot grits into a large, shallow plastic container. Allow the grits to cool down to room temperature. Cover, then chill overnight.\nWhen ready, overturn the grits onto a large cutting board and cut into 1/2 wide pieces. Lay them on a parchment paper covered baking sheet and bake in a preheated oven at 425 degrees for 30-40 minutes or until browned. Flip them once to brown all sides.",
        "url": "https://www.foodista.com/recipe/KG7C6P3L/crab-and-shrimp-burgers-with-garlic-grits-fries",
        "servings": 8,
        "minutes": 45,
        "summary": "If you want to add more <b>American</b> recipes to your recipe box, Crab and Shrimp Burgers With Garlic Grits Fries might be a recipe you should try. This recipe serves 8. One serving contains <b>346 calories</b>, <b>20g of protein</b>, and <b>11g of fat</b>. For <b>$1.79 per serving</b>, this recipe <b>covers 20%</b> of your daily requirements of vitamins and minerals. If you have egg, milk, garlic, and a few other ingredients on hand, you can make it. 50 people were impressed by this recipe. It is brought to you by Foodista. It works best as a main course, and is done in roughly <b>roughly 45 minutes</b>. It is a good option if you're following a <b>pescatarian</b> diet. Overall, this recipe earns a <b>good spoonacular score of 61%</b>. Similar recipes are <a href=\"https://spoonacular.com/recipes/shrimp-and-crab-gumbo-over-grits-34858\">Shrimp-and-Crab Gumbo Over Grits</a>, <a href=\"https://spoonacular.com/recipes/charleston-shrimp-and-grits-with-tasso-blue-crab-gravy-319973\">Charleston Shrimp and Grits with Tasso Blue Crab Gravy</a>, and <a href=\"https://spoonacular.com/recipes/lemon-garlic-shrimp-and-grits-489380\">Lemon Garlic Shrimp and Grits</a>.",
        "nutrition": {
            "percentFat": 27.54,
            "percentCarbs": 45.66,
            "percentProtein": 26.8
        },
        "macro": "custom"
    },
    {
        "id": 716427,
        "title": "Roasted Butterflied Chicken w. Onions & Carrots",
        "steps": "",
        "url": "http://fullbellysisters.blogspot.com/2014/04/roasted-butterflied-chicken-w-onions.html",
        "servings": 4,
        "minutes": 45,
        "summary": "Roasted Butterflied Chicken w. Onions & Carrots is a <b>gluten free and whole 30</b> main course. For <b>$4.08 per serving</b>, this recipe <b>covers 39%</b> of your daily requirements of vitamins and minerals. This recipe makes 4 servings with <b>1159 calories</b>, <b>86g of protein</b>, and <b>84g of fat</b> each. If you have carrots, herbes de provence, ghee, and a few other ingredients on hand, you can make it. To use up the ghee you could follow this main course with the <a href=\"https://spoonacular.com/recipes/rice-pudding-with-pistachios-raisins-and-saffron-114434\">Rice Pudding with Pistachios, Raisins and Saffron</a> as a dessert. This recipe from fullbellysisters.blogspot.com has 73 fans. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 80%</b>. This score is excellent. Try <a href=\"https://spoonacular.com/recipes/roasted-chicken-breasts-with-carrots-and-onions-40150\">Roasted Chicken Breasts With Carrots And Onions</a>, <a href=\"https://spoonacular.com/recipes/garlic-herb-roasted-chicken-with-potatoes-carrots-and-onions-241517\">Garlic-Herb Roasted Chicken with Potatoes, Carrots, and Onions</a>, and <a href=\"https://spoonacular.com/recipes/steak-with-roasted-carrots-and-onions-41332\">Steak With Roasted Carrots And Onions</a> for similar recipes.",
        "nutrition": {
            "percentFat": 64.66,
            "percentCarbs": 9.96,
            "percentProtein": 25.38
        },
        "macro": "custom"
    },
    {
        "id": 642178,
        "title": "Egg and Dairy Free Pancakes",
        "steps": "In a small bowl, mix together ground flaxseed with 3 tbsp water. Let stand for 2-3 minutes before using.\nIn another bowl, mix together flours, sugar, baking powder, baking soda and salt. Add almond milk and cooking oil to flaxseed, then pour into the flour. Mix well until there are few lumps left.\nHeat a skillet over medium heat. Add 1/4 c.of batter to the pan. Cook for 2-3 minutes until bubbles form on top. Flip and cook for 2 minutes on the other side. Remove from pan and repeat until batter has been used up.\nServe with maple syrup or your favorite jam.",
        "url": "https://www.foodista.com/recipe/DL8G33VY/egg-and-dairy-free-pancakes",
        "servings": 12,
        "minutes": 45,
        "summary": "If you have around <b>about 45 minutes</b> to spend in the kitchen, Egg and Dairy Free Pancakes might be an excellent <b>dairy free</b> recipe to try. This recipe serves 12. For <b>8 cents per serving</b>, this recipe <b>covers 3%</b> of your daily requirements of vitamins and minerals. This breakfast has <b>68 calories</b>, <b>1g of protein</b>, and <b>3g of fat</b> per serving. This recipe from Foodista has 18 fans. If you have ground flaxseed, baking powder, sugar, and a few other ingredients on hand, you can make it. Taking all factors into account, this recipe <b>earns a spoonacular score of 13%</b>, which is rather bad. Similar recipes include <a href=\"https://spoonacular.com/recipes/egg-dairy-gluten-free-pancakes-214047\">Egg, dairy & gluten-free pancakes</a>, <a href=\"https://spoonacular.com/recipes/ranch-dressing-dairy-free-egg-free-corn-free-nut-free-and-soy-free-512181\">Ranch Dressing (Dairy-Free, Egg-Free, Corn-Free, Nut-Free and Soy-Free)</a>, and <a href=\"https://spoonacular.com/recipes/everything-free-cookies-dairy-free-gluten-free-egg-free-nut-free-sugar-free-728610\">Everything-Free Cookies (dairy-free, gluten-free, egg-free, nut-free, & sugar-free)</a>.",
        "nutrition": {
            "percentFat": 39.96,
            "percentCarbs": 51.74,
            "percentProtein": 8.3
        },
        "macro": "custom"
    },
    {
        "id": 649794,
        "title": "Lemon square bars",
        "steps": "<ol><li>In a medium bowl, stir together 2 cups flour and confectioners' sugar. Blend in the melted butter and vanilla essence.</li><li>Press the soft dough with the palm of your hand into the bottom of the greased 9x13 inch pan.</li><li>Bake the dough in the preheated oven at 170C for 15 minutes, or until golden.</li><li>Meanwhile, in a large bowl, beat eggs until light.</li><li>Combine the sugar, baking powder and  cup of flour so there will be no flour lumps.</li><li>Stir the sugar mixture into the eggs.</li><li>Stir in the lemon juice and lemon rind. Pour over the prepared crust and return to the oven.</li><li>Bake for an additional 30 minutes or until bars are set.</li><li>Allow to cool completely before cutting into bars.</li></ol>",
        "url": "http://www.foodista.com/recipe/43B2Y4CT/lemon-square-bars",
        "servings": 24,
        "minutes": 45,
        "summary": "Lemon square bars might be just the hor d'oeuvre you are searching for. For <b>14 cents per serving</b>, this recipe <b>covers 1%</b> of your daily requirements of vitamins and minerals. Watching your figure? This vegetarian recipe has <b>72 calories</b>, <b>1g of protein</b>, and <b>4g of fat</b> per serving. This recipe is liked by 12 foodies and cooks. A mixture of baking powder, butter, sugar, and a handful of other ingredients are all it takes to make this recipe so tasty. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 8%</b>. This score is very bad (but still fixable). Similar recipes include <a href=\"https://spoonacular.com/recipes/pineapple-square-bars-sundaysupper-511201\">Pineapple Square Bars #SundaySupper</a>, <a href=\"https://spoonacular.com/recipes/italian-square-meatballs-181073\">Italian Square Meatballs</a>, and <a href=\"https://spoonacular.com/recipes/liberty-square-cookies-489168\">Liberty Square Cookies</a>.",
        "nutrition": {
            "percentFat": 51.49,
            "percentCarbs": 44.91,
            "percentProtein": 3.6
        },
        "macro": "custom"
    },
    {
        "id": 638088,
        "title": "Chicken Farfalle with Low-Fat Alfredo Sauce",
        "steps": "<ol><li>1. Cook chicken breasts (I sauteed mine with a little olive oil and salt and pepper) and set aside. Cook pasta while cooking the chicken and set aside.</li><li>2. In a sauce pan, melt butter. Add flour and stir in with butter, cook for 1 minute. Whisk in milk, salt and pepper, garlic powder, lemon juice, and wine. Bring to a boil, constantly whisking. Reduce the heat and simmer for about 5 more minutes. Sauce should thicken.</li><li>3. In a large saute pan, add pasta, chicken, and any other desired additions. Heat pan on medium heat. Add alfredo sauce and toss with pasta. Sprinkle with Parmesan cheese and additional salt and pepper (if needed) and serve!</li><li>Notes: This recipe made more sauce than I really needed, but I liked having extra. This way, you can add as much sauce as you prefer!</li></ol>",
        "url": "http://www.foodista.com/recipe/KBLGPNRP/chicken-farfalle-with-low-fat-alfredo-sauce",
        "servings": 4,
        "minutes": 45,
        "summary": "The recipe Chicken Farfalle with Low-Fat Alfredo Sauce could satisfy your Mediterranean craving in around <b>45 minutes</b>. This recipe makes 4 servings with <b>674 calories</b>, <b>43g of protein</b>, and <b>9g of fat</b> each. For <b>$1.98 per serving</b>, this recipe <b>covers 27%</b> of your daily requirements of vitamins and minerals. Only a few people made this recipe, and 7 would say it hit the spot. It works well as a main course. A mixture of juice of lemon, farfalle pasta, wine, and a handful of other ingredients are all it takes to make this recipe so scrumptious. To use up the salt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-turnovers-recipe-48175\">Apple Turnovers Recipe</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 79%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/low-fat-cinnamon-energy-balls-909039\">Low-Fat Cinnamon Energy Balls</a>, <a href=\"https://spoonacular.com/recipes/low-carb-alfredo-sauce-with-spiralized-zucchini-909052\">Low Carb Alfredo Sauce with Spiralized Zucchini</a>, and <a href=\"https://spoonacular.com/recipes/low-carb-bagels-coconut-flour-fat-head-dough-912856\">Low Carb Bagels – Coconut Flour Fat Head Dough</a> for similar recipes.",
        "nutrition": {
            "percentFat": 12.77,
            "percentCarbs": 60.91,
            "percentProtein": 26.32
        },
        "macro": "custom"
    },
    {
        "id": 661602,
        "title": "Sterling Cooper Blini with Caviar",
        "steps": "<ol><li>In a large bowl, sift the flour and baking powder together. Add the milk, sugar and 2 tablespoons sour cream. Beat the egg until frothy, add to batter and stir well. Let batter stand for 20 minutes.</li><li>Melt butter on a griddle or large skillet.  Fry small (2-3 inch) pancakes in very hot butter. Drain on paper towels. Top each blini with sour cream and caviar before serving.</li></ol>",
        "url": "http://www.foodista.com/recipe/FR7746PB/sterling-cooper-blini-with-caviar",
        "servings": 16,
        "minutes": 45,
        "summary": "Sterling Cooper Blini with Caviar might be just the morn meal you are searching for. For <b>25 cents per serving</b>, this recipe <b>covers 2%</b> of your daily requirements of vitamins and minerals. Watching your figure? This pescatarian recipe has <b>84 calories</b>, <b>1g of protein</b>, and <b>7g of fat</b> per serving. A few people made this recipe, and 22 would say it hit the spot. This recipe is typical of Eastern European cuisine. A mixture of cream, sugar, caviar, and a handful of other ingredients are all it takes to make this recipe so yummy. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 11%</b>. This score is not so amazing. Similar recipes include <a href=\"https://spoonacular.com/recipes/sterling-cooper-sling-cocktail-493439\">Sterling Cooper Sling Cocktail</a>, <a href=\"https://spoonacular.com/recipes/vichyssoise-of-kumumoto-oysters-and-royal-sterling-caviar-354648\">Vichyssoise of Kumumoto Oysters and Royal Sterling Caviar</a>, and <a href=\"https://spoonacular.com/recipes/potato-blini-with-caviar-307024\">Potato Blini with Caviar</a>.",
        "nutrition": {
            "percentFat": 74.94,
            "percentCarbs": 18.15,
            "percentProtein": 6.91
        },
        "macro": "custom"
    },
    {
        "id": 648432,
        "title": "Jambalaya Stew",
        "steps": "Add all ingredients except shrimp to a large pot on the stove. Mix thoroughly. Bring to a boil.\nReduce heat to medium low. Cover and simmer until vegetables are tender and rice is fluffy, about 35 minutes.\nAdd shrimp and re-cover. Continue to cook until shrimp are tender and cooked through, about 6 minutes.\nIf you like, season to taste with salt, black pepper, and additional hot sauce. Serve and enjoy!!!",
        "url": "https://www.foodista.com/recipe/HG72GN7R/jambalaya-stew",
        "servings": 4,
        "minutes": 45,
        "summary": "Jambalaya Stew might be a good recipe to expand your main course recipe box. This recipe serves 4 and costs $2.27 per serving. Watching your figure? This gluten free and dairy free recipe has <b>289 calories</b>, <b>21g of protein</b>, and <b>8g of fat</b> per serving. From preparation to the plate, this recipe takes roughly <b>roughly 45 minutes</b>. It is brought to you by Foodista. <b>Autumn</b> will be even more special with this recipe. If you have cajun seasoning, canned tomatoes, shrimp, and a few other ingredients on hand, you can make it. This recipe is liked by 11 foodies and cooks. It is an <b>affordable</b> recipe for fans of Cajun food. All things considered, we decided this recipe <b>deserves a spoonacular score of 80%</b>. This score is great. Users who liked this recipe also liked <a href=\"https://spoonacular.com/recipes/jambalaya-stew-34848\">Jambalaya Stew</a>, <a href=\"https://spoonacular.com/recipes/gumbo-laya-gumbo-+-jambalaya-stew-793549\">Gumbo-laya” (Gumbo + Jambalaya) Stew</a>, and <a href=\"https://spoonacular.com/recipes/jambalaya-1079154\">Jambalaya</a>.",
        "nutrition": {
            "percentFat": 23.52,
            "percentCarbs": 48.32,
            "percentProtein": 28.16
        },
        "macro": "bodybuilding"
    },
    {
        "id": 640336,
        "title": "Crabby Corn Chowder",
        "steps": "<ol><li>Heat a deep pot over medium heat. Add oil and butter. When butter is melted, add potatoes, celery, onion, bay leaves and chipotle peppers to the pot. Season vegetables with salt and pepper, mix well and saute until tender, about 10 minutes.</li><li>Sprinkle in flour and cook about 2 minutes, stirring constantly. Stir in clam juice and half and half and mix well.</li><li>Bring soup up to a simmer and continue to simmer for about 20 minutes, or until potatoes are soft.</li><li>Stir in corn, crab and sherry and simmer for another 5 minutes, until heated through.</li><li>Adjust the soup seasonings and remove the bay leaf.  Ladle soup into bowls and top with a few dashes of hot sauce, if desired.</li><li>Serve with some crackers, crusty bread or cornbread.</li></ol>",
        "url": "http://www.foodista.com/recipe/L6JLY36Q/crabby-corn-chowder",
        "servings": 6,
        "minutes": 45,
        "summary": "Need a <b>pescatarian main course</b>? Crabby Corn Chowder could be an awesome recipe to try. For <b>$4.65 per serving</b>, this recipe <b>covers 30%</b> of your daily requirements of vitamins and minerals. One serving contains <b>555 calories</b>, <b>27g of protein</b>, and <b>30g of fat</b>. Not a lot of people made this recipe, and 8 would say it hit the spot. A mixture of yukon gold potatoes, celery, corn kernels, and a handful of other ingredients are all it takes to make this recipe so tasty. To use up the butter you could follow this main course with the <a href=\"https://spoonacular.com/recipes/cinnamon-butter-cake-60334\">Cinnamon Butter Cake</a> as a dessert. From preparation to the plate, this recipe takes about <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 76%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/crabby-clam-chowder-607164\">Crabby Clam Chowder</a>, <a href=\"https://spoonacular.com/recipes/oscar-party-crabby-snacks-and-homemades-except-just-crabby-snacks-511853\">Oscar Party: Crabby Snacks and Homemades (Except Just Crabby Snacks)</a>, and <a href=\"https://spoonacular.com/recipes/corn-chowder-117865\">Corn Chowder</a> for similar recipes.",
        "nutrition": {
            "percentFat": 45.87,
            "percentCarbs": 36.02,
            "percentProtein": 18.11
        },
        "macro": "custom"
    },
    {
        "id": 632790,
        "title": "Arugula Walnut Pesto",
        "steps": "With this recipe you play with the amount of ingredients based on your likes & the strength of the garlic, arugula, etc.\nBest to use a mortar & pestle but if you dont have one the food processor works just fine.\nIn the mortal & pestle or the processor start off with your arugula and a drizzle of oil to get it working. Once pulverized add in 1 clove of garlic & continue to grind. Now add in your nuts, lemon juice and a bit of salt & pepper & give it one more grind. At this point abandon the mortal & pestle or the machine & dump the mixture into a bowl.\nAdd a small handful of cheese and while continuously mixing add in the olive oil until you achieve your desired consistency. For crostini I would leave as a paste, for a pasta sauce keep it a bit looser - this is all based on the amount of olive oil you use.\nNow recheck your seasonings - more garlic? A little light on the acid? Add a squeeze of lemon. Is it flat? A pinch of salt will wake it up. Let sit for an hour or so to let the flavors incorporate. Store in the fridge. It will last a few days before the arugula will turn.\nServe tossed over fresh pasta or rubbed over toasty bread with a ribbon of parmesan, a delicious topping for pizza or a beautiful frittata with a dollop of arugula pesto! There are a million ways to use this - enjoy!",
        "url": "https://www.foodista.com/recipe/LC478RB6/arugula-walnut-pesto",
        "servings": 4,
        "minutes": 45,
        "summary": "You can never have too many condiment recipes, so give Arugula Walnut Pesto a try. This recipe serves 4. One portion of this dish contains about <b>2g of protein</b>, <b>9g of fat</b>, and a total of <b>86 calories</b>. For <b>44 cents per serving</b>, this recipe <b>covers 3%</b> of your daily requirements of vitamins and minerals. 28 people have made this recipe and would make it again. A mixture of arugula, garlic, walnuts, and a handful of other ingredients are all it takes to make this recipe so yummy. It is a good option if you're following a <b>gluten free and primal</b> diet. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 58%</b>, which is pretty good. Similar recipes are <a href=\"https://spoonacular.com/recipes/arugula-walnut-pesto-489854\">Arugula Walnut Pesto</a>, <a href=\"https://spoonacular.com/recipes/arugula-walnut-pesto-8289\">Arugula Walnut Pesto</a>, and <a href=\"https://spoonacular.com/recipes/arugula-and-walnut-pesto-476027\">Arugulan and Walnut Pesto</a>.",
        "nutrition": {
            "percentFat": 83.75,
            "percentCarbs": 9.44,
            "percentProtein": 6.81
        },
        "macro": "custom"
    },
    {
        "id": 637824,
        "title": "Chewy Gingersnaps",
        "steps": "<ol><li>Preheat oven to 325 F (160 C)</li><li>In a large bowl, stir flour, baking soda, salt and spices together</li><li>In another bowl, cream the butter, oil and sugars together.</li><li>Beat in the eggs one at a time, followed by the molasses</li><li>Stir in the dry ingredients until everything is well mixed.</li><li>Shape the dough into small balls and roll in sugar before placing on a baking tray that has been lined with parchment paper.</li><li>Bake for 8 minutes (they will still seem a bit underdone when you first take them out).</li></ol>",
        "url": "http://www.foodista.com/recipe/HY8GLB3V/chewy-gingersnaps",
        "servings": 75,
        "minutes": 45,
        "summary": "One serving contains <b>87 calories</b>, <b>1g of protein</b>, and <b>5g of fat</b>. For <b>30 cents per serving</b>, this recipe <b>covers 2%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes about <b>45 minutes</b>. 27 people have tried and liked this recipe. A mixture of molasses, ginger, flour, and a handful of other ingredients are all it takes to make this recipe so tasty. It is a good option if you're following a <b>vegetarian</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 11%</b>. This score is not so tremendous. Try <a href=\"https://spoonacular.com/recipes/chewy-100-whole-wheat-gingersnaps-694441\">Chewy 100% Whole Wheat Gingersnaps</a>, <a href=\"https://spoonacular.com/recipes/soft-chewy-gingersnaps-580306\">Soft & Chewy Gingersnaps</a>, and <a href=\"https://spoonacular.com/recipes/chewy-lemon-blueberry-cookies-both-cakey-and-chewy-versions-listed-572597\">Chewy Lemon Blueberry Cookies (both cakey and chewy versions listed)</a> for similar recipes.",
        "nutrition": {
            "percentFat": 43.34,
            "percentCarbs": 51.86,
            "percentProtein": 4.8
        },
        "macro": "custom"
    },
    {
        "id": 665029,
        "title": "Watermelon Popsicles with Mint, Basil & Lime",
        "steps": "<ol><li>Combine basil, lime juice, mint leaves, salt, and cubed watermelon in a blender.  Blend at highest speed until liquefied.</li><li>Pour into popsicle molds or ice cube tray and freeze for a minimum of 4 hours.</li><li>Serve.</li></ol>",
        "url": "http://www.foodista.com/recipe/DVBZGTMM/watermelon-popsicles-with-mint-basil-lime",
        "servings": 8,
        "minutes": 45,
        "summary": "Watermelon Popsicles with Mint, Basil & Lime might be just the side dish you are searching for. This caveman, gluten free, primal, and whole 30 recipe serves 8 and costs <b>22 cents per serving</b>. One serving contains <b>25 calories</b>, <b>1g of protein</b>, and <b>0g of fat</b>. 13 people have made this recipe and would make it again. It can be enjoyed any time, but it is especially good for <b>Summer</b>. If you have basil leaves, watermelon flesh, salt, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 18%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/watermelon-lime-mint-popsicles-480038\">Watermelon Lime Mint Popsicles</a>, <a href=\"https://spoonacular.com/recipes/watermelon-aguas-frescas-with-lime-mint-basil-syrup-27656\">Watermelon Aguas Frescas With Lime, Mint & Basil Syrup</a>, and <a href=\"https://spoonacular.com/recipes/watermelon-mint-popsicles-with-blueberries-603118\">Watermelon-Mint Popsicles with Blueberries</a> for similar recipes.",
        "nutrition": {
            "percentFat": 4.09,
            "percentCarbs": 88.27,
            "percentProtein": 7.64
        },
        "macro": "custom"
    },
    {
        "id": 662610,
        "title": "Sweet Potatoes Muffins",
        "steps": "<ol><li>Cook in the oven the sweet potatoes until soft. Remove from the oven and peel them. Place the meat into a dish, smash to reduce to a no chunk pulp and let it cool.</li><li>Keep the oven at 400.</li><li>Mix all the flour, baking powder, salt, sugar, cinnamon and chocolate chips if using.</li><li>Add to the dry ingredients the orange juice, sweet potatoes, egg and oil and mix well.</li><li>Place muffins cups in muffins pan and pour muffins mix up to cup high.</li><li>Sprinkle sanding sugar and bake in the oven for 15 to 20 minutes, or until the toothpick comes out clean.</li><li>Serve at room temperature.</li></ol>",
        "url": "http://www.foodista.com/recipe/M8J4MGVZ/sweet-potatoes-muffins",
        "servings": 15,
        "minutes": 45,
        "summary": "Sweet Potatoes Muffins might be just the morn meal you are searching for. One serving contains <b>238 calories</b>, <b>2g of protein</b>, and <b>8g of fat</b>. This dairy free recipe serves 15 and costs <b>23 cents per serving</b>. 9 people have tried and liked this recipe. If you have baking powder, egg, cinnamon, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 22%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/fanned-sweet-potatoes-or-hasselback-sweet-potatoes-secret-club-474154\">Fanned Sweet Potatoes or Hasselback Sweet Potatoes {Secret Club}</a>, <a href=\"https://spoonacular.com/recipes/date-nut-muffins-these-sweet-muffins-with-bits-of-walnuts-and-dates-are-perfect-warm-out-of-the-oven-599736\">Date-Nut Muffins – these sweet muffins with bits of walnuts and dates are perfect warm out of the oven</a>, and <a href=\"https://spoonacular.com/recipes/meatless-sweet-and-sour-dish-with-tofu-and-sweet-potatoes-520910\">Meatless sweet and sour dish with tofu and sweet potatoes</a> for similar recipes.",
        "nutrition": {
            "percentFat": 30.6,
            "percentCarbs": 65.55,
            "percentProtein": 3.85
        },
        "macro": "custom"
    },
    {
        "id": 632115,
        "title": "Almond Coffee Cupcakes with Kahlua Liqueur",
        "steps": "<ol><li>Preheat oven to 180C (335F). Place the flour, sugar, almond meal, coffee, butter and egg whites in a bowl and mix well combine with a hand whisk.</li><li>Spoon mixture into 6 lightly greased or use cooking spray on medium size muffin pan or 12 mini muffin pan and bake for 20-25 minutes or until cooked when tested with a skewer.</li><li>Drizzle with the liqueur (about 1/2 tablespoon on each cake) and set aside for 2 minutes before turning out on a wire rack to cool.</li><li>Decorate with chocolate icing on top (I used Wiltion chocolate icing) or just dust with some icing sugar.</li><li>You can serve them warm or store it in an airtight container for 2-3 days.</li></ol>",
        "url": "http://www.foodista.com/recipe/MRKT5WMR/almond-coffee-cake-with-kahlua-liqueur",
        "servings": 6,
        "minutes": 45,
        "summary": "The recipe Almond Coffee Cupcakes with Kahlua Liqueur could satisfy your American craving in around <b>45 minutes</b>. One serving contains <b>279 calories</b>, <b>2g of protein</b>, and <b>12g of fat</b>. This recipe serves 6 and costs $1.14 per serving. Head to the store and pick up instant coffee powder, plain flour, icing sugar, and a few other things to make it today. 24 people were glad they tried this recipe. It works well as a rather inexpensive dessert. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 11%</b>. This score is not so great. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/kahlua-coffee-liqueur-600131\">Kahlua Coffee Liqueur</a>, <a href=\"https://spoonacular.com/recipes/better-than-kahlua-how-to-make-coffee-liqueur-522955\">Better than Kahlua – How to Make Coffee Liqueur</a>, and <a href=\"https://spoonacular.com/recipes/chocolate-kahlua-cupcakes-with-kahlua-creme-filling-549956\">Chocolate Kahlua Cupcakes with Kahlua Creme Filling</a>.",
        "nutrition": {
            "percentFat": 41.41,
            "percentCarbs": 54.94,
            "percentProtein": 3.65
        },
        "macro": "custom"
    },
    {
        "id": 637766,
        "title": "Cherry Lime Mojito",
        "steps": "Place cherries, mint, sugar and lime in a tall glass.\nMuddle ingredients together at the bottom of the glass.\nAdd a few ice cubes and pour in the rum.\nFill the glass the rest of the way with carbonated water and serve.",
        "url": "https://www.foodista.com/recipe/82DFQ4GB/cherry-lime-mojito",
        "servings": 1,
        "minutes": 45,
        "summary": "Cherry Lime Mojito is a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> recipe with 1 servings. This beverage has <b>184 calories</b>, <b>1g of protein</b>, and <b>0g of fat</b> per serving. For <b>$2.23 per serving</b>, this recipe <b>covers 3%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. 21 person were impressed by this recipe. This recipe from Foodista requires carbonated water, mint leaves, lime, and rum. With a spoonacular <b>score of 9%</b>, this dish is very bad (but still fixable). If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/sparkling-cherry-lime-mojito-punch-560452\">Sparkling Cherry Lime Mojito Punch</a>, <a href=\"https://spoonacular.com/recipes/the-ultimate-mojito-the-sequel-the-cherry-mojito-560082\">The Ultimate Mojito… The Sequel – The Cherry Mojito</a>, and <a href=\"https://spoonacular.com/recipes/crimson-tide-mojito-cherry-mojito-507159\">Crimson Tide Mojito (Cherry Mojito)</a>.",
        "nutrition": {
            "percentFat": 2.34,
            "percentCarbs": 93.05,
            "percentProtein": 4.61
        },
        "macro": "custom"
    },
    {
        "id": 715378,
        "title": "Strawberry and Nutella Cobbler",
        "steps": "Preheat oven to 400 degrees.Combine strawberries, nutella, cornstarch, sugar, and vanilla in a mixing bowl until strawberries are evenly coated.Pour mixture into a 9 inch round pie pan.In another mixing bowl, whisk together flour, sugar, baking powder, and salt.Slowly add the cream and whisk until just combined.Roll out the mixture onto a non stick baking mat and knead one or two times to combine.Grab a handful of dough (approx 3 tbsp.) and roll into a ball and then gently flatten.Lay biscuits over the strawberry mixture, having them slightly overlap. These do not have to be perfect.Spread a small amount of left over cream over the biscuits and then sprinkle with a small amount of sugar.Bake for 20-25 minutes or until biscuits are golden brown and the strawberries are bubbling.Let cool for at least half an hour so that the strawberry juices can firm back up.Serve warm with whipped cream or ice cream!",
        "url": "http://www.pinkwhen.com/strawberry-and-nutella-cobbler/",
        "servings": 3,
        "minutes": 45,
        "summary": "The recipe Strawberry and Nutella Cobbler could satisfy your Southern craving in roughly <b>45 minutes</b>. This recipe makes 3 servings with <b>664 calories</b>, <b>7g of protein</b>, and <b>26g of fat</b> each. For <b>$1.79 per serving</b>, this recipe <b>covers 17%</b> of your daily requirements of vitamins and minerals. It can be enjoyed any time, but it is especially good for <b>Mother's Day</b>. 435 people were impressed by this recipe. Head to the store and pick up baking powder, cornstarch, salt, and a few other things to make it today. Several people really liked this dessert. It is a good option if you're following a <b>vegetarian</b> diet. All things considered, we decided this recipe <b>deserves a spoonacular score of 67%</b>. This score is pretty good. Try <a href=\"https://spoonacular.com/recipes/strawberry-nutella-cheesecake-610461\">Strawberry Nutella Cheesecake</a>, <a href=\"https://spoonacular.com/recipes/strawberry-nutella-poptarts-583757\">Strawberry Nutella Poptarts</a>, and <a href=\"https://spoonacular.com/recipes/strawberry-nutella-muffins-547678\">Strawberry Nutella Muffins</a> for similar recipes.",
        "nutrition": {
            "percentFat": 38.17,
            "percentCarbs": 57.35,
            "percentProtein": 4.48
        },
        "macro": "custom"
    },
    {
        "id": 647210,
        "title": "Honey Dijon Roasted Brussels Sprout",
        "steps": "<ol><li>Preheat oven to 400</li><li>whisk together olive oil, mustard and honey until well combined.</li><li>In a large bowl, toss brussels sprouts in honey mustard mixture.</li><li>Spread brussels sprouts evenly on a cast iron skillet or roasting pan. Salt and pepper to taste.</li><li>Bake on top rack for 20 minutes. Remove from oven and toss so the brussels sprouts cook evenly. Place back in the oven and roast for an additional 10 minutes.</li><li>The outside leaves should be slightly charred and the inside should be tender.</li></ol>",
        "url": "http://www.foodista.com/recipe/R7YYMQF4/honey-dijon-roasted-brussels-sprout",
        "servings": 4,
        "minutes": 45,
        "summary": "Honey Dijon Roasted Brussels Sprout might be just the side dish you are searching for. This recipe makes 4 servings with <b>115 calories</b>, <b>2g of protein</b>, and <b>7g of fat</b> each. For <b>54 cents per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. A mixture of brussels sprouts, dijon mustard, olive oil, and a handful of other ingredients are all it takes to make this recipe so scrumptious. 13 people were impressed by this recipe. It is a good option if you're following a <b>caveman, gluten free, dairy free, and primal</b> diet. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 69%</b>. This score is good. Similar recipes include <a href=\"https://spoonacular.com/recipes/shaved-brussels-sprout-salad-with-raisins-maple-dijon-vinaigrette-623434\">Shaved Brussels Sprout Salad with Raisins & Maple Dijon Vinaigrette</a>, <a href=\"https://spoonacular.com/recipes/brussels-sprout-with-mustard-and-honey-636361\">Brussels Sprout With Mustard And Honey</a>, and <a href=\"https://spoonacular.com/recipes/honey-mustard-brussels-sprout-slaw-580747\">Honey Mustard Brussels Sprout Slaw</a>.",
        "nutrition": {
            "percentFat": 53.1,
            "percentCarbs": 41.45,
            "percentProtein": 5.45
        },
        "macro": "custom"
    },
    {
        "id": 645671,
        "title": "Grilled Chicken with Sateay Sauce",
        "steps": "Whisk together the lemon juice, olive oil, salt, pepper, and thyme. Pour over the chicken breasts in a large bowl.\nCover and marinate in the refrigerator for 6 hours or overnight. (The longer the chicken marinates, the better it will taste).\nHeat the grill and cook the chicken breasts for 10 minutes on each side, until just cooked through.\nRemove from the grill, cover and let stand for a couple of minutes before serving.\nFor the Satay Sauce\nCook the olive oil, sesame oil, red onion, garlic, ginger root, and red pepper flakes in a small, heavy bottomed pot on medium heat until the onion is transparent, 10 to 15 minutes.\nIn a bowl whisk in the vinegar, sugar, soy sauce, peanut butter, ketchup, sherry and lime juice.\nAdd to the onion mixture and cook for 1 minute.\nCool and use alongside the chicken.",
        "url": "https://www.foodista.com/recipe/RKXLQ8SZ/grilled-chicken-with-sateay-sauce",
        "servings": 4,
        "minutes": 45,
        "summary": "If you want to add more <b>gluten free and dairy free</b> recipes to your recipe box, Grilled Chicken with Sateay Sauce might be a recipe you should try. This recipe makes 4 servings with <b>938 calories</b>, <b>58g of protein</b>, and <b>65g of fat</b> each. For <b>$3.47 per serving</b>, this recipe <b>covers 34%</b> of your daily requirements of vitamins and minerals. A mixture of sherry, olive oil, small-diced onion, and a handful of other ingredients are all it takes to make this recipe so delicious. <b>The Fourth Of July</b> will be even more special with this recipe. Only a few people made this recipe, and 9 would say it hit the spot. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. It is brought to you by Foodista. Taking all factors into account, this recipe <b>earns a spoonacular score of 74%</b>, which is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/grilled-chicken-wings-with-spicy-chipotle-hot-sauce-and-blue-cheese-yogurt-dipping-sauce-320519\">Grilled Chicken Wings with Spicy Chipotle Hot Sauce and Blue Cheese-Yogurt Dipping Sauce</a>, <a href=\"https://spoonacular.com/recipes/cornell-chicken-grilled-chicken-with-white-barbecue-sauce-195842\">Cornell Chicken (Grilled Chicken With White Barbecue Sauce)</a>, and <a href=\"https://spoonacular.com/recipes/biltmore-estate-chicken-breasts-over-rigatoni-rich-gorgonzola-sauce-covers-grilled-chicken-and-pasta-599145\">Biltmore Estate Chicken Breasts Over Rigatoni – rich Gorgonzola sauce covers grilled chicken and pasta</a>.",
        "nutrition": {
            "percentFat": 61.49,
            "percentCarbs": 13.89,
            "percentProtein": 24.62
        },
        "macro": "custom"
    },
    {
        "id": 661531,
        "title": "Steak with lemon and capers",
        "steps": "<ol><li>Flatten the steaks lightly with a meat mallet.</li><li>Combine flour, salt and pepper, dip steaks into the mixture, coating both sides.</li><li>Saut the steaks in a hot mixture of butter and olive oil over medium heat, about 4 minutes on each side. Remove from the pan and set aside.</li><li>Saut the garlic in the same fat for about 1 minute, stirring.</li><li>Add the wine and lemon juice, stir and simmer for 5 minutes to slightly reduce the liquid.</li><li>Add capers, stir. Return the steaks to the pan, cover and simmer over low heat for 4 minutes.</li></ol>",
        "url": "http://www.foodista.com/recipe/JKGPWDDP/steak-with-lemon-and-capers",
        "servings": 2,
        "minutes": 45,
        "summary": "Steak with lemon and capers might be just the main course you are searching for. One serving contains <b>951 calories</b>, <b>47g of protein</b>, and <b>54g of fat</b>. For <b>$6.49 per serving</b>, this recipe <b>covers 32%</b> of your daily requirements of vitamins and minerals. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. 9 people were impressed by this recipe. It can be enjoyed any time, but it is especially good for <b>valentin day</b>. A mixture of flour, garlic, lemon wedges, and a handful of other ingredients are all it takes to make this recipe so flavorful. To use up the dry white wine you could follow this main course with the <a href=\"https://spoonacular.com/recipes/white-wine-frozen-yogurt-206235\">White Wine Frozen Yogurt</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 73%</b>. This score is pretty good. Similar recipes include <a href=\"https://spoonacular.com/recipes/steak-salad-sandwiches-with-capers-30072\">Steak Salad Sandwiches with Capers</a>, <a href=\"https://spoonacular.com/recipes/steak-salad-with-arugula-parmesan-crispy-capers-8826\">Steak Salad With Arugula, Parmesan & Crispy Capers</a>, and <a href=\"https://spoonacular.com/recipes/chicken-with-lemon-and-capers-29925\">Chicken with Lemon and Capers</a>.",
        "nutrition": {
            "percentFat": 55.21,
            "percentCarbs": 23.43,
            "percentProtein": 21.36
        },
        "macro": "custom"
    },
    {
        "id": 657939,
        "title": "Ratatouille With Brie",
        "steps": "Remove outer peel from eggplant and dice into  inch pieces\nHeat 1-2 oz. of olive oil in a heavy gauge skillet\nSaut the diced eggplant for 2-3 minutes then place on a towel to drain\nAfter draining place cooked eggplant into a small oval casserole dish\nPreheat oven to 375 F\nCarefully slice the zucchini , yellow squash , and tomatoes about  inch even slices\nSlice the Brie also into  inch slices (utilizing a cheese wire makes simplifies this)\nBegin placing sliced yellow squash , zucchini , sliced Brie and tomatoes in a shingled pattern working from the outside of the casserole towards the center\nWhen all vegetables and cheese are placed in the casserole, drizzle with the remaining olive oil and sprinkle with chopped thyme\nSeason with salt and pepper and bake in the oven for 10-15 minutes until bubbly",
        "url": "https://www.foodista.com/recipe/YKQ5H3TL/ratatouille-with-brie",
        "servings": 4,
        "minutes": 45,
        "summary": "You can never have too many Mediterranean recipes, so give Ratatouille With Brie a try. This main course has <b>490 calories</b>, <b>14g of protein</b>, and <b>45g of fat</b> per serving. This gluten free, lacto ovo vegetarian, and primal recipe serves 4 and costs <b>$1.97 per serving</b>. If you have brie log such as alouette, plum tomatoes, zucchini, and a few other ingredients on hand, you can make it. This recipe from Foodista has 63 fans. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. Overall, this recipe earns a <b>pretty good spoonacular score of 72%</b>. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/ratatouilles-ratatouille-thomas-kellers-confit-byaldi-498135\">Ratatouille’s Ratatouille (Thomas Keller’s Confit Byaldi)</a>, <a href=\"https://spoonacular.com/recipes/confit-byaldi-aka-ratatouilles-ratatouille-611946\">Confit Byaldi (aka Ratatouille’s Ratatouille)</a>, and <a href=\"https://spoonacular.com/recipes/brie-and-caramelized-shallots-puff-pastry-brie-tart-546740\">Brie and caramelized Shallots Puff Pastry Brie Tart</a>.",
        "nutrition": {
            "percentFat": 79.56,
            "percentCarbs": 9.07,
            "percentProtein": 11.37
        },
        "macro": "custom"
    },
    {
        "id": 715540,
        "title": "Summer Berry Salad",
        "steps": "Cut up a Granny Smith green apple, strawberries, and add blackberriesMix in with Romaine lettuceToss in some basalmic vinaigrette",
        "url": "http://www.pinkwhen.com/summer-berry-salad/",
        "servings": 1,
        "minutes": 45,
        "summary": "Summer Berry Salad might be just the side dish you are searching for. Watching your figure? This caveman, gluten free, primal, and vegan recipe has <b>98 calories</b>, <b>2g of protein</b>, and <b>1g of fat</b> per serving. This recipe serves 1 and costs $1.75 per serving. 17 people have tried and liked this recipe. If you have apples, blackberries, romaine lettuce, and a few other ingredients on hand, you can make it. It can be enjoyed any time, but it is especially good for <b>The Fourth Of July</b>. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 98%</b>. This score is outstanding. Try <a href=\"https://spoonacular.com/recipes/berry-summer-salad-50848\">Berry Summer Salad</a>, <a href=\"https://spoonacular.com/recipes/summer-berry-salad-485592\">Summer Berry Salad</a>, and <a href=\"https://spoonacular.com/recipes/chicken-berry-summer-salad-769303\">Chicken & Berry Summer Salad</a> for similar recipes.",
        "nutrition": {
            "percentFat": 10.55,
            "percentCarbs": 81.56,
            "percentProtein": 7.89
        },
        "macro": "custom"
    },
    {
        "id": 716377,
        "title": "Vegetable Rice",
        "steps": "Wash and bring to boil your rice for about 10 minutes.Chop your green vegetables and set aside. Strain the water from the rice and reduce the heat. Add your vegetables, butter, lemon juice and chili powder. Chop your garlic and add to the pot of rice with your seasoning cubes. Allow steaming on low heat till the rice is soft. Serve your vegetable rice hot with any protein of your choice. ",
        "url": "http://www.afrolems.com/2016/02/16/vegetable-rice/",
        "servings": 2,
        "minutes": 45,
        "summary": "Vegetable Rice might be just the main course you are searching for. This recipe serves 2 and costs $1.39 per serving. One serving contains <b>706 calories</b>, <b>16g of protein</b>, and <b>11g of fat</b>. 56 people have made this recipe and would make it again. It is a good option if you're following a <b>gluten free and vegetarian</b> diet. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. If you have butter, chili powder, seasoning cubes, and a few other ingredients on hand, you can make it. To use up the lemon juice you could follow this main course with the <a href=\"https://spoonacular.com/recipes/lemon-shortbread-cookies-with-lemon-icing-a-tribute-to-aunt-roxanne-487814\">Lemon Shortbread Cookies with Lemon Icing {A Tribute to Aunt Roxanne}</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 85%</b>. This score is spectacular. Similar recipes include <a href=\"https://spoonacular.com/recipes/wild-rice-and-brown-rice-cakes-with-roasted-vegetable-rag-186690\">Wild Rice and Brown Rice Cakes with Roasted Vegetable Ragù</a>, <a href=\"https://spoonacular.com/recipes/vegetable-rice-pilaf-in-the-rice-cooker-456334\">Vegetable Rice Pilaf in the Rice Cooker</a>, and <a href=\"https://spoonacular.com/recipes/veg-fried-rice-how-to-make-vegetable-fried-rice-rice-s-487457\">veg fried rice , how to make vegetable fried rice | rice s</a>.",
        "nutrition": {
            "percentFat": 13.15,
            "percentCarbs": 79.88,
            "percentProtein": 6.97
        },
        "macro": "custom"
    },
    {
        "id": 644846,
        "title": "Gluten Free Onion Rings",
        "steps": "Mix egg, oil, and milk on low speed of mixer for 1 minute.\nAdd Bette's Mix (or equivalent dry ingredients) and mix until smooth.\nPut 1/2 cup all purpose gf flour in a shallow dish. Coat onion rings in flour.\nDip floured onions in prepared batter.\nFry in hot oil (375 degrees, at least 1-inch deep) until desired shade of brown.",
        "url": "https://www.foodista.com/recipe/L5CSWWPM/gluten-free-onion-rings",
        "servings": 4,
        "minutes": 45,
        "summary": "Need a <b>lacto ovo vegetarian hor d'oeuvre</b>? Gluten Free Onion Rings could be an amazing recipe to try. This recipe serves 4. One serving contains <b>361 calories</b>, <b>8g of protein</b>, and <b>19g of fat</b>. For <b>83 cents per serving</b>, this recipe <b>covers 8%</b> of your daily requirements of vitamins and minerals. 38 people found this recipe to be yummy and satisfying. It is brought to you by Foodista. If you have egg, all purpose flour, salt, and a few other ingredients on hand, you can make it. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 30%</b>. This score is rather bad. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/gluten-free-onion-rings-ii-562910\">Gluten Free Onion Rings II</a>, <a href=\"https://spoonacular.com/recipes/crispy-gluten-free-onion-rings-979447\">Crispy Gluten Free Onion Rings</a>, and <a href=\"https://spoonacular.com/recipes/baked-onion-rings-gluten-free-520113\">Baked Onion Rings (Gluten Free)</a>.",
        "nutrition": {
            "percentFat": 21.2,
            "percentCarbs": 66.04,
            "percentProtein": 12.76
        },
        "macro": "custom"
    },
    {
        "id": 631888,
        "title": "A Christmas With Peking Duck",
        "steps": "<ol><li>Rinse duck and remove innards. Cut skin around neck and remove tail.</li><li>Hang duck neck-side-up over a large pot. Boil water.</li><li>Pour boiling water over the duck until skin is puffed up. Remove boiled water from pot.</li><li>Combine salt, white pepper, five spice powder and 2 tsp of hoison sauce.</li><li>Brush mixture on the outside and inside of the duck to marinate it.</li><li>Let mixture dry - about 2 hours.</li><li>Combine corn syrup, honey, rice vinegar and brush outside of the duck. Let duck air dry for 12-24 hours.</li><li>Preheat oven to 450 degrees. Roast duck for 40 minutes.</li><li>Let meat rest for 15 minutes after cooking. Cut the meat into thin slices and enjoy. Serve with Bao, Chinese pan cakes add hosin sauce and scallions.</li></ol>",
        "url": "http://www.foodista.com/recipe/3NYBNQQD/a-christmas-with-peking-duck",
        "servings": 12,
        "minutes": 45,
        "summary": "Need a <b>gluten free and dairy free main course</b>? A Christmas With Peking Duck could be a super recipe to try. For <b>$2.29 per serving</b>, this recipe <b>covers 24%</b> of your daily requirements of vitamins and minerals. This recipe makes 12 servings with <b>1230 calories</b>, <b>35g of protein</b>, and <b>119g of fat</b> each. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. It will be a hit at your <b>Christmas</b> event. 5 people have made this recipe and would make it again. A mixture of corn syrup, scallions, water, and a handful of other ingredients are all it takes to make this recipe so tasty. To use up the salt you could follow this main course with the <a href=\"https://spoonacular.com/recipes/apple-turnovers-recipe-48175\">Apple Turnovers Recipe</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 74%</b>. This score is pretty good. Try <a href=\"https://spoonacular.com/recipes/peking-duck-166665\">Peking Duck</a>, <a href=\"https://spoonacular.com/recipes/peking-duck-702595\">Peking Duck</a>, and <a href=\"https://spoonacular.com/recipes/peking-duck-74687\">Peking Duck</a> for similar recipes.",
        "nutrition": {
            "percentFat": 87.87,
            "percentCarbs": 0.68,
            "percentProtein": 11.45
        },
        "macro": "custom"
    },
    {
        "id": 644081,
        "title": "Fudgy chocolate cream cheese brownies with Baileys",
        "steps": "<ol><li>To make the chocolate layer, place chocolate and butter in a large glass dish (you will be adding the eggs, sugar, and flour to it later) and microwave 1.5 minutes. The chocolate may hold its shape when you remove it from the microwave, but it will be soft, so stir to melt it. If pieces remain after you have stirred it for a while then return to microwave for another few seconds and then stir again until it is fully melted. Be careful not to overheat the chocolate. You are better off starting with less time and reheating than overheating and ruining it.</li><li>When chocolate has melted add the sugar and vanilla and stir with a whisk to combine. Let it cool a little and then add the eggs, one at a time, whisking after each addition. Don't add the eggs when the chocolate is hot because it may cook the whites.</li><li>Once the eggs are mixed in, place the flour in a strainer and sift over the chocolate mixture, a little at a time, mixing it in as you sift it over. Set aside while you prepare the cream cheese layer.</li><li>For the cream cheese layer, place the cream cheese in a bowl and mix with a hand mixer for a couple of minutes until soft.</li><li>Add the sugar and mix to blend it in.</li><li>Add egg and beat to incorporate.</li><li>Add Bailey's and stir it in.</li><li>To assemble, spray an 8\" square baking pan with straight sides with non-stick spray, or butter and flour it. You can also line the baking pan with parchment, leaving the edges high so you can lift the entire cake out of the pan.</li><li>Pour the chocolate mixture into the pan and tilt it to spread it out evenly.</li><li>Pour the cream cheese mixture over it, and with a fork, swirl the layers so some of the chocolate shows on top and the cream cheese layer becomes part of the chocolate layer. Do not over mix - you just want some swirls.</li><li>Place in a preheated 350 degree F oven and bake for 35 minutes or until a knife inserted into the center comes out clean. Do not over bake.</li><li>Remove from oven and let cool before cutting into squares.</li></ol>",
        "url": "http://www.foodista.com/recipe/6DCLS47W/fudgy-chocolate-cream-cheese-brownies-with-baileys",
        "servings": 8,
        "minutes": 45,
        "summary": "The recipe Fudgy chocolate cream cheese brownies with Baileys could satisfy your American craving in roughly <b>45 minutes</b>. This recipe makes 8 servings with <b>581 calories</b>, <b>7g of protein</b>, and <b>34g of fat</b> each. For <b>$1.35 per serving</b>, this recipe <b>covers 9%</b> of your daily requirements of vitamins and minerals. If you have flour, bittersweet chocolate, sugar, and a few other ingredients on hand, you can make it. This recipe from Foodista has 143 fans. All things considered, we decided this recipe <b>deserves a spoonacular score of 34%</b>. This score is rather bad. Try <a href=\"https://spoonacular.com/recipes/fudgy-cream-cheese-brownies-221991\">Fudgy Cream Cheese Brownies</a>, <a href=\"https://spoonacular.com/recipes/ultimate-fudgy-cappuccino-cream-cheese-brownies-55124\">Ultimate Fudgy Cappuccino Cream Cheese Brownies</a>, and <a href=\"https://spoonacular.com/recipes/chocolate-stout-cake-with-baileys-irish-cream-cheese-frosting-507379\">Chocolate Stout Cake with Baileys Irish Cream Cheese Frosting</a> for similar recipes.",
        "nutrition": {
            "percentFat": 52.04,
            "percentCarbs": 43.07,
            "percentProtein": 4.89
        },
        "macro": "custom"
    },
    {
        "id": 639628,
        "title": "Classic Pot Roast",
        "steps": "Heat a cast iron skillet or dutch oven to medium high heat, and preheat the oven to 325 degrees.\nTrim excess fat off the chuck roast and season all over with salt and pepper, then coat the meat with canola oil, rubbing all sides of it.\nSear the meat in the skillet, browning for several minutes on all sides.\nRemove the meat and set aside, then add the vegetables. Saute for several minutes and season with salt and pepper.\nDeglaze the pan with beer and let reduce for several minutes.\nAdd the beef back to the pan and add the thyme, stock and Worcestershire.\nCover the pan and place in the oven and let cook for 6-8 hours, until the meat is fork tender. Serve with steamed potatoes or crusty bread.",
        "url": "https://www.foodista.com/recipe/MHHJFJCK/classic-pot-roast",
        "servings": 6,
        "minutes": 45,
        "summary": "If you want to add more <b>gluten free and dairy free</b> recipes to your recipe box, Classic Pot Roast might be a recipe you should try. This main course has <b>340 calories</b>, <b>30g of protein</b>, and <b>22g of fat</b> per serving. This recipe serves 6. For <b>$1.87 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. 9 people have made this recipe and would make it again. It is brought to you by Foodista. A mixture of baby carrots, beer, celery stalks, and a handful of other ingredients are all it takes to make this recipe so delicious. From preparation to the plate, this recipe takes around <b>around 45 minutes</b>. Taking all factors into account, this recipe <b>earns a spoonacular score of 56%</b>, which is solid. If you like this recipe, take a look at these similar recipes: <a href=\"https://spoonacular.com/recipes/classic-pot-roast-484451\">Classic Pot Roast</a>, <a href=\"https://spoonacular.com/recipes/classic-pot-roast-293385\">Classic Pot Roast</a>, and <a href=\"https://spoonacular.com/recipes/classic-pot-roast-534670\">Classic Pot Roast</a>.",
        "nutrition": {
            "percentFat": 54.04,
            "percentCarbs": 4.51,
            "percentProtein": 41.45
        },
        "macro": "custom"
    },
    {
        "id": 636552,
        "title": "Buttermilk Cornbread and Sage Stuffing",
        "steps": "Preheat oven to 325F.\nSpread all bread crumbs in a shallow baking pan and bake until dry, about 15 minutes total. Cool crumbs in pan, then transfer to a large bowl and stir in parsley, sage, salt, and pepper.\nMelt butter in a large heavy skillet over moderate heat. Add onions and liver and cook, stirring occasionally, until onions are softened, 8 to 10 minutes. Add celery and cook, stirring occasionally, 5 minutes. Transfer to bowl with crumbs and toss well. Add eggs, stock, and cream and toss well.\nTransfer stuffing to a buttered 2 1/2- to 3-quart shallow baking dish. Bake, covered, in middle of oven 30 minutes, then uncover and bake until browned, about 30 minutes more.",
        "url": "https://www.foodista.com/recipe/LF56ZJ6Z/buttermilk-cornbread-and-sage-stuffing",
        "servings": 10,
        "minutes": 45,
        "summary": "Buttermilk Cornbread and Sage Stuffing is a Southern recipe that serves 10. One serving contains <b>669 calories</b>, <b>17g of protein</b>, and <b>32g of fat</b>. For <b>$1.27 per serving</b>, this recipe <b>covers 31%</b> of your daily requirements of vitamins and minerals. If you have kosher salt, sage, eggs, and a few other ingredients on hand, you can make it. This recipe is liked by 7 foodies and cooks. From preparation to the plate, this recipe takes approximately <b>approximately 45 minutes</b>. It will be a hit at your <b>Thanksgiving</b> event. It works well as a side dish. It is brought to you by Foodista. All things considered, we decided this recipe <b>deserves a spoonacular score of 70%</b>. This score is solid. Similar recipes include <a href=\"https://spoonacular.com/recipes/sage-and-cornbread-stuffing-586808\">Sage and Cornbread Stuffing</a>, <a href=\"https://spoonacular.com/recipes/sausage-sage-cornbread-stuffing-828488\">Sausage, Sage & Cornbread Stuffing</a>, and <a href=\"https://spoonacular.com/recipes/cornbread-apple-and-sage-stuffing-510811\">Cornbread Apple and Sage Stuffing</a>.",
        "nutrition": {
            "percentFat": 38.16,
            "percentCarbs": 52.12,
            "percentProtein": 9.72
        },
        "macro": "custom"
    },
    {
        "id": 991625,
        "title": "Nutella Buttercream Cupcakes with Hidden Cadbury Egg",
        "steps": "Preheat oven to 350 degrees.\nGrease 6 jumbo muffin tin.\nCombine cake mix milk, vanilla and oil. Mix till combined.\nAdd eggs beat till mixed well. Bake for 18- 21 min\nAfter cooking cupcakes use a spoon and cut out enough area to insert Cadbury egg.\nMaking sure the smaller part of the egg is facing up.\nFrost the cupcake hiding the Cadbury egg.",
        "url": "https://www.pinkwhen.com/nutella-buttercream-cupcakes-with-hidden-cadbury-egg/",
        "servings": 6,
        "minutes": 35,
        "summary": "Nutella Buttercream Cupcakes with Hidden Cadbury Egg could be just the <b>gluten free and lacto ovo vegetarian</b> recipe you've been looking for. This recipe makes 6 servings with <b>242 calories</b>, <b>10g of protein</b>, and <b>21g of fat</b> each. For <b>54 cents per serving</b>, this recipe <b>covers 9%</b> of your daily requirements of vitamins and minerals. A few people made this recipe, and 14 would say it hit the spot. If you have milk, eggs, oil, and a few other ingredients on hand, you can make it. This recipe is typical of American cuisine. From preparation to the plate, this recipe takes approximately <b>35 minutes</b>. It is brought to you by Pink When. Overall, this recipe earns a <b>good spoonacular score of 73%</b>. <a href=\"https://spoonacular.com/recipes/egg-nog-hazelnut-cupcakes-with-nutella-buttercream-frosting-63942\">Egg Nog-hazelnut Cupcakes With Nutella Buttercream Frosting</a>, <a href=\"https://spoonacular.com/recipes/cadbury-creme-egg-cupcakes-554644\">Cadbury Creme Egg Cupcakes</a>, and <a href=\"https://spoonacular.com/recipes/chocolate-cupcakes-with-nutella-buttercream-591461\">Chocolate Cupcakes with Nutella Buttercream</a> are very similar to this recipe.",
        "nutrition": {
            "percentFat": 78.13,
            "percentCarbs": 4.3,
            "percentProtein": 17.57
        },
        "macro": "custom"
    },
    {
        "id": 716198,
        "title": "Tart Raspberry Sorbet with a Hint of Heat",
        "steps": "Combine all of the ingredients in a food processor and process until smooth. Push the mixture through a strainer to remove most of the seeds from the raspberries. Transfer the mixture to a container, cover, and transfer to the freezer. Every few hours, check to see how it is setting and mix it around a little. Near the end of the freezing time, you may want to shape it into balls with an ice cream scoop or large spoon.*When the mixture is frozen, it is ready to eat. You may want to let it thaw for a few minutes before serving, depending on how cold your freezer is and how solid the sorbet is.*Note: I let the sorbet freeze overnight and then let it thaw for a few minutes until I could scoop it out of the container to serve.",
        "url": "http://foodandspice.blogspot.com/2012/07/tart-raspberry-sorbet-with-hint-of-heat.html",
        "servings": 6,
        "minutes": 45,
        "summary": "The recipe Tart Raspberry Sorbet with a Hint of Heat is ready <b>in roughly 45 minutes</b> and is definitely a super <b>gluten free and vegan</b> option for lovers of Mexican food. For <b>62 cents per serving</b>, this recipe <b>covers 2%</b> of your daily requirements of vitamins and minerals. This recipe makes 6 servings with <b>40 calories</b>, <b>0g of protein</b>, and <b>0g of fat</b> each. This recipe from foodandspice.blogspot.com has 39 fans. If you have raspberry jam, raspberries, juice of lime, and a few other ingredients on hand, you can make it. All things considered, we decided this recipe <b>deserves a spoonacular score of 43%</b>. This score is good. Try <a href=\"https://spoonacular.com/recipes/blush-slush-frozen-black-raspberry-cocktail-to-beat-the-heat-918632\">Blush Slush – Frozen Black Raspberry Cocktail to Beat the Heat</a>, <a href=\"https://spoonacular.com/recipes/tart-cherry-mint-sorbet-764909\">Tart Cherry & Mint Sorbet</a>, and <a href=\"https://spoonacular.com/recipes/rich-tart-lemon-sorbet-202555\">Rich, Tart Lemon Sorbet</a> for similar recipes.",
        "nutrition": {
            "percentFat": 4.42,
            "percentCarbs": 91.61,
            "percentProtein": 3.97
        },
        "macro": "custom"
    },
    {
        "id": 654679,
        "title": "Parmesan Mashed Potatoes",
        "steps": "<ol><li>Place potatoes in a medium pot and cover with cold water. Bring to a boil, heat to a simmer. Add a generous pinch of salt and continue to simmer until potatoes are fork tender, about 20 minutes. Heat cream, salt and pepper and butter in a medium saucepan over medium heat until steaming hot, about 6 minutes.</li><li>When potatoes are done, drain and return potatoes to pot to dry slightly. Optional: Run potatoes through food mill or potato ricer into pot.</li><li>Add potatoes to the cream and butter mixture. Stir in parmesan cheese, taste for seasoning.</li></ol>",
        "url": "http://www.foodista.com/recipe/WRQP2BQF/parmesan-mashed-potatoes",
        "servings": 4,
        "minutes": 45,
        "summary": "You can never have too many side dish recipes, so give Parmesan Mashed Potatoes a try. One serving contains <b>687 calories</b>, <b>16g of protein</b>, and <b>51g of fat</b>. For <b>$1.44 per serving</b>, this recipe <b>covers 17%</b> of your daily requirements of vitamins and minerals. It is a good option if you're following a <b>gluten free</b> diet. Not a lot of people made this recipe, and 9 would say it hit the spot. If you have butter, cream, salt and pepper, and a few other ingredients on hand, you can make it. It will be a hit at your <b>Thanksgiving</b> event. From preparation to the plate, this recipe takes approximately <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 50%</b>. This score is pretty good. Try <a href=\"https://spoonacular.com/recipes/parmesan-mashed-potatoes-298926\">Parmesan Mashed Potatoes</a>, <a href=\"https://spoonacular.com/recipes/buttermilk-parmesan-mashed-potatoes-215001\">Buttermilk-Parmesan Mashed Potatoes</a>, and <a href=\"https://spoonacular.com/recipes/nannys-parmesan-mashed-potatoes-878138\">Nanny's Parmesan Mashed Potatoes</a> for similar recipes.",
        "nutrition": {
            "percentFat": 65.73,
            "percentCarbs": 25.28,
            "percentProtein": 8.99
        },
        "macro": "custom"
    },
    {
        "id": 632874,
        "title": "Asian Salmon Burgers With Tangy Ginger Lime Sauce",
        "steps": "<ol><li>Cut the salmon into large hunks and run it through a food processor until no large pieces remain.</li><li>Add to the salmon the soy sauce, garlic, ginger, oyster sauce, green onion, and basil.</li><li>Combine ingredients well and form 4 large patties from mixture.</li><li>Heat up the sesame oil in a large frying pan on medium high heat and add in the patties. Cook for about 10 minutes flipping once half way through.</li><li>To make the sauce, add together all the above listed ingredients and stir to combine.</li><li>Pour a spoonful of sauce over the top of the finished salmon burger and serve inside a toasted bun.</li></ol>",
        "url": "http://www.foodista.com/recipe/FRT38YTC/asian-salmon-burgers-with-tangy-ginger-lime-sauce",
        "servings": 4,
        "minutes": 30,
        "summary": "The recipe Asian Salmon Burgers With Tangy Ginger Lime Sauce is ready <b>in roughly 30 minutes</b> and is definitely a spectacular <b>pescatarian</b> option for lovers of American food. One serving contains <b>564 calories</b>, <b>28g of protein</b>, and <b>40g of fat</b>. For <b>$3.7 per serving</b>, this recipe <b>covers 23%</b> of your daily requirements of vitamins and minerals. A couple people really liked this main course. This recipe is liked by 18 foodies and cooks. Head to the store and pick up oyster sauce, juice of lime, mayonnaise, and a few other things to make it today. To use up the sour cream you could follow this main course with the <a href=\"https://spoonacular.com/recipes/sour-cream-apple-pie-70374\">Sour Cream Apple Pie</a> as a dessert. All things considered, we decided this recipe <b>deserves a spoonacular score of 77%</b>. This score is solid. Try <a href=\"https://spoonacular.com/recipes/asian-turkey-burgers-with-sriracha-lime-yogurt-sauce-510571\">Asian Turkey Burgers with Sriracha Lime Yogurt Sauce</a>, <a href=\"https://spoonacular.com/recipes/asian-coconut-rice-with-steamed-vegetables-in-soy-lime-ginger-sauce-612309\">Asian Coconut Rice with Steamed Vegetables in Soy-Lime-Ginger Sauce</a>, and <a href=\"https://spoonacular.com/recipes/crispy-asian-chicken-wings-with-ginger-lime-dipping-sauce-595560\">Crispy Asian Chicken Wings with Ginger-Lime Dipping Sauce</a> for similar recipes.",
        "nutrition": {
            "percentFat": 63.83,
            "percentCarbs": 16.44,
            "percentProtein": 19.73
        },
        "macro": "custom"
    },
    {
        "id": 643859,
        "title": "Frittata with Mushrooms, Thyme, and Parmigiano Cheese",
        "steps": "<ol><li>Pre-heat oven on to 350 degrees (later you'll change it to \"Broil\").</li><li>Heat an 8-inch ovenproof skillet over medium-high heat.</li><li>Coat pan with cooking spray or butter.</li><li>Add mushrooms and green onions to pan; saut 12 minutes or until mushrooms are nicely browned.</li><li>In a medium bowl, add the eggs and egg replacement.</li><li>Add the half and half.</li><li>Add the Parmesan cheese.</li><li>Add the thyme and any additional herbs that you like.</li><li>Add salt and pepper and whisk everything together.</li><li>Pour the egg/cheese mixture into the same pan with the sauteed mushrooms and green onions.</li><li>Heat pan over medium heat.</li><li>Cook, covered, for about 6 minutes or when it is just a little bit liquid-y/runny on the top.</li><li>At that point, place the pan into the oven and cook on 350 for another 5 - 10 minutes.</li><li>Once the frittata is completely set and cooked (not runny on top) change the oven temperature to \"Broil\".</li><li>Place the pan on the lowest rack of the oven and broil for about 2 minutes or until a golden brown color forms on the top.</li></ol>",
        "url": "http://www.foodista.com/recipe/ZPHDGMDB/frittata-with-mushrooms-thyme-and-parmigiano-cheese",
        "servings": 8,
        "minutes": 45,
        "summary": "Frittata with Mushrooms, Thyme, and Parmigiano Cheese might be just the main course you are searching for. For <b>$1.0 per serving</b>, this recipe <b>covers 15%</b> of your daily requirements of vitamins and minerals. This recipe makes 8 servings with <b>179 calories</b>, <b>20g of protein</b>, and <b>7g of fat</b> each. A mixture of half and half, jumbo eggs, ground pepper, and a handful of other ingredients are all it takes to make this recipe so delicious. To use up the eggs you could follow this main course with the <a href=\"https://spoonacular.com/recipes/rose-levy-beranbaums-chocolate-tomato-cake-with-mystery-ganache-27408\">Rose Levy Beranbaum's Chocolate Tomato Cake with Mystery Ganache</a> as a dessert. It is a good option if you're following a <b>gluten free</b> diet. 59 people have tried and liked this recipe. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 64%</b>. This score is pretty good. Try <a href=\"https://spoonacular.com/recipes/mushrooms-parmigiano-cheese-and-courgettes-8905\">Mushrooms, Parmigiano Cheese And Courgettes</a>, <a href=\"https://spoonacular.com/recipes/asparagus-frittata-with-smoked-paprika-thyme-feta-cheese-584610\">Asparagus Frittata with Smoked Paprika, Thyme & Feta Cheese</a>, and <a href=\"https://spoonacular.com/recipes/cheese-thyme-wrapped-mushrooms-220762\">Cheese & thyme wrapped mushrooms</a> for similar recipes.",
        "nutrition": {
            "percentFat": 38.2,
            "percentCarbs": 18.46,
            "percentProtein": 43.34
        },
        "macro": "custom"
    },
    {
        "id": 660231,
        "title": "Skinny Veggie Fried Rice",
        "steps": "Heat a wok or skillet on med-high and add 1 tsp oil. To it add minced ginger and 1 tsp minced garlic. Saute until fragrant but not burnt. Add mushroom pieces. Cook until tender for 5-6 minutes. Keep mushrooms along with any juices aside in a bowl.\nHeat wok again add 1 tsp oil. To it add remaining garlic. Saute until fragrant and add all the vegetables. Stir it all together on high flame. Add salt, black pepper and splash of soy sauce. Toss to coat and let them cook for few more minutes until they get tender but not soft. You want veggies to be cooked but with a little crunch. Now add the cold already cooked rice and stir it so it all gets mixed together. Do with a gentle hand. Let the rice get warm at med- high flame.Add the remaining 1 tsp oil along with salt, black pepper and soy sauce. Add the mushrooms and tofu(if using). Mix it all together. Toss and taste.\nGarnish with chopped green parts of green onions and sesame seeds.",
        "url": "https://www.foodista.com/recipe/S53BXV6Z/skinny-veggie-fried-rice",
        "servings": 2,
        "minutes": 45,
        "summary": "Skinny Veggie Fried Rice takes around <b>around 45 minutes</b> from beginning to end. This side dish has <b>175 calories</b>, <b>5g of protein</b>, and <b>9g of fat</b> per serving. This recipe serves 2. For <b>$1.4 per serving</b>, this recipe <b>covers 18%</b> of your daily requirements of vitamins and minerals. A mixture of , salt, baby corns, and a handful of other ingredients are all it takes to make this recipe so tasty. It is brought to you by Foodista. Only a few people really liked this Chinese dish. This recipe is liked by 8 foodies and cooks. It is a good option if you're following a <b>gluten free, dairy free, lacto ovo vegetarian, and vegan</b> diet. Overall, this recipe earns a <b>great spoonacular score of 92%</b>. Try <a href=\"https://spoonacular.com/recipes/skinny-chicken-fried-rice-484957\">Skinny Chicken Fried Rice</a>, <a href=\"https://spoonacular.com/recipes/skinny-garlic-fried-rice-601655\">Skinny Garlic Fried Rice</a>, and <a href=\"https://spoonacular.com/recipes/veggie-fried-rice-846125\">Veggie Fried Rice</a> for similar recipes.",
        "nutrition": {
            "percentFat": 41.58,
            "percentCarbs": 47.55,
            "percentProtein": 10.87
        },
        "macro": "custom"
    },
    {
        "id": 663313,
        "title": "The Pearhattan Cocktail",
        "steps": "<ol><li>Pour ingredients into shaker and fill with ice. Shake well and serve unstrained, on the rocks. Add one or two pear-lemon ice cubes to taste and garnish with a fresh Bing cherry or lemon twist, if desired.</li><li>To make the Pear-lemon ice cubes:</li><li>Whisk the pear juice with the lemon juice and a small pinch of salt. Add some simple syrup or water to thin slightly, if necessary. Pour the liquid into a pitcher and use it to fill the cavities of two ice cube trays almost to the top. Leave in freezer for at least 3 hours or until completely frozen. This recipe makes enough to fill two standard ice cube trays.</li></ol>",
        "url": "http://www.foodista.com/recipe/SXTRH8NR/the-pearhattan-cocktail",
        "servings": 1,
        "minutes": 45,
        "summary": "The Pearhattan Cocktail might be just the beverage you are searching for. One serving contains <b>217 calories</b>, <b>1g of protein</b>, and <b>0g of fat</b>. For <b>$3.33 per serving</b>, this recipe <b>covers 4%</b> of your daily requirements of vitamins and minerals. Only a few people made this recipe, and 6 would say it hit the spot. If you have rye whiskey, freshly usa pear, salt, and a few other ingredients on hand, you can make it. It is a good option if you're following a <b>gluten free and vegan</b> diet. From preparation to the plate, this recipe takes around <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 19%</b>. This score is not so tremendous. Try <a href=\"https://spoonacular.com/recipes/shrimp-pineapple-and-avocado-cocktail-cocktail-de-camarones-con-pia-y-aguacate-227319\">Shrimp, Pineapple and Avocado Cocktail (Cocktail de Camarones con Piña y Aguacate)</a>, <a href=\"https://spoonacular.com/recipes/russian-gringo-cocktail-a-cocktail-created-by-ukrainian-and-spanish-friends-601203\">Russian Gringo Cocktail a cocktail created by Ukrainian and Spanish friends</a>, and <a href=\"https://spoonacular.com/recipes/shrimp-cocktail-bar-classic-cocktail-sauce-avocado-crema-remoulade-770566\">Shrimp Cocktail Bar: Classic Cocktail Sauce, Avocado Crema, Remoulade</a> for similar recipes.",
        "nutrition": {
            "percentFat": 2.36,
            "percentCarbs": 95.24,
            "percentProtein": 2.4
        },
        "macro": "custom"
    }
]